[

    {
        "type": "action",
        "text": "It was just another normal day on Planet Earth. It was a beautiful normal day like any other, Vini was living his normal life, he still hadn't showered, and he was talking to his friend Yasmin through Discord. It was a simple super decisive conversation for her to finally pay the X-Tudo Vini wanted so much. Vini was very happy, as he had been waiting for this day for several months, so this was the decisive magic moment. Everything was extremely quiet. It was just a silly Discord conversation like any other day."
    },

    {
        "type": "action",
        "text": "Yasmin then looked at the monitor impatiently, and just wanted to get this story over with, so he wouldn't need to talk about X-Tudo anymore."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "ah! Ready! I finally got my credit card working! I'm going to buy your X-Tudo now! Now it's time to stop this silly nonsense time!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Yes! Yeees Yasmin!!!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "message": "You've messed up the entire online casino! Don't think this will happen again!"
    },

    {
        "type": "action",
        "text": "Yasmin would then sigh deeply and slowly calm down when she realized that everything was finally solved. She was very thoughtful observing the whole situation before confirming the order"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "message": "Uff...Okay... I sent your order just the way you asked. The delivery man of food app is already on his way to your house. I recommend you keep an eye on the GPS, or the delivery boy will pass right by."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Wow, my address isn't right? Motoca is going to screw up my X-Tudo!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Ah Vini! Nope nope! You sent the address! You're going to receive your X-Tudo!"
    },

    {
        "type": "action",
        "text": "Right now Vini's phone started beeping Food App Notifications."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Oh yes, man!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Heh! Let me see my phone beeped here."
    },

    {
        "type": "action",
        "text": "Vini anxiously raises his hand and takes the phone, after unlocking it with his finger he looks at the notifications"
    },

    {
        "type": "action",
        "text": "Vini saw the notification that the delivery boy was about to arrive, his cell phone already asking him to go to the door of his house to wait for the delivery boy"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "so? He is coming?"
    },

    {
        "type": "action",
        "text": "Yasmin spoke giving a silly little laugh."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "I want you to take the phone with you, I left a reminder in App Food about a little surprise for you when the order arrives."
    },

    {
        "type": "action",
        "text": "Surprised Vini speaks in a curious way."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "What the hell? What would that be?"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Okay, let me enter the call on my cell, HOLD IT!!!!!!!!!!"
    },

    {
        "type": "action",
        "text": "Yasmin laughs harder before answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Relax siily Vini... you'll find out. Please... Just don't screw it all up. Mainly the phone!"
    },

    {
        "type": "action",
        "text": "Meanwhile, Vini began to hear the noise of the motorcycle."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Okay okay! Let me go see the gate. YES!"
    },

    {
        "type": "action",
        "text": "Vini then got up from his computer. He was home alone. He then went to the gate to open it to receive the food. Meanwhile Yasmin kept laughing and answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Don't worry, the surprise will be all good like your X-Tudo."
    },

    {
        "type": "action",
        "text": "Vini then met with the delivery boy, already looking a bit confused about what Yasmin was talking about."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Hello... good afternoon sir, are you Vinicius?"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Look there! Go mess up the delivery boy again!"
    },

    {
        "type": "action",
        "text": "Yasmin reply with a silly giggle."
    },

    {
        "type": "action",
        "text": "Vini was wanting to speed up and get back to his room soon before the delivery boy could hear Yasmin laughing"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Oops good afternoon, it's me yes, is it the snack?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Oops... yes, Your lunch... An X-Tudo. Everything and a little more..."
    },

    {
        "type": "action",
        "text": "Delivery Boy tried to react naturally when he noticed a kind of anxiety in Vini."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "This burger was vibrating inside my motocycle, so please, if there's something wrong with your lunch, let me know that we'll exchange your lunch for a new one."
    },

    {
        "type": "action",
        "message": "Delivery Boy delivered the X-Tudo box kindly to you."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "The burger has arrived! Finally arrived!"
    },

    {
        "type": "action",
        "message": "Yasmin continued the silly giggles, happy to see Vini's reaction."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "it's a joke, right? prank right? What is this vibration?"
    },

    {
        "type": "action",
        "message": "Vini reply with a surprised face and mischievousness."
    },

    {
        "type": "action",
        "message": "Delivery Boy looked a little awkwardly, not knowing what to say."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Yes.... I saw...vibrating. Sorry for the expression, it was a quick word. Ah! Please! Just get it soon! It could be anything, maybe something inside the burguer, you'll need to check it out to see what it is."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "...Okay can i open it now before you leave?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "feel free... Just don't delay please. I'm getting late."
    },

    {
        "type": "action",
        "message": "Yasmin kept laughing and trying to talk to Vini."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Then? Where's X-Tudo? We need to see the surprise together to be more fun!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Calm down Yasmin, the guy said there's some stuff vibrating here and I'll show you on cam."
    },

    {
        "type": "action",
        "message": "Vini opens the box slowly. Afraid about what was inside the box. Vini see an X-Tudo, very big, just the way he wanted, twice the size that was in the photo."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Everything seems normal to me... Ah! It must have been a mistake, maybe it was the bike that was vibrating and I didn't notice. Sorry there bro!"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "well... I have to leave now, don't forget to give me 5 stars, thanks."
    },

    {
        "type": "action",
        "message": "The Delivery Boy, without thinking twice, was already leaving."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Are you kidding me? What was this thing vibrating?"
    },

    {
        "type": "action",
        "message": "Yasmin then kept laughing until she heard Vini talking."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Vibrating? What?! Oh silly Vini! Don't make up jokes! Haven't you noticed the surprise yet?"
    },

    {
        "type": "action",
        "message": "Vini was extremely confused. Trying to understand what was going on. Trying not to think about what he was thinking."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Yasmin, did you tell the delivery boy to do this prank on me? WHY?!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Prank? What?! Don't tell me you haven't figured out what the surprise is yet!"
    },

    {
        "type": "action",
        "message": "Vini enters and goes to the kitchen to get a plate and goes back to the bedroom. The X-Tudo mysteriously started to vibrate a little on the table"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "message": "Fuck, this fuck is alive..."
    },

    {
        "type": "action",
        "message": "Vini approaches X-Tudo and will analyze the burguer carefully."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Live? Vini! What did you do with X-Tudo? Haven't you noticed the obvious yet?"
    },

    {
        "type": "action",
        "message": "When Vini tried to analyze X-Tudo, he felt a kind of blue light, but X-Tudo didn't want to be opened completely at all, it just vibrated more with each touch it received."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Yasmin, there's some stuff coming out of X-Tudo."
    },

    {
        "type": "action",
        "message": "Vini looked at the X-Tudo and tried harder to open it."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Coming out of X-Tudo? What are you talking about! I only ordered a double size!"
    },

    {
        "type": "action",
        "message": "The X-Tudo vibrated more and more, and the light started to get stronger, but Vini was starting to realize that he was making progress, and that he just needed to do a little more force, as he accidentally spilled some parts of the X-Tudo on the table because of the vibration."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "N..Noo! My house! Wait, I'm looking at what's inside the X-Tudo, everything and a little more, hold it there."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Vini... You're scaring me. What's happening there?"
    },

    {
        "type": "action",
        "message": "Vini still keeps trying to force against the burguer, feeling extremely difficult to keep trying this again and again."
    },

    {
        "type": "action",
        "message": "While more Vini tried, but the light got stronger, and X-Tudo vibrated extremely hard, spilling all parts of X-Tudo all over the kitchen, making a loud noise on the table because of the vibration"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "NO NO NOOO! MY HOUSE!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "V...Vini? Are you okay? It's for eating X-Tudo! It's not to mess up the X-Tudo! What are you doing?!"
    },

    {
        "type": "action",
        "message": "Yasmin started talking in a worried voice. Then Vini finally manages to open X-Tudo, making all the rest of X-Tudo fly all over the place, he soon realizes what he was pulling inside X-Tudo, in fact it was a kind of bracelet, which quickly attaches to the his arm, but in the middle of it all comes a very bright light that takes over the whole kitchen."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "W..What?! What is this Vini? Did the restaurant give you any SmartWatch as a gift?!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Stop kidding! I need help! What is happening?! W...What fuck?! My house will explode!"
    },

    {
        "type": "action",
        "message": "The glow then started to behave like a black hole, trying to pull Vini into it."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "No, no! NO! This is IMPOSSIBLE! Damn Jasmin it happened, I don't know, your X-Tudo blew up and it's sucking me, this shit stuck on my arm, I'm going to turn the Men 10!!!!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Oh my god! I'll call the police!"
    },

    {
        "type": "action",
        "message": "Vini was in the last seconds of his presence before the black hole sucked him in completely, and suddenly he disappeared along with his phone, which was increasingly losing signal as he went deeper into the mysterious black hole."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Vini?! C.......of.........you....O... ...What's happening?! V...Vini! The sign! Signal is horrible! N...Nooo! Came back here! V....Viiiiini!"
    },

    {
        "type": "action",
        "message": "and the signal was completely lost and the Discord connection dropped while Vini continued to be sucked deeper into the black hole"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Yasmin what did you do?! NOOO!"
    },

    {
        "type": "action",
        "message": "Then suddenly everything went blank, and Vini's consciousness was temporarily lost for an unknown period of time."
    },

    {
        "type": "action",
        "message": "After a long time, Vini was in another mysterious place, his phone was with him, it was a beautiful day, the morning was starting, another normal day in a place called Greendream Beach, everything was very calm, the beach was deserted as usual because of the schedule. And mysteriously Vini wakes up on the beach, lost not knowing why he was there."
    },

    {
        "type": "think",
        "character": "Vini",
        "text": "Damn man, what happened? I was talking to Yasmin and suddenly... X-TUUUUUUUDO!!! What the fuck happened..."
    },

    {
        "type": "action",
        "message": "Vini look at he arm curiously. Soon Vini noticed that everything was very different with his body when he felt the shape of his body. Instead of him seeing hands, he saw pony paws, while the calm water of the beach continued to calmly move on the sand."
    },

]