[

    {
        "set": {
            "where": "Planet Earth",
            "dayNightCycle": "morning",
            "day": 1,
            "weather": "sun",
            "playlistPlay": null
        },
        "type": "action",
        "value": "It was just another normal day on Planet Earth. It was a beautiful normal day like any other, Vinny was living his normal life, he still hadn't showered, and he was talking to his friend Yasmin through Discord. It was a simple super decisive conversation for her to finally pay the X-Tudo Vinny wanted so much. Vinny was very happy, as he had been waiting for this day for several months, so this was the decisive magic moment. Everything was extremely quiet. It was just a silly Discord conversation like any other day."
    },

    {
        "set": { "playlistPlay": "happyness" },
        "type": "action",
        "value": "Yasmin then looked at the monitor impatiently, and just wanted to get this story over with, so he wouldn't need to talk about X-Tudo anymore."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "ah! Ready! I finally got my credit card working! I'm going to buy your X-Tudo now! Now it's time to stop this silly nonsense time!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Yes! Yeees Yasmin!!!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "You've messed up the entire online casino! Don't think this will happen again!"
    },

    {
        "type": "action",
        "value": "Yasmin would then sigh deeply and slowly calm down when she realized that everything was finally solved. She was very thoughtful observing the whole situation before confirming the order"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Uff... Okay. I sent your order just the way you asked. The delivery man of food app is already on his way to your house. I recommend you keep an eye on the GPS, or the delivery boy will pass right by."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Wow, my address isn't right? Motoca is going to screw up my X-Tudo!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Ah Vinny! Nope nope! You sent the address! You're going to receive your X-Tudo!"
    },

    {
        "type": "action",
        "value": "Right now Vinny's phone started beeping Food App Notifications."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Oh yes, man!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Heh! Let me see my phone beeped here."
    },

    {
        "type": "action",
        "value": "Vinny anxiously raises his hand and takes the phone, after unlocking it with his finger he looks at the notifications"
    },

    {
        "type": "action",
        "value": "Vinny saw the notification that the delivery boy was about to arrive, his cell phone already asking him to go to the door of his house to wait for the delivery boy"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "so? He is coming?"
    },

    {
        "type": "action",
        "value": "Yasmin spoke giving a silly little laugh."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "I want you to take the phone with you, I left a reminder in App Food about a little surprise for you when the order arrives."
    },

    {
        "type": "action",
        "value": "Surprised Vinny speaks in a curious way."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "What the hell? What would that be?"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Okay, let me enter the call on my cell, HOLD IT!!!!!!!!!!"
    },

    {
        "type": "action",
        "value": "Yasmin laughs harder before answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Siily Vinny... Relax. You'll find out. Please, just don't screw it all up. Mainly the phone!"
    },

    {
        "type": "action",
        "value": "Meanwhile, Vinny began to hear the noise of the motorcycle."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Okay okay! Let me go see the gate. YES!"
    },

    {
        "type": "action",
        "value": "Vinny then got up from his computer. He was home alone. He then went to the gate to open it to receive the food. Meanwhile Yasmin kept laughing and answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Don't worry, the surprise will be all good like your X-Tudo."
    },

    {
        "type": "action",
        "value": "Vinny then met with the delivery boy, already looking a bit confused about what Yasmin was talking about."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Hello, good afternoon sir, are you Vinicius?"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Look there! Go mess up the delivery boy again!"
    },

    {
        "type": "action",
        "value": "Yasmin reply with a silly giggle."
    },

    {
        "type": "action",
        "value": "Vinny was wanting to speed up and get back to his room soon before the delivery boy could hear Yasmin laughing"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Oops good afternoon, it's me yes, is it the snack?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Oops... Yes, your lunch... An X-Tudo. Everything and a little more."
    },

    {
        "type": "action",
        "value": "Delivery Boy tried to react naturally when he noticed a kind of anxiety in Vinny."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "This burger was vibrating inside my motocycle, so please, if there's something wrong with your lunch, let me know that we'll exchange your lunch for a new one."
    },

    {
        "type": "action",
        "value": "Delivery Boy delivered the X-Tudo box kindly to you."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "The burger has arrived! Finally arrived!"
    },

    {
        "type": "action",
        "value": "Yasmin continued the silly giggles, happy to see Vinny's reaction."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "it's a joke, right? prank right? What is this vibration?"
    },

    {
        "type": "action",
        "value": "Vinny reply with a surprised face and mischievousness."
    },

    {
        "type": "action",
        "value": "Delivery Boy looked a little awkwardly, not knowing what to say."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Yes.... I saw vibrating. Sorry for the expression, it was a quick word. Ah! Please! Just get it soon! It could be anything, maybe something inside the burguer, you'll need to check it out to see what it is."
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Vinny",
        "value": "Okay can i open it now before you leave?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "feel free, just don't delay please. I'm getting late."
    },

    {
        "type": "action",
        "value": "Yasmin kept laughing and trying to talk to Vinny."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Then? Where's X-Tudo? We need to see the surprise together to be more fun!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Calm down Yasmin, the guy said there's some stuff vibrating here and I'll show you on cam."
    },

    {
        "type": "action",
        "value": "Vinny opens the box slowly. Afraid about what was inside the box. Vinny see an X-Tudo, very big, just the way he wanted, twice the size that was in the photo."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Everything seems normal to me...Ah! It must have been a mistake, maybe it was the bike that was vibrating and I didn't notice. Sorry there bro!"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Well... I have to leave now, don't forget to give me 5 stars, thanks."
    },

    {
        "set": { "playlistPlay": null },
        "type": "action",
        "value": "The Delivery Boy, without thinking twice, was already leaving."
    },

    {
        "set": { "playlistPlay": "tech-problem" },
        "type": "dialogue",
        "character": "Vinny",
        "value": "Are you kidding me? What was this thing vibrating?"
    },

    {
        "type": "action",
        "value": "Yasmin then kept laughing until she heard Vinny talking."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vibrating? What?! Oh silly Vinny! Don't make up jokes! Haven't you noticed the surprise yet?"
    },

    {
        "type": "action",
        "value": "Vinny was extremely confused. Trying to understand what was going on. Trying not to think about what he was thinking."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Yasmin, did you tell the delivery boy to do this prank on me? WHY?!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Prank? What?! Don't tell me you haven't figured out what the surprise is yet!"
    },

    {
        "type": "action",
        "value": "Vinny enters and goes to the kitchen to get a plate and goes back to the bedroom. The X-Tudo mysteriously started to vibrate a little on the table"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Ah! Fuck, this fuck is alive."
    },

    {
        "type": "action",
        "value": "Vinny approaches X-Tudo and will analyze the burguer carefully."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Live? Vinny! What did you do with X-Tudo? Haven't you noticed the obvious yet?"
    },

    {
        "type": "action",
        "value": "When Vinny tried to analyze X-Tudo, he felt a kind of blue light, but X-Tudo didn't want to be opened completely at all, it just vibrated more with each touch it received."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Yasmin, there's some stuff coming out of X-Tudo."
    },

    {
        "type": "action",
        "value": "Vinny looked at the X-Tudo and tried harder to open it."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Coming out of X-Tudo? What are you talking about! I only ordered a double size!"
    },

    {
        "type": "action",
        "value": "The X-Tudo vibrated more and more, and the light started to get stronger, but Vinny was starting to realize that he was making progress, and that he just needed to do a little more force, as he accidentally spilled some parts of the X-Tudo on the table because of the vibration."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "N..Noo! My house! Wait, I'm looking at what's inside the X-Tudo, everything and a little more, hold it there."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vinny... You're scaring me. What's happening there?"
    },

    {
        "type": "action",
        "value": "Vinny still keeps trying to force against the burguer, feeling extremely difficult to keep trying this again and again."
    },

    {
        "type": "action",
        "value": "While more Vinny tried, but the light got stronger, and X-Tudo vibrated extremely hard, spilling all parts of X-Tudo all over the kitchen, making a loud noise on the table because of the vibration"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "NO NO NOOO! MY HOUSE!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "V...Vinny? Are you okay? It's for eating X-Tudo! It's not to mess up the X-Tudo! What are you doing?!"
    },

    {
        "type": "action",
        "value": "Yasmin started talking in a worried voice. Then Vinny finally manages to open X-Tudo, making all the rest of X-Tudo fly all over the place, he soon realizes what he was pulling inside X-Tudo, in fact it was a kind of bracelet, which quickly attaches to the his arm, but in the middle of it all comes a very bright light that takes over the whole kitchen."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "W..What?! What is this Vinny? Did the restaurant give you any SmartWatch as a gift?!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Stop kidding! I need help! What is happening?! W...What fuck?! My house will explode!"
    },

    {
        "type": "action",
        "value": "The glow then started to behave like a black hole, trying to pull Vinny into it."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "No, no! NO! This is IMPOSSIBLE! Damn Jasmin it happened, I don't know, your X-Tudo blew up and it's sucking me, this shit stuck on my arm, I'm going to turn the Men 10!!!!"
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Oh my god! I'll call the police!"
    },

    {
        "type": "action",
        "value": "Vinny was in the last seconds of his presence before the black hole sucked him in completely, and suddenly he disappeared along with his phone, which was increasingly losing signal as he went deeper into the mysterious black hole."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vinny?! C.......of.........you....O... ...What's happening?! V...Vinny! The sign! Signal is horrible! N...Nooo! Came back here! V....Viiiiini!"
    },

    {
        "type": "action",
        "value": "and the signal was completely lost and the Discord connection dropped while Vinny continued to be sucked deeper into the black hole"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Yasmin what did you do?! NOOO!"
    },

    {
        "type": "action",
        "value": "Then suddenly everything went blank, and Vinny's consciousness was temporarily lost for an unknown period of time."
    },

    {
        "set": {
            "where": "Greendream Beach",
            "playlistPlay": "sad"
        },
        "type": "action",
        "value": "After a long time, Vinny was in another mysterious place, his phone was with him, it was a beautiful day, the morning was starting, another normal day on the place, everything was very calm, the beach was deserted as usual because of the schedule. And mysteriously Vinny wakes up on the beach, lost not knowing why he was there."
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "Damn man, what happened? I was talking to Yasmin and suddenly... X-TUUUUUUUDO!!! What the fuck happened..."
    },

    {
        "type": "action",
        "value": "Vinny look at he arm curiously. Soon Vinny noticed that everything was very different with his body when he felt the shape of his body. Instead of him seeing hands, he saw pony paws, while the calm water of the beach continued to calmly move on the sand."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "What the...fuck... What? Am I a horse? ...a pony? I don't know."
    },

    {
        "type": "action",
        "value": "Vinny try to calm down and I see around me what is happening and I see the phone and I try to move."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "I can't touch the phone because I don't have a FINGER!!! but I see there's something on my back, it's wings!!!!!!! WHAT'S HAPPENING HERE?!"
    },

    {
        "type": "action",
        "value": "So Vinny try to use the wings to poke the phone screen. The phone turned on the screen and when the face detector felt the presence of Vinny eyes, and all Vinny saw was just the screen locked, and the phone was completely out of signal. No 4G, no Wi-Fi, no internet connection."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Oooh okay."
    },

    {
        "type": "action",
        "value": "Vinny was sad and hopeless. He didn't know what else could be done in that moment now. Suddenly Vinny starts to hear the sound of footsteps approaching from the opposite direction to him, coming slowly, making him look back curiously."
    },

    {
        "type": "action",
        "value": "Vinny see a silhouette of another pony slowly approaching, thinking to do contact with you, and it gets closer and closer."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "W...what? O..Oh no.... Oh, okay then I'll wait."
    },

    {
        "type": "action",
        "value": "Vinny was scared, but he just accepted the fate of waiting for the mysterious earth pony to approach him."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Oh...it's not possible. It's...Is that what I'm really seeing? Did another new pony appear? Are you new around here?"
    },

    {
        "type": "action",
        "value": "The mysterious pony looked a little scared, trying to understand who you are."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Aah hi, my name is Vinny, are you guys okay? they look worried."
    },

    {
        "type": "action",
        "value": "Vinny tried to stay calm, talking calmly and trying to be calm."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Good? this should be my question. Are you sure you're alright? You look kind of scared. How long have you been here?"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Oh, I kind of don't remember but I ended up waking up just now, not sure what happened to me last night."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Last night? Have you been attacked by Elite Color?! Keep calm, I can help you!"
    },

    {
        "type": "action",
        "value": "Mysterious pony comes closer to you, offering to help you"
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Vinny",
        "value": "E..Elite color? I really don't remember, and I accept the help, thank you very much."
    },

    {
        "type": "action",
        "value": "Vinny tried to remain calm, but slowly felt better as he realized the gentleness of the mysterious pony. But he was still confused and scared about what was happening. He tried to get up but failed."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "I think I'll need more than help, I kind of can't walk."
    },

    {
        "type": "action",
        "value": "Vinny was very embarrassed to realize that he didn't know how to walk on four legs while answering."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Wait... Can't you walk? Are you sure you're from here? What city do you come from? Just try to stay balanced and don't let your body weight make you lose balance."
    },

    {
        "type": "action",
        "value": "Mysterious pony was surprised by your words, he gradually helped you to get in a balanced pose so you could stay seated."
    },

    {
        "set": { "playlistPlay": "calm" },
        "type": "dialogue",
        "character": "Vinny",
        "value": "Heck bro, I'm trying to remember and I think I remembered I was eating something and blacked out, and I came here out of nowhere."
    },

    {
        "type": "action",
        "value": "Vinny tried to balance himself between his paws as he responded."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "From... From nothing?! So I'm right! You are also a new visitor from another dimension!"
    },

    {
        "type": "action",
        "value": "Vinny lost the balance of the pose of the paws and fell on the sand again."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Oh yes, I think this is more than evidence. Hihi... Don't worry , I teach you to walk. My name is Kenny!"
    },

    {
        "type": "action",
        "value": "during the giggles of Kenny, Kenny starts to smile at Vinny and prepare to help Vinny stand up again. Vinny felt even better about Kenny's kindness. He looked at Kenny still confused about what was happening, but he simply continued to accept the help."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Yeah hihi, thanks for the help Kenny."
    },

    {
        "type": "action",
        "value": "Kenny felt happier wanting to keep helping Vinny."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "You're welcome. Just keep calm, and start walking very slowly, you need to keep balance and sync between all 4 legs. This way you'll soon learn to walk.The village is very close to here, you can rest in my house with my friend Raquel."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "When we see your SmartMoby, we'll be able to help you better."
    },

    {
        "type": "action",
        "value": "Kenny smiles again and started to help Vinny during the first steps to start to walk."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "What? What is a SmartMoby? I have one?"
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Oh sorry! Yeah! The SmartMoby is on your arm right now. This is part of you, we all have one. It's like a phone, but actually it's a device that carries your soul and keeps you alive here."
    },

    {
        "type": "action",
        "value": "Vinny looked at his arm and was surprised. That device had now merged with his arm. It was just a screen on his arm and it was impossible to remove as it was now part of his arm."
    },

    {
        "type": "action",
        "value": "Kenny kept helping Vinny walk. The place was very calm. It looked completely deserted. Vinny immediately thought it was something he had already seen somewhere. But he found it extremely strange that the ponies found were different from what he knew about ponies. Was it really the world he was thinking about or could it be just a coincidence?"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Hey man, let me get my phone, as I remember, it's a device similar to that in my world, but it has other important features, like listening to music or having many books in it."
    },

    {
        "type": "action",
        "value": "Vinny looks for the phone to store the phone in somewhere."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Listen to music? I've never seen anything like this."
    },

    {
        "type": "action",
        "value": "Kenny felt surprised and a little scared."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "But alright, let me get it! Try to stay upright!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and let Vinny go so Vinny could try to balance yourself between the 4 legs while he went to get your phone in the sand."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Okay... Fine."
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "This is much stranger than I imagined. Will I be stuck here forever? How are my friends and my parents doing?"
    },

    {
        "type": "action",
        "value": "Right after Kenny give the phone, Vinny hold the phone."
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "I remember the battery and I DIDN'T TAKE THE SHIT CHARGER! WHY?!"
    },

    {
        "type": "action",
        "value": "Vinny got mentally pissed off. and as soon as I see that there was no signal, Vinny try to turn the phone off."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Vinny? Are you okay? Is something wrong with your phone?"
    },

    {
        "type": "action",
        "value": "Kenny said with a curious face, looked at Vinny and he reactions while trying to help he keep up again. Then the two started walking towards the village."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "O..oh? Oh yeah, kind of the energy that makes it stay on runs out quickly so I'll only use it in cases of need because I need another part to recharge it. but yes he is normal, thanks for helping me get phone back."
    },

    {
        "type": "action",
        "value": "Vinny was worried about his phone battery. It looked like his phone was the last thing left of items from Earth. Vinny's clothes had mysteriously disappeared too."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Recharge a phone? Hmm... Maybe James can help you if he's willing to walk with you. He is a friend of mine who loves adventures. I believe he will be returning home soon."
    },

    {
        "type": "action",
        "value": "Kenny spoke thoughtfully as he continued to help you walk."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Okay... Let's go. Soon we'll be home!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "James? But I just met you! You're crazy?!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and ran forward, revealing that Vinny were starting to walk alone without help, but then you started to lose he balance for a few seconds when he realized that there was no one helping he."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Oh? no no no no no!"
    },

    {
        "type": "action",
        "value": "Vinny tried not to completely lose his paws balance."
    },

    {
        "type": "dialogue",
        "character": "think",
        "value": "At least he seems to be very silly. I see no reason why he wants to kidnap me."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Uff... About earlier, you said something about Elite Color, what would it be exactly?"
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Elite Color? oh! The Elite Color! Sorry, I forgot to talk about the Elite Color. Elite Color is a mysterious organization that claims to protect this world. We don't really know what they are, but sometimes they do some cruel things. They live on top of the highest mountain in Pony Driland, which is our island you're on."
    },

    {
        "type": "action",
        "value": "Kenny then looked at Vinny walking. He was surprised and very happy."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Look! By the way! You are starting to learn to walk on 4 legs! You're learning fast!"
    },

    {
        "type": "action",
        "value": "Vinny giggles a little before answering. trying to be a little friendlier"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "You also said at the beginning, or comment in a strange way, the way you entered me and said \"you also came from another dimension\" are there others besides me?"
    },

    {
        "type": "action",
        "value": "Kenny spoke with a worried face."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh yes... The others."
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "Oh shit... Here comes the bad news."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "All of us here come from many different dimensions. We've been stuck here forever, we don't know how to get out of here, it's been many years since I've seen my family, and I don't remember in detail what my real body was like."
    },

    {
        "type": "action",
        "value": "Kenny tried to be positive as he continued to explain."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "I hope you don't get scared by this fact, that's the motive I was worried when I found you here. It's very dangerous for newbies to walk alone around Pony Driland. This place is very dangerous if you don't know how things work around here."
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "HOLY SHIT! NO! FOREVER?! Is everyone here alien?! That's what i understood?! WHY?!"
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "Ah..."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Ah? Please don't be too surprised, Raquel and I are going to help you! If you've been in good company, I'm sure you'll do fine around here."
    },

    {
        "type": "action",
        "value": "Kenny was thoughtful, trying to calm Vinny down, so he responded."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "It's what we can do for Pony Driland newcomers. I'm sure you'll like your new life. Unfortunately I can't hold back your curiosities. So...if you really want to find out more about this place. You'll have to try to be friends with James."
    },

    {
        "set": { "playlistPlay": null },
        "type": "think",
        "character": "Vinny",
        "value": "James... Who is James? Why everyone is a alien in a pony body?! Look where I accidentally got myself into an X-Tudo! Someone save me from this nightmare. Please!"
    },

    {
        "type": "action",
        "value": "Kenny kept walking and he saw the village soon the front."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh! Look! We are almost there! Right in time!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and started to move faster. Vinny was surprised. He just looked around for a few seconds, looking for something randomly. So Vinny tries to follow Kenny's speed."
    },

    {
        "type": "dialogue",
        "character": "Vinny",
        "value": "H..Hey! Wait me!"
    },

    {
        "set": {
            "playlistPlay": "fantasy-village",
            "where": "Greendream Village"
        },
        "type": "action",
        "value": "Kenny arrived in the village, the village was a little busy, Vinny saw some random ponies starting another new day as Kenny arrived at his door."
    },

    {
        "value": "Kenny starts to smile and looks around looking for you.",
        "type": "action"
    },

    {
        "value": "Oh? Vinny? Vinny?! Oh Vinny! You are there!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny smiled again and waved at Vinny, happily inviting Vinny to come faster.",
        "type": "action"
    },

    {
        "value": "Vinny looked smiling back with a pokeface.",
        "type": "action"
    },

    {
        "value": "I'll get there. A moment...",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "You're doing great! Soon you will walk better on 4 legs!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny giggles a little before smiling again and kept waving at you, waiting for Vinny to arrive.",
        "type": "action"
    },

    {
        "value": "Vinny looked smiling back again with a second pokerface.",
        "type": "action"
    },

    {
        "value": "I'm coming... coming slowly.",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Vinny looked smiling back again with a second pokerface. Vinny then tried a little harder, with great difficulty, but he finally arrived.",
        "type": "action"
    },

    {
        "value": "Hah! I arrived! Yes!",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Vinny then was very thoughtful, he looked all around and was surprised by the scenery that was being observed.",
        "type": "action"
    },

    {
        "value": "Wow There's a lot of ponies here and a lot of little houses here.",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Vinny slowly felt that his walking skills were getting better and better. But he could still feel uncomfortable with the whole new environment. He looked very confused and at a loss as to how all this was possible. Why was he there, how did he get there. Everything was just amazing for Vinny.",
        "type": "action"
    },

    {
        "value": "Yes. You are in Greendream Village. Be very welcome new one!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny knock on the door happily.",
        "type": "action"
    },

    {
        "value": "Vinny found Kenny's attitude strange, he watched and analyzed him for a few seconds curiously before asking the question.",
        "type": "action"
    },

    {
        "value": "Oh? Does this house belong to you?",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Ehe! It's the house where Raquel and I live. You can feel right at home now. Uou can stay here if you need some shelter.",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny is a little nervous for a few seconds to answer, but then he continues with a smile while he look at the door being opened, so Vinny saw Raquel.",
        "type": "action"
    },

    {
        "value": "Good morning Kenny! How's the... Oh? New one?",
        "type": "dialogue",
        "character": "Raquel"
    },

    {
        "value": "Raquel spoke in a frightened way for a few seconds.",
        "type": "action"
    },

    {
        "value": "Calm down... it's Vinny. I found him on the beach where newbies spawn when they teleport here sunddely. He is here to be received! Right Vinny?",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny spoke happily while looking at Vinny.",
        "type": "action"
    },
    {

        "value": "Ah... Yes?",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Yes? Yes... Hello Vinny. Welcome.",
        "type": "dialogue",
        "character": "Raquel"
    },
    {
        "value": "Raquel looked curiously at Vinny for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "My name is Raquel, nice to meet you. It's the first time I've seen a newbie visit our house.",
        "type": "dialogue",
        "character": "Raquel"
    },

    {
        "value": "Raquel spoke in a shy way before smiling back. Vinny then tried not to scare Raquel too much and tried to respond kindly when he realized that this would be the best alternative to not being alone in the unknown world.",
        "type": "action"
    },

    {
        "value": "Pleasure, my name...well you already know. My name is Vinny hihihihi. Kenny found me at the beach and brought me here, thank you very much for your consideration.",
        "type": "dialogue",
        "character": "Vinny"
    },

    {
        "value": "Vinny smile a little more while looking around. Vinny saw houses and more ponies around having their daily routine, around Vinny also saw some trees around the village, and under these trees there were sticks and some pieces of leaf, stones, it was a very rich place in nature mixed with the village , and later on, there were other places like the street vendors' square and some buildings owned by those who manage the village.",
        "type": "action"
    },

    {
        "value": "Well... Make yourself at home...I...I made some pancakes for breakfast today.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel continued with the shy happy face as she offered to enter. Vinny then went back to listening to the conversation, surprised to hear about the meal.",
        "type": "action"
    },

    {
        "value": "Pancakes! Today is your lucky day Vinny! Pancakes are the best morning meal we have here at home!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny said all excited in response. Raquel was a little surprised but then she laughed a little. Vinny was still confused, trying to understand all that kindness. Then he would analyze the situation again and just respond. Vinny was a little nervous trying to believe Kenny.",
        "type": "action"
    },

    {
        "value": "Ahn thank you very much, but why are you helping me? You don't know me or anything like that, for example, I'm a stranger to you, don't you think it's strange for a stranger to enter your house? Even weirder that he came from another world and doesn't even know how to walk right? Doesn't it seem a little strange to you?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny got a little nervous and would just respond by laughing a little to relax.",
        "type": "action"
    },

    {
        "value": "Oh? Vinny don't worry, I saw in your face that you were lost. We work hard to make guests feel welcome in the village and feel comfortable here. We don't want anyone to risk the life and end up going to the dark side of Pony Driland.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "So please make yourself at home. We just want to do this for your own good.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny answered Vinny and offered Vinny to enter too. He proved to be positive in what he was doing. He wanted Vinny to feel good. He just waited for Vinny to enter the house.",
        "type": "action"
    },

    {
        "value": "Okay okay... I understand, so excuse me, what a beautiful house! *-*",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Make yourself at home!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny smiled and rubbed he head at Raquel face. Raquel looks at Kenny for a few seconds before smile, so Raquel rubbed her face back while the two enter the house.",
        "type": "action"
    },

    {
        "type": "think",
        "character": "Vinny",
        "value": "Hahaha... I think I get it. they are a couple. it is cute."
    },

    {
        "value": "Vinny soon saw that it was a house mixed with a medieval style with the technological things of a modern house. Vinny saw a beautiful room rich in furniture, Vinny just missed some things that are normally used for communication like television and telephone. And just ahead Vinny could see the table where Raquel was preparing breakfast with pancakes. So Vinny waits for kenny to say something, waiting at the entrance, making Kenny look at Vinny.",
        "type": "action"
    },

    {
        "value": "Oh? Vinny? You may come in! Remember you are welcome here!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny invited Vinny to enter again as Kenny went with Raquel towards the breakfast table.",
        "type": "action"
    },

    {
        "value": "Oh? Okay. Thank you again for everything.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little more surprised to be invited in. Vinny heading towards an empty chair at the table.",
        "type": "action"
    },

    {
        "value": "Did you talk about me meeting someone to know the right place? who was it?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Oh? James? Yep! James... He's a great adventurer who understands a lot about everything.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "James? Are you sure Kenny? He's kind of grumpy with new people. He always says he wants to do things all by himself. And Vinny just arrived in our world. This is extremely dangerous for him.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel does a sad face, saying a little worried when she starts to think about the negative possibilities that could happen.",
        "type": "action"
    },

    {
        "value": "But... but Raquel. I'm sure James really needs an adventure partner. I get really worried if something happens to him along the way and there's no one to help him. He is very lucky that he is still alive.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied sadly back. Vinny was worried trying to understand what was going on while watching the conversation.",
        "type": "action"
    },

    {
        "value": "Oh really? Where did I end up accidentally getting myself into?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "If Vinny is a good adventurer, I'm sure they can do well!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Cool.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny eats pancakes while doing a poker face in answering this.",
        "type": "action"
    },

    {
        "value": "Okay! The pancakes are great!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "C..Cool?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel get confused when she hears Vinny reaction.",
        "type": "action"
    },

    {
        "value": "Yep....That's nice! It will be really fun! Vinny will enjoy a good adventure!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny does a silly laugh.",
        "type": "action"
    },

    {
        "value": "Yes... I said cool in the sense of finding it a bit cool when kenny said \"He's very lucky he's still alive\" I thought it was a little cool and weird, but nothing that scared me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny continue eating pancake while doing a nervous giggles.",
        "type": "action"
    },

    {
        "value": "Kenny... Are you sure?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Weeeeeeeeeell...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny laughed nervously as he thought about the consequences.",
        "type": "action"
    },

    {
        "value": "if Vinny likes a good adventure.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny continue speaking awkwardly while continuing to eat breakfast.",
        "type": "action"
    },

    {
        "value": "Kenny... Please no. Don't be like that, James will be fine, maybe we'd better help him to have a life in the village.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel talks about a way to make Kenny calm down. Raquel was worried about Kenny's reaction to trying to help James. Meanwhile, Vinny was watching the conversation and was slightly worried about Kenny. But he is slowly trusting more as he sees Raquel talking to Kenny, and notes that they are just normal villagers.",
        "type": "action"
    },

    {
        "value": "Well, I'm new here, so I don't see why not meet new things and new ponies too, of course if it's not too much trouble.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to remain calm and only responded with a slight nervousness. Kenny would then start trying to be more positive, trying to get some hope.",
        "type": "action"
    },

    {
        "value": "But but... You have a cell phone that does amazing things like you said.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "M..Mobile?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel reply, getting a little confused and surprised while holding a piece of the breakfast she is eating. Vinny was curious and a little surprised before answering.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Oh really? Don't you have anything that looks like a cell phone? Cell phones are very common where I came from, they are very common everyone has them, we use them to communicate with other people, watch BoboFlix, play games, send nudity to people, basically it was a very well done work.",
        "value_alternative": "Oh really? Don't you have anything that looks like a cell phone? Cell phones are very common where I came from, they are very common everyone has them, we use them to communicate with other people, watch BoboFlix, play games, basically it was a very well done work.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "C..communicate? Amazing! Communication is rare in Pony Driland! BoboFlix? My God! That name... is this some specialist agency?!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny's eyes dilated a little as he got excited about the cell phone.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Wait.... Nudes? WHAT?!",
        "value_alternative": "W...what?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel was very confused when trying to understand what is happening.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Yes, nudes. A way for you to pay the people you work for.",
        "value_alternative": "Yes. This is the phone. Something wrong about it?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "Vinny was a little embarrassed and thoughtful when thinking how to say about nudes without being explicit.",
        "value_alternative": "Vinny tried to understand Raquel's reaction during some seconds.",
        "type": "action"
    },

    {
        "value": "Well... Yes Kenny, you can do everything inside the phone, it's amazing, but unfortunately it's limited in terms of functioning where it only stays on until the battery or batteries run out.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "......",
        "value_alternative": "Okay? Maybe i understood.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "Raquel is still embarrassed, trying to understand what Vinny was talking about.",
        "value_alternative": "Raquel didn't know what to say and just continued watching the conversation.",
        "type": "action"
    },

    {
        "value": "Wait... run out of battery? And how do you recharge that battery? Did you bring anything to do this?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny remains excited, wanting to understand more about the mysterious cell phone.",
        "type": "action"
    },
    {
        "value": "Wait... I didn't bring the charger! SHIT!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Okay okay... Unfortunately I don't have the charger, because I wasn't with me on the beach and I don't have faith that it's here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very uncomfortable and very nervous trying to think about what to do if the cell phone just ran out of battery. He was very worried. So Vinny looked at Raquel and saw her reaction again, so he decided to ask.",
        "type": "action"
    },

    {
        "value": "Ah? Are you ok Raquel?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny speak calmly and surprised.",
        "type": "action"
    },

    {
        "value": "No...nothing...nothing. I hope I got it wrong. The breakfast was great, I'll take care of my gardening now. I will be right back.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel makes a disguised smile of shocked reaction, and moves towards the door that leads to the garden of the house.",
        "type": "action"
    },

    {
        "value": "Raquel? Where are you going? Wait! Oh okay, too late.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kelly was looking a little confused as Raquel closes the door.",
        "type": "action"
    },

    {
        "value": "Well Vinny, sorry I didn't see anything on the sand when I found you. But maybe James can help you with that. I don't know anything about technology, only James knows better about it.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny makes a slight smile, trying to show a feeling of apology for what happened.",
        "type": "action"
    },

    {
        "value": "Yeah, I'm going to save the remaining energy for something very useful. Don't worry, I forgive you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny sighs deeply.",
        "type": "action"
    },

    {
        "value": "Well... Kenny, can I help you with something? What do you do on the morning? Can I help you with something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Thank you... I'm going to the market to shop soon. If you want to accompany me, it would be a great help.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny giggles a little, trying to forget a little about the negative side of the previous conversation.",
        "type": "action"
    },

    {
        "value": "Ah, wow, yes yes, we can walk and you will instruct me more about walking on 4 and even trying to use the wings if possible of course.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "No problem! It's going to be fun and fun and a lot of fun! Every step is progress!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny speaks confidently.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe this is all a dream, maybe I hit my head while trying to eat my X-Tudo. Let's take it easy, the exit from this place shouldn't be too far. There must be someone superior who can send me home.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "And about the wings, well... Raquel and I are earth ponies, we don't know how to fly, you'll have to find another pegasus to learn how to use them.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied with a nervous smile trying to find an answer for you.",
        "type": "action"
    },

    {
        "value": "Ah, okay okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "ARGH! Fall for the obvious. Nice.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "What time are we going to the market?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": null },
        "value": "Now! I've already finished my breakfast schedule.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied while finishing the rest of the food on his plate before leaving a small friendly giggles about Vinny answer.",
        "type": "action"
    },

    {
        "value": "Ok ok ok, if possible I can accompany you and we can talk on the way ok?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Fine!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied happily as he got up from the chair and put the bag saddle on he body. Then Kenny and Vinny started walking towards the market.",
        "type": "action"
    },

    {
        "value": "a saddle? Is that like a backpack? Interesting...",
        "character": "Vinny",
        "type": "think"
    },

    {
        "set": { "playlistPlay": "think" },
        "value": "Vinny watched Kenny use the saddle for a few seconds as he followed Kenny. Then the two ponies started walking through the village. Vinny and Kenny were walking through the village towards the market, passing several and several ponies and houses, the village was very busy with several ponies living life, adults and children living their routine, and children playing happily on the street. Then Kenny would look at Vinny and ask kindly.",
        "type": "action"
    },

    {
        "value": "Well. What would you like to talk about?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Where do you and Raquel know each other from? very nice of you 2 to welcome me after I suddenly show up on the beach. In my world people aren't that kind.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was a little surprised and responded.",
        "type": "action"
    },

    {
        "value": "That's true? Is your species going extinct? This looks terrible.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "No, these are stupid things to be honest. Oh many nations in wars, deadly viruses and deadly diseases spread around the world, but I had a normal life. I woke up every day, I ate, I did my housework since I didn't have a job and I slept in peace, but it was a little life bad for people, people were very selfish and only thought about them, so it was a little bad. but I could live without any problems. But well, sorry to interrupt you, but you can continue.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Nations at war? virus? Were you in the middle of an apocalypse? That's terrible. Well, I forgive you, maybe one day everyone will understand better about this. Well then...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny speak a little scared for a seconds. So Kenny got a little emotional remembering this information, but then he responded.",
        "type": "action"
    },

    {
        "value": "Well... We met on the exact same beach you showed up on. We had a pure coincidence that we were teleported here at the same time, but we are from different dimensions. By instinct we decided to stay together to try to protect ourselves, and that ended up creating our friendship.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny grew slightly more worried as the conversation continued.",
        "type": "action"
    },

    {
        "value": "And who helped us start our life here was James, we met him in the middle of the forest when we were trying to discover how to survive in this place. It's a long story, I'd found him in need of help, he'd been attacked by Elite Color. So as a thank you, he helped us build a house and a new life around here.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny gave a nervous little laugh when he remembered more thing.",
        "type": "action"
    },

    {
        "value": "About your past... It reminds me a little the James's past... When he told me a little bit of his story, he said something similar.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "What?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and worried to hear this.",
        "type": "action"
    },

    {
        "value": "Jeez, how long has he been here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I don't know for sure... but from the stories of the journeys he's taken... It seems like a long time ago. He has a lot of experience in what he does.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Okay... This doesn't look good. It's nothing good. Will I be stuck in this place forever?!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Interesting, it seems that he only has you as an friend.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny laughed a little nervously.",
        "type": "action"
    },

    {
        "value": "James is kind of anti-social. A little...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Oh, I see. Well, sorry to interrupt the conversation, but we will arrive the market?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Market? We are.....AAH!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny bumps onto the door of the market shop by accident.",
        "type": "action"
    },

    {
        "value": "Y..Yes....we arrived. @.@",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Jeez, it looks like someone still doesn't know how to walk on all fours well yet.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny speak ironically but friendly. So Vinny help Kenny.",
        "type": "action"
    },

    {
        "value": "Thank you. Don't worry. I am fine.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny moved to get up slowly while the market door swung for a few seconds because of the impact, and some ponies from the market looked a little surprised at the scene.",
        "type": "action"
    },

    {
        "value": "Kenny? Are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Me? I'm great.. I've never been better... It was just a light tap on the door.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": null },
        "value": "Kenny put his paw on his head to try to get as dizzy as possible. When everyone noticed that Vinny was fine, everyone went back to the routine.",
        "type": "action"
    },

    {
        "value": "Okay. So, you came to buy what here at the market?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny smiled and answered.",
        "type": "action"
    },

    {
        "value": "Well, I came to buy food, but if you want, you can buy some important things for your daily life. Feel free. I can help you pay for things.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Vinny starts to hear someone giggles around, making Vinny looks towards the giggle. Vinny laughed a little back.",
        "type": "action"
    },

    {
        "value": "Ah? I think someone laughed about it, I think as I came from another world, there are 2 details, even if I had some money here, I think my kind of money wouldn't be used here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": "bad-think" },
        "value": "So Vinny looked at a female unicorn doing a suspicious face while laughing at Vinny.",
        "type": "action"
    },

    {
        "value": "Ah? Another dimension? Interesting to know. I think we have a newbie here.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious unicorn was giggling again at Vinny and approached slowly to analyze him.",
        "type": "action"
    },

    {
        "value": "Yeah yeah... if your world's money is just a sheet of paper like I've seen a few times... forget it. Wait, this voice? Oh no.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny looked a little surprised from the voice.",
        "type": "action"
    },

    {
        "value": "Ah...Hi.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny turns to Kenny for a few seconds. Then he turned to look at the mysterious unicorn.",
        "type": "action"
    },

    {
        "value": "Oh? You're rude...",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The unicorn giggles again and uses her magic, changing direction of Vinny face for Vinny to look at her. Vinny saw her wearing a cape to protect her identity a bit.",
        "type": "action"
    },

    {
        "value": "Won't you even let me introduce myself? You are very impolite.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The unicorn approaches you while giggling more suspiciously.",
        "type": "action"
    },

    {
        "value": "W...wait! What are you doing?!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "The unicorn uses the magic to silence Kenny. Kenny was a little scared by the unicorn's attitude. Everyone looked at the situation, but when everyone  realized who was there, everyone started to walk away, with slight fear, they went back to the normal routine.",
        "type": "action"
    },

    {
        "value": "Shhh... Everyone noticed and you should notice too. I'm talking to him~",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Hmm! HHHM HM!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny try to open his mouth for a few seconds. Vinny was a little surprised, but then Vinny tried to have a little attitude.",
        "type": "action"
    },

    {
        "value": "Hey, I think you can stop your magic, I know how to listen you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious unicorn then laughed a little again and responded.",
        "type": "action"
    },

    {
        "value": "Aww... Really know? Do you know how to defend yourself too~?",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "What a beautiful first day. Crazy females showing up now.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Her magic continued and a sword appeared being levitated by her that moves next to Vinny mane while her hood comes off, revealing the rest of her face.",
        "type": "action"
    },

    {
        "value": "HHM HMM! AH! Noo! Please! Calm down!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny continue trying to move towards Vinny while some ponies looked scared at the time.",
        "type": "action"
    },

    {
        "value": "Hehehe... Don't be afraid, I won't hurt you. Everyone here in the village knows me very well, and everyone knows when I come to visit here, it's because I come to have \"fun\"~",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Kenny fought the magic again until he could finally speak. So he spoke out loud.",
        "type": "action"
    },

    {
        "value": "Enough of the jokes Rayane! What are you doing here?!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Meet the newbies... you know this is my role here. Can you please let me continue what I started~?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wow! Are you ok Kenny? Who is this charming girl with a broadsword?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny speaking a little dumbfounded and not understanding.",
        "type": "action"
    },

    {
        "value": "She's...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Rayane's magic shuts Kenny up again while Rayane made a little teasing laugh.",
        "type": "action"
    },

    {
        "value": "HHM!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Yes, me. I like to discover secrets, and one of the most fun secrets is knowing who the new beginners are~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane slowly approached Vinny as she said this, without intimidating him too much.",
        "type": "action"
    },

    {
        "value": "Interesting.... it looks like it's your first day here, you haven't even decided where to start yet... if I were you, I'd be very careful where have you been. Heh, The new one is the easiest prey and the first to die around here~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane spoke in a delicate and provocative voice as she walked around Vinny and rubbed her tail on Vinny face, doing a small act of intimidation on Vinny.",
        "type": "action"
    },

    {
        "value": "W...what? What exactly do you do, charming Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny speak somewhat ironically while trying to resist the provocations. So the sword that was floating and suddenly stuck on the ground 2 centimeters from Vinny face.",
        "type": "action"
    },

    {
        "value": "O..OH! WOW!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hehehe... Do you really want to know? It will take more than a simple question to know that~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane! Please do not! We just came to shop! Don't let newbies traumatized again!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Rayane spoke in a delicate and provocative voice as she walked around Vinny and rubbed her tail on Vinny face, doing a small act of intimidation on Vinny.",
        "type": "action"
    },

    {
        "value": "So Vinny tried to keep calm and started to speak in a rhetorical way.",
        "type": "action"
    },

    {
        "value": "Well, I think I have things that interest you, by the way, you came to me, if you do something with me, you probably won't get answers. so I think we can help each other don't you think?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Interest? Heh~ I would say not for now... If you don't do anything silly on Pony Driland, you can be sure nothing will happen to you.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane approached Vinny well and stared into the Vinny eyes to draw Vinny attention fixedly.",
        "type": "action"
    },

    {
        "value": "Just stay very quiet where you came from and I can spare you any unpleasant encounters about my presence. Hehehe... And unfortunately I'm not open for help, me and my sword already know very well who I'm working with.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Rayane walked away from Vinny slowly. Vinny laughed a little nervously and just answered.",
        "type": "action"
    },

    {
        "set": { "playlistPlay": null },
        "value": "OK then. Okay okay...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The sword that was on her side suddenly flew, scraping another little part of Vinny mane in surprise.",
        "type": "action"
    },

    {
        "value": "Ham? Okay?~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked at Vinny face again.",
        "type": "action"
    },

    {
        "value": "Be careful to listen to my words. I'll be watching you when I feel your presence.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane put the sword away again and walked through the village again, and so Kenny starts to feel better slowly.",
        "type": "action"
    },

    {
        "set": { "playlistPlay": "think" },
        "value": "At least she was lighter I think.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny laughed a little nervously. While Rayane was walking, everyone scared was making space for her to pass until she left completely.",
        "type": "action"
    },

    {
        "value": "Kenny? Are you ok?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I...I'm fine...NEVER BEEN BETTER! SHE SHUT ME UP!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny breaths firmly as he calms down. He was very anxious and worried about the situation.",
        "type": "action"
    },

    {
        "value": "Okay, sorry. But... Who is she?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny asked very curiously while helping Kenny to compose himself.",
        "type": "action"
    },

    {
        "value": "Thank you. Nobody really knows about her... They say she's been found in the forests of Pony Driland doing something mysterious. Some say she hunts treasures or seeks to solve mysteries. She's kind of confused sometimes she is threatening, and other times she tries to help. We have no proof of who she really is. We should forget about that a little bit. She is very troublesome.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny talk a little without hope of knowing what exactly she is.",
        "type": "action"
    },

    {
        "value": "Kenny?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny talks a little lost about the situation.",
        "type": "action"
    },

    {
        "value": "I...I...oh? What?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "I think I played on Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Talking half looking all around.",
        "type": "action"
    },

    {
        "value": "WHAT?! Have you gone crazy?! She'll do you disappear at her first opportunity!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny feel very surprised by Vinny words.",
        "type": "action"
    },

    {
        "value": "I have a certain problem with this kind of people.... ponies. Yes, ponies. But are we going to go back to what we were doing originally? You still want help shopping?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was very confused by the words he heard, so he responded.",
        "type": "action"
    },

    {
        "value": "Person? Pony Person? What is it? Oh yes. I almost forgot about shopping, let's go to the market then.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny spoke with a clumsy face as he finished calming down.",
        "type": "action"
    },

    {
        "value": "Nice. Very nice. I'll have to adapt my vocabulary too.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "I was talking about people, but here I'm going to start talking about ponies, it sounds nicer.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny talk a little worried about Kenny.",
        "type": "action"
    },

    {
        "value": "You said not to traumatize the newbies \"again\" I don't understand, have you seen this happen?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Okay... I think I get it. But please avoid contacting her. Some ponies she knew have already mysteriously disappeared. None of us know what happened.I already asked her what happened, and she always says she doesn't know what happened. This is your warn, please, avoid her. Just talk to her if you know what you're doing. She is very mysterious. I don't know what to say. I'm not saying she's bad, but I can't say for sure if she's good either.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "set": {
            "dayNightCycle": "morning"
        },
        "value": "Kenny feel worried again while replying Vinny, trying to calm down in. Vinny laughed a little nervously, seemed to think it was all Kenny's paranoia. So he tries to respond in a calmer way.",
        "type": "action"
    },

    {
        "set": {
            "dayNightCycle": "evening"
        },
        "value": "Oh okay okay, let's go shopping? Or do you need a little more time to compose yourself?",
        "character": "Vinny",
        "type": "dialogue"
    },


    {
        "value": "Shopping? Oh yes! Shopping! Shopping time! We can't be late! My God! It's almost evening! There's the first reason! Rayane made us late!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny talks desperately when he looks at the clock and enters the market. Vinny felt better seeing Kenny worry less about problems.",
        "type": "action"
    },

    {
        "value": "Let's go.",
        "character": "Vinny",
        "type": "dialogue"
    },
    {
        "value": "Vinny follows Kenny.",
        "type": "action"
    },
    {
        "value": "Are grocery stores of your dimension is divided by sessions?",
        "character": "Kenny",
        "type": "dialogue"
    },
    {
        "set": { "playlistPlay": null },
        "value": "Vinny was a little surprised and responded.",
        "type": "action"
    },

    {
        "value": "Yes, some are giants and are divided by rows of huge streets, there's not much difference between my little world and this one.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Cool! it will be easy then! Follow the signs and they will guide you! I'll go see the food section! We meet at the cashier!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny smiled happily and was already moving towards the food session.",
        "type": "action"
    },

    {
        "value": "Oh ok. Hey! I'll take a little walk and if I find something I'll let you know, we'll meet at the cashier or somewhere! He was really excited.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": "silly" },
        "value": "So Vinny analyzed the situation and became very thoughtful.",
        "type": "action"
    },

    {
        "set": {
            "item": [{
                "id": "surprise-tin",
                "owner": "vinny",
                "amount": 1
            }]
        },
        "value": "Vinny looked at each object so he started to think about what he could buy. So he was surprised to see a product called \"surprise tin\".",
        "type": "action"
    },

    {
        "value": "Really? I hope some good thing  comes out of this shit.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So a random pony looked at Vinny talking alone and what you were holding, and he walked away very quickly.",
        "type": "action"
    },

    {
        "value": "Ah? Hey! Sorry! Fineeee... Let it go then.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "basic-wound-spray",
                "owner": "vinny",
                "amount": 1
            }]
        },
        "value": "Vinny then continued his shopping adventure and he was analyzing other products, so he get 1 basic wound spray. He visited the sensation of products related to wings, but he was disappointed with the price of the products, he saw that everything was too expensive, so he just left.",
        "type": "action"
    },

    {
        "value": "Oh? Oh yes! Beer! I liked it! Good! Very good!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "beer",
                "owner": "vinny",
                "amount": 2
            }]
        },
        "value": "Vinny get 2 beers. So Vinny started to feel more satisfied as he added more items to the saddle. He kept walking into the drinking session until he saw the energy drink session.",
        "type": "action"
    },

    {
        "value": "Energy drink? Oh! Now I'm feeling at home.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "energy-drink",
                "owner": "vinny",
                "amount": 1
            }, {
                "id": "water",
                "owner": "vinny",
                "amount": 5
            }]
        },
        "value": "Vinny get 1 Energy Drink and take 5 waters. So more and more time was spent, looking at everything that was in the market, after a while, Vinny found a display case with a sword.",
        "type": "action"
    },


    {
        "value": "Good afternoon sir! Are you interested in this wonderful sword that is being raffled off in our daily market?! Special artifacts for ponies who like to have special defense!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "Vinny then was very surprised and soon watched the employee, then the sword, then the employee again, and responded with slight anxiety.",
        "type": "action"
    },

    {
        "value": "What? Good afternoon, yes I'm interested.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Employee then said with a very happy and inviting effect voice to have Vinny's full attention with the fun moment.",
        "type": "action"
    },

    {
        "value": "So with only 3 coins, you will be able to spin our lucky roulette! Would you like to know how it works?",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "Yes! I want to know and participate.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Okay! All you need is to take a number from 90 to 100 between values of 100 numbers!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very happy and excited to try the roulette, so he responded very happy, waiting for the right moment to return to the roulette.",
        "type": "action"
    },

    {
        "value": "Oh, fine! I'll go there and then I'll come back.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "basic-wound-spray",
                "owner": "vinny",
                "amount": 1
            }]
        },
        "value": "Vinny then continued walking through the hallways, analyzing more and more items, then he just got 1 more basic spray. So after that, Vinny decided to go see if Kenny was okay. Kenny was angry, walking towards the checkout line.",
        "type": "action"
    },

    {
        "value": "WOW KENNY! Are you ok bro? What happened?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny responded disgusted and disappointed with himself.",
        "type": "action"
    },

    {
        "value": "THE SWORD! I WANTED THE SWORD!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "My god? How many times did you play?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny responds in a sad voice.",
        "type": "action"
    },

    {
        "value": "15 times.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "This doesn't sound like a good idea, but let's at least try. heh.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Jeez, I can try 1 time, what do you think? Sometimes i'm lucky.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I don't even want to see. Good luck to you.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny responds in a sad voice. Kenny responds worried and sad, but he was just trying to have a little hope.",
        "type": "action"
    },

    {
        "value": "Good! Time to win or lose! Now it seems like a good opportunity.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny prepared his determination and headed towards the employee again. The employee looked and recognized Vinny. So he already started the cheerful personality to convince Vinny to try.",
        "type": "action"
    },

    {
        "value": "Wow! More customers wanting our wonderful sword!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "Yes I'm back, I'll try 1 time.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "How wonderful! Time to spin the dice! Wheel wheel wheel! Look at the happy spinning dice!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "Employee prepare to roll the dice. Vinny laughed a little and then answered.",
        "type": "action"
    },

    {
        "value": "Kenny heard that the 2nd time is the right one?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "...already. e__e",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "It's now bro, my last attempt, then we're leaving with a sword, TRUST!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was doing a poker face, with big theories that this isn't going to end well.",
        "type": "action"
    },

    {
        "value": "Oh my rainbow.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Send me THE BIG DICE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "YEA! Time for BIG DICE!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "The dice went round and round and round on the table. But the dice lands on number 2. Vinny was completely disappointed and responded with a bit of anger.",
        "type": "action"
    },

    {
        "value": "I really didn't want this sword. Let's go.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny just summed up the sadness and started crying.",
        "type": "action"
    },

    {
        "value": "Aaaaaaaaaahhhh!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "O god. Why did you want that sword?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny would get a little embarrassed and then respond.",
        "type": "action"
    },

    {
        "value": "I wanted a sword to hang on my painting on the living room wall. It would look nice on the basement side.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Fine... I took some necessary things, but among them I took an energy drink, I saw that you really wanted the sword, so I'm willing to leave this energy drink and give you 2 more chances to get the sword.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..what? Are you serious?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny made a curious face, wanting to understand what you're talking about.",
        "type": "action"
    },

    {
        "value": "I'm going to return this energy drink and the less money will give us 2 more chances to get that sword for you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Are you sure? I wish you good luck.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny would get a little more worried. Vinny would then smile and just indicate that he was determined to try again.",
        "type": "action"
    },

    {
        "value": "Vinny would then smile and just indicate that he was determined to try again.",
        "type": "action"
    },

    {
        "value": "Okay! IT'S TIME FOR BIG DICE AGAIN!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "BIG DICE! BIG DICE! DIIIIIIICE!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "value": "You are really a clown! Let's play 2 more.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yeah! It's for now!",
        "character": "Employee",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "beer",
                "owner": "vinny",
                "amount": -2
            }, {
                "id": "energy-drink",
                "owner": "vinny",
                "amount": -1
            }, {
                "id": "water",
                "owner": "vinny",
                "amount": -5
            }]
        },
        "value": "Kenny was crying, just watching the scene trying to have some hope of some good result. Vinny then tried the first, second, third, several other attempts with all failures. Vinny lost the beers, the energy drinks. Vinny was getting very angry with the situation, losing his temper more and more.",
        "type": "action"
    },

    {
        "value": "Enough! It seems that our world is controlled by a sadistic person who is too pissed off to do this bad luck with us.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny wasrolling on the floor and crying. Again. So Vinny holds Kenny and helps him to compose himself. Then Vinny responds sadly.",
        "type": "action"
    },

    {
        "value": "I'm sorry.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was beginning to regret the lost money more and more.",
        "type": "action"
    },

    {
        "value": "Please, cashier now.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Ok ok, let's go.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The two then walked towards the cashier. The two were disappointed by the end result, going towards the cashier.",
        "type": "action"
    },

    {
        "value": "Good afternoon! What can I help? Oh? What sad faces are these?",
        "character": "Cashier",
        "type": "dialogue"
    },

    {
        "value": "The female unicorn looked at Kenny and Vinny, a little worried by their sad expressions.",
        "type": "action"
    },

    {
        "value": "Aaaaah!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to ignore Kenny's reaction and just responded.",
        "type": "action"
    },

    {
        "value": "We had a mishap with the sword.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Lucky Dices? Oh no. Sorry for what happened. Everything can get a second chance sometime. But be more careful.",
        "character": "Cashier",
        "type": "dialogue"
    },

    {
        "value": "The cashier tried to respond kindly while laughing a little nervously. Vinny looked at the cashier, after looked at Kenny, watched him crying, then tries to do Kenny feel better.",
        "type": "action"
    },

    {
        "value": "Ok ok. Next time you take it. Come on Kenny. It's just a silly sword.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was trying to be a little positive as he responded. But he was still disappointed.",
        "type": "action"
    },

    {
        "value": "Ok. I will trust the fate of the lucky dices.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Don't trust, but you will win, trust yourself!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "On myself? You're right! I need to trust myself more!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny reply with determination.",
        "type": "action"
    },

    {
        "value": "That!!! Now let's go through your things with determination at the cashier because it's already late!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes! This is the time!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny put his wallet on the cashier's desk, feeling determination during the payment. The cashier made a little nervous smile trying to understand what was happening. But then she answered.",
        "type": "action"
    },

    {
        "value": "I see you're happy again.",
        "character": "Cashier",
        "type": "dialogue"
    },

    {
        "value": "Are you going to move my things separately?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yeah! All together. Do not worry.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny spoke happily while preparing the purchases.",
        "type": "action"
    },

    {
        "value": "Okay. Feel free.",
        "character": "Cashier",
        "type": "dialogue"
    },

    {
        "value": "Yay! Here we go!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny uses the cashier sensor.",
        "type": "action"
    },

    {
        "value": "Heh! Alright.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The purchase price was then 151 coins. Kenny was just disappointed, but then he paid the full amount. Vinny was surprised and scared by the price.",
        "type": "action"
    },

    {
        "value": "Wow. Your wife won't fight, right? For the expense of trying to get the sword?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Ah... I... I'll manage.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny said laughing nervously as he paid the cashier.",
        "type": "action"
    },

    {
        "value": "Thank you very much! Have a nice day sir!",
        "character": "Cashier",
        "type": "dialogue"
    },

    {
        "value": "Kenny said laughing nervously as he paid the cashier. Vinny laugh a little as he looked at Kenny, trying to keep him happy.",
        "type": "action"
    },

    {
        "set": { "playlistPlay": null },
        "value": "You're welcome. Well, let's go, I'll help load the stuff.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Okay. Thank you.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny tried to be positive when he saw Vinny's reaction, so the two prepared to go home. Vinny then smiled and said.",
        "type": "action"
    },

    {
        "value": "You can go ahead, I'll follow.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "All right.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": "think" },
        "value": "Kenny keep happy and leave the market. it looked like not much had changed. But Vinny seems to have seen some smoke coming out of the middle of the forest that was close to the village.",
        "type": "action"
    },

    {
        "value": "Hey! Smoke? What's happening this time?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to point to the forest curiously. Kenny would be a little scared, but then he would respond calmly.",
        "type": "action"
    },

    {
        "value": "Smoke? Ah. I have no idea... It could be some campsite. It could also have been some confusion that resulted in a fight. I don't want to go there.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "vinny laughs a little nervously before answering.",
        "type": "action"
    },

    {
        "value": "Well... I don't want to go there either.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yeah. You have to be careful. If you find any Elite Color operation, it will be a big problem for you. ",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny said a little nervous when he started to think about the things that must be happening there. Vinny was surprised, but soon responded.",
        "type": "action"
    },

    {
        "value": "Wait... The Elite Color always come here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny then responded a little more worriedly than usual.",
        "type": "action"
    },

    {
        "value": "I'm not sure. They always operate discreetly in peaceful places. It is said that they sometimes watch Pony Driland's newbies for something that interests them. It was things James said to me in the past. Yes, this is motive I am so worried about James. I'm afraid of him being captured by Elite Color.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Okay, I see, and where is James?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny was surprised by the answer, so Kenny was very happy to hear it. But Kenny was still worried, trying to have hope for James. Kenny tried to calm himself. ",
        "type": "action"
    },

    {
        "value": "James said he was going to arrive by the deadline that ends today to get some rest from his adventure. James could be anywhere. I hope he's okay. He always makes me worried about traveling alone.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Hmmm. Ok Ok.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny kept seeing the mysterious smoke that slowly got weaker, it seemed to be something that happened some time ago. Vinny saw a little bit of Rayane watching he. She was sitting next to a grocery store, and she was doing a teasing look like \"Yes, I've got my eye on you\".",
        "type": "action"
    },

    {
        "value": "Oh? Did something happen? Hello?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Nothing.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane while walking forward, trying to understand the reason for the Rayane action.",
        "type": "action"
    },

    {
        "value": "V..Vinny?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Nothing, I thought I saw Rayane looking at our ass.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny speaks with irony more speaking playfully. Kenny was getting a little nervous and worried again.",
        "type": "action"
    },

    {
        "value": "R..Rayane? What does she want from you?! I don't want to participate in another sword game of hers. She likes to be silly when she's swinging her sword.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "And... I need to learn how to use these wings... can't I learn by myself?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "But but... Rayane. Okay, well. You'll just have to accept that you're going to fall flat on your face sometimes.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny made a slight nervous smile while replying Vinny.",
        "type": "action"
    },

    {
        "value": "Well, I think if I'm going to stay with you for a while or a few hours, I think in the meantime at least I can learn to move them, right?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny is confused to hear these questions being directed at him.",
        "type": "action"
    },

    {
        "value": "I don't know anything about wings. I have no idea how to do that.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": null },
        "value": "So during the conversation, the two finally arrive at Kenny's house again.",
        "type": "action"
    },

    {
        "value": "Bro! You pull my wing there, where I feel pain, and where I have to move the wing stuff, but first let's unload the groceries.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kenny get a little confused and a little embarrassed.",
        "type": "action"
    },

    {
        "value": "I pull wings? What are you talking about?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Like this...",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny feel something pulling the wings very lightly.",
        "type": "action"
    },

    {
        "value": "WHAT? What the fuck is that?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was completely scared and surprised.",
        "type": "action"
    },

    {
        "value": "Pika boo~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane pulled Vinny wings again, using levitation magic.",
        "type": "action"
    },

    {
        "value": "AAAH! CRAZY SWORD GIRL AGAIN!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny runs desperately into the house with the groceries.",
        "type": "action"
    },

    {
        "value": "When Vinny realized it was just Rayane, he just got confused and asked.",
        "type": "action"
    },

    {
        "value": "What? You again? Hi... Are you ok?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane made a slight malicious laugh and replied.",
        "type": "action"
    },

    {
        "value": "I'm great. So someone is trying to wiggle the wings~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane made a silly provocative grin face.",
        "type": "action"
    }

]