[

    {
        "set": {
            "where": "Planet Earth",
            "dayNightCycle": "morning",
            "day": 1,
            "weather": "sun",
            "playlistPlay": null
        },
        "type": "action",
        "value": "It was just another normal day on Planet Earth. It was a beautiful normal day like any other, Vini was living his normal life, he still hadn't showered, and he was talking to his friend Yasmin through Discord. It was a simple super decisive conversation for her to finally pay the X-Tudo Vini wanted so much. Vini was very happy, as he had been waiting for this day for several months, so this was the decisive magic moment. Everything was extremely quiet. It was just a silly Discord conversation like any other day."
    },

    {
        "set": { "playlistPlay": "happyness" },
        "type": "action",
        "value": "Yasmin then looked at the monitor impatiently, and just wanted to get this story over with, so he wouldn't need to talk about X-Tudo anymore."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "ah! Ready! I finally got my credit card working! I'm going to buy your X-Tudo now! Now it's time to stop this silly nonsense time!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Yes! Yeees Yasmin!!!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "You've messed up the entire online casino! Don't think this will happen again!"
    },

    {
        "type": "action",
        "value": "Yasmin would then sigh deeply and slowly calm down when she realized that everything was finally solved. She was very thoughtful observing the whole situation before confirming the order"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Uff... Okay. I sent your order just the way you asked. The delivery man of food app is already on his way to your house. I recommend you keep an eye on the GPS, or the delivery boy will pass right by."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Wow, my address isn't right? Motoca is going to screw up my X-Tudo!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Ah Vini! Nope nope! You sent the address! You're going to receive your X-Tudo!"
    },

    {
        "type": "action",
        "value": "Right now Vini's phone started beeping Food App Notifications."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Oh yes, man!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Heh! Let me see my phone beeped here."
    },

    {
        "type": "action",
        "value": "Vini anxiously raises his hand and takes the phone, after unlocking it with his finger he looks at the notifications"
    },

    {
        "type": "action",
        "value": "Vini saw the notification that the delivery boy was about to arrive, his cell phone already asking him to go to the door of his house to wait for the delivery boy"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "so? He is coming?"
    },

    {
        "type": "action",
        "value": "Yasmin spoke giving a silly little laugh."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "I want you to take the phone with you, I left a reminder in App Food about a little surprise for you when the order arrives."
    },

    {
        "type": "action",
        "value": "Surprised Vini speaks in a curious way."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "What the hell? What would that be?"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Okay, let me enter the call on my cell, HOLD IT!!!!!!!!!!"
    },

    {
        "type": "action",
        "value": "Yasmin laughs harder before answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Siily Vini... Relax. You'll find out. Please, just don't screw it all up. Mainly the phone!"
    },

    {
        "type": "action",
        "value": "Meanwhile, Vini began to hear the noise of the motorcycle."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Okay okay! Let me go see the gate. YES!"
    },

    {
        "type": "action",
        "value": "Vini then got up from his computer. He was home alone. He then went to the gate to open it to receive the food. Meanwhile Yasmin kept laughing and answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Don't worry, the surprise will be all good like your X-Tudo."
    },

    {
        "type": "action",
        "value": "Vini then met with the delivery boy, already looking a bit confused about what Yasmin was talking about."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Hello, good afternoon sir, are you Vinicius?"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Look there! Go mess up the delivery boy again!"
    },

    {
        "type": "action",
        "value": "Yasmin reply with a silly giggle."
    },

    {
        "type": "action",
        "value": "Vini was wanting to speed up and get back to his room soon before the delivery boy could hear Yasmin laughing"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Oops good afternoon, it's me yes, is it the snack?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Oops... Yes, your lunch... An X-Tudo. Everything and a little more."
    },

    {
        "type": "action",
        "value": "Delivery Boy tried to react naturally when he noticed a kind of anxiety in Vini."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "This burger was vibrating inside my motocycle, so please, if there's something wrong with your lunch, let me know that we'll exchange your lunch for a new one."
    },

    {
        "type": "action",
        "value": "Delivery Boy delivered the X-Tudo box kindly to you."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "The burger has arrived! Finally arrived!"
    },

    {
        "type": "action",
        "value": "Yasmin continued the silly giggles, happy to see Vini's reaction."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "it's a joke, right? prank right? What is this vibration?"
    },

    {
        "type": "action",
        "value": "Vini reply with a surprised face and mischievousness."
    },

    {
        "type": "action",
        "value": "Delivery Boy looked a little awkwardly, not knowing what to say."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Yes.... I saw vibrating. Sorry for the expression, it was a quick word. Ah! Please! Just get it soon! It could be anything, maybe something inside the burguer, you'll need to check it out to see what it is."
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Vini",
        "value": "Okay can i open it now before you leave?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "feel free, just don't delay please. I'm getting late."
    },

    {
        "type": "action",
        "value": "Yasmin kept laughing and trying to talk to Vini."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Then? Where's X-Tudo? We need to see the surprise together to be more fun!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Calm down Yasmin, the guy said there's some stuff vibrating here and I'll show you on cam."
    },

    {
        "type": "action",
        "value": "Vini opens the box slowly. Afraid about what was inside the box. Vini see an X-Tudo, very big, just the way he wanted, twice the size that was in the photo."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Everything seems normal to me...Ah! It must have been a mistake, maybe it was the bike that was vibrating and I didn't notice. Sorry there bro!"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "value": "Well... I have to leave now, don't forget to give me 5 stars, thanks."
    },

    {
        "set": { "playlistPlay": null },
        "type": "action",
        "value": "The Delivery Boy, without thinking twice, was already leaving."
    },

    {
        "set": { "playlistPlay": "tech-problem" },
        "type": "dialogue",
        "character": "Vini",
        "value": "Are you kidding me? What was this thing vibrating?"
    },

    {
        "type": "action",
        "value": "Yasmin then kept laughing until she heard Vini talking."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vibrating? What?! Oh silly Vini! Don't make up jokes! Haven't you noticed the surprise yet?"
    },

    {
        "type": "action",
        "value": "Vini was extremely confused. Trying to understand what was going on. Trying not to think about what he was thinking."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Yasmin, did you tell the delivery boy to do this prank on me? WHY?!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Prank? What?! Don't tell me you haven't figured out what the surprise is yet!"
    },

    {
        "type": "action",
        "value": "Vini enters and goes to the kitchen to get a plate and goes back to the bedroom. The X-Tudo mysteriously started to vibrate a little on the table"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Ah! Fuck, this fuck is alive."
    },

    {
        "type": "action",
        "value": "Vini approaches X-Tudo and will analyze the burguer carefully."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Live? Vini! What did you do with X-Tudo? Haven't you noticed the obvious yet?"
    },

    {
        "type": "action",
        "value": "When Vini tried to analyze X-Tudo, he felt a kind of blue light, but X-Tudo didn't want to be opened completely at all, it just vibrated more with each touch it received."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Yasmin, there's some stuff coming out of X-Tudo."
    },

    {
        "type": "action",
        "value": "Vini looked at the X-Tudo and tried harder to open it."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Coming out of X-Tudo? What are you talking about! I only ordered a double size!"
    },

    {
        "type": "action",
        "value": "The X-Tudo vibrated more and more, and the light started to get stronger, but Vini was starting to realize that he was making progress, and that he just needed to do a little more force, as he accidentally spilled some parts of the X-Tudo on the table because of the vibration."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "N..Noo! My house! Wait, I'm looking at what's inside the X-Tudo, everything and a little more, hold it there."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vini... You're scaring me. What's happening there?"
    },

    {
        "type": "action",
        "value": "Vini still keeps trying to force against the burguer, feeling extremely difficult to keep trying this again and again."
    },

    {
        "type": "action",
        "value": "While more Vini tried, but the light got stronger, and X-Tudo vibrated extremely hard, spilling all parts of X-Tudo all over the kitchen, making a loud noise on the table because of the vibration"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "NO NO NOOO! MY HOUSE!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "V...Vini? Are you okay? It's for eating X-Tudo! It's not to mess up the X-Tudo! What are you doing?!"
    },

    {
        "type": "action",
        "value": "Yasmin started talking in a worried voice. Then Vini finally manages to open X-Tudo, making all the rest of X-Tudo fly all over the place, he soon realizes what he was pulling inside X-Tudo, in fact it was a kind of bracelet, which quickly attaches to the his arm, but in the middle of it all comes a very bright light that takes over the whole kitchen."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "W..What?! What is this Vini? Did the restaurant give you any SmartWatch as a gift?!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Stop kidding! I need help! What is happening?! W...What fuck?! My house will explode!"
    },

    {
        "type": "action",
        "value": "The glow then started to behave like a black hole, trying to pull Vini into it."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "No, no! NO! This is IMPOSSIBLE! Damn Jasmin it happened, I don't know, your X-Tudo blew up and it's sucking me, this shit stuck on my arm, I'm going to turn the Men 10!!!!"
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Oh my god! I'll call the police!"
    },

    {
        "type": "action",
        "value": "Vini was in the last seconds of his presence before the black hole sucked him in completely, and suddenly he disappeared along with his phone, which was increasingly losing signal as he went deeper into the mysterious black hole."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "value": "Vini?! C.......of.........you....O... ...What's happening?! V...Vini! The sign! Signal is horrible! N...Nooo! Came back here! V....Viiiiini!"
    },

    {
        "type": "action",
        "value": "and the signal was completely lost and the Discord connection dropped while Vini continued to be sucked deeper into the black hole"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Yasmin what did you do?! NOOO!"
    },

    {
        "type": "action",
        "value": "Then suddenly everything went blank, and Vini's consciousness was temporarily lost for an unknown period of time."
    },

    {
        "set": {
            "where": "Greendream Beach",
            "playlistPlay": "sad"
        },
        "type": "action",
        "value": "After a long time, Vini was in another mysterious place, his phone was with him, it was a beautiful day, the morning was starting, another normal day on the place, everything was very calm, the beach was deserted as usual because of the schedule. And mysteriously Vini wakes up on the beach, lost not knowing why he was there."
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "Damn man, what happened? I was talking to Yasmin and suddenly... X-TUUUUUUUDO!!! What the fuck happened..."
    },

    {
        "type": "action",
        "value": "Vini look at he arm curiously. Soon Vini noticed that everything was very different with his body when he felt the shape of his body. Instead of him seeing hands, he saw pony paws, while the calm water of the beach continued to calmly move on the sand."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "What the...fuck... What? Am I a horse? ...a pony? I don't know."
    },

    {
        "type": "action",
        "value": "Vini try to calm down and I see around me what is happening and I see the phone and I try to move."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "I can't touch the phone because I don't have a FINGER!!! but I see there's something on my back, it's wings!!!!!!! WHAT'S HAPPENING HERE?!"
    },

    {
        "type": "action",
        "value": "So Vini try to use the wings to poke the phone screen. The phone turned on the screen and when the face detector felt the presence of Vini eyes, and all Vini saw was just the screen locked, and the phone was completely out of signal. No 4G, no Wi-Fi, no internet connection."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Oooh okay."
    },

    {
        "type": "action",
        "value": "Vini was sad and hopeless. He didn't know what else could be done in that moment now. Suddenly Vini starts to hear the sound of footsteps approaching from the opposite direction to him, coming slowly, making him look back curiously."
    },

    {
        "type": "action",
        "value": "Vini see a silhouette of another pony slowly approaching, thinking to do contact with you, and it gets closer and closer."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "W...what? O..Oh no.... Oh, okay then I'll wait."
    },

    {
        "type": "action",
        "value": "Vini was scared, but he just accepted the fate of waiting for the mysterious earth pony to approach him."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Oh...it's not possible. It's...Is that what I'm really seeing? Did another new pony appear? Are you new around here?"
    },

    {
        "type": "action",
        "value": "The mysterious pony looked a little scared, trying to understand who you are."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Aah hi, my name is Vini, are you guys okay? they look worried."
    },

    {
        "type": "action",
        "value": "Vini tried to stay calm, talking calmly and trying to be calm."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Good? this should be my question. Are you sure you're alright? You look kind of scared. How long have you been here?"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Oh, I kind of don't remember but I ended up waking up just now, not sure what happened to me last night."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Last night? Have you been attacked by Elite Color?! Keep calm, I can help you!"
    },

    {
        "type": "action",
        "value": "Mysterious pony comes closer to you, offering to help you"
    },

    {
        "set": { "playlistPlay": null },
        "type": "dialogue",
        "character": "Vini",
        "value": "E..Elite color? I really don't remember, and I accept the help, thank you very much."
    },

    {
        "type": "action",
        "value": "Vini tried to remain calm, but slowly felt better as he realized the gentleness of the mysterious pony. But he was still confused and scared about what was happening. He tried to get up but failed."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "I think I'll need more than help, I kind of can't walk."
    },

    {
        "type": "action",
        "value": "Vini was very embarrassed to realize that he didn't know how to walk on four legs while answering."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Wait... Can't you walk? Are you sure you're from here? What city do you come from? Just try to stay balanced and don't let your body weight make you lose balance."
    },

    {
        "type": "action",
        "value": "Mysterious pony was surprised by your words, he gradually helped you to get in a balanced pose so you could stay seated."
    },

    {
        "set": { "playlistPlay": "calm" },
        "type": "dialogue",
        "character": "Vini",
        "value": "Heck bro, I'm trying to remember and I think I remembered I was eating something and blacked out, and I came here out of nowhere."
    },

    {
        "type": "action",
        "value": "Vini tried to balance himself between his paws as he responded."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "From... From nothing?! So I'm right! You are also a new visitor from another dimension!"
    },

    {
        "type": "action",
        "value": "Vini lost the balance of the pose of the paws and fell on the sand again."
    },

    {
        "type": "dialogue",
        "character": "???",
        "value": "Oh yes, I think this is more than evidence. Hihi... Don't worry , I teach you to walk. My name is Kenny!"
    },

    {
        "type": "action",
        "value": "during the giggles of Kenny, Kenny starts to smile at Vini and prepare to help Vini stand up again. Vini felt even better about Kenny's kindness. He looked at Kenny still confused about what was happening, but he simply continued to accept the help."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Yeah hihi, thanks for the help Kenny."
    },

    {
        "type": "action",
        "value": "Kenny felt happier wanting to keep helping Vini."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "You're welcome. Just keep calm, and start walking very slowly, you need to keep balance and sync between all 4 legs. This way you'll soon learn to walk.The village is very close to here, you can rest in my house with my friend Raquel."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "When we see your SmartMoby, we'll be able to help you better."
    },

    {
        "type": "action",
        "value": "Kenny smiles again and started to help Vini during the first steps to start to walk."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "What? What is a SmartMoby? I have one?"
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Oh sorry! Yeah! The SmartMoby is on your arm right now. This is part of you, we all have one. It's like a phone, but actually it's a device that carries your soul and keeps you alive here."
    },

    {
        "type": "action",
        "value": "Vini looked at his arm and was surprised. That device had now merged with his arm. It was just a screen on his arm and it was impossible to remove as it was now part of his arm."
    },

    {
        "type": "action",
        "value": "Kenny kept helping Vini walk. The place was very calm. It looked completely deserted. Vini immediately thought it was something he had already seen somewhere. But he found it extremely strange that the ponies found were different from what he knew about ponies. Was it really the world he was thinking about or could it be just a coincidence?"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Hey man, let me get my phone, as I remember, it's a device similar to that in my world, but it has other important features, like listening to music or having many books in it."
    },

    {
        "type": "action",
        "value": "Vini looks for the phone to store the phone in somewhere."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Listen to music? I've never seen anything like this."
    },

    {
        "type": "action",
        "value": "Kenny felt surprised and a little scared."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "But alright, let me get it! Try to stay upright!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and let Vini go so Vini could try to balance yourself between the 4 legs while he went to get your phone in the sand."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Okay... Fine."
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "This is much stranger than I imagined. Will I be stuck here forever? How are my friends and my parents doing?"
    },

    {
        "type": "action",
        "value": "Right after Kenny give the phone, Vini hold the phone."
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "I remember the battery and I DIDN'T TAKE THE SHIT CHARGER! WHY?!"
    },

    {
        "type": "action",
        "value": "Vini got mentally pissed off. and as soon as I see that there was no signal, Vini try to turn the phone off."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Vini? Are you okay? Is something wrong with your phone?"
    },

    {
        "type": "action",
        "value": "Kenny said with a curious face, looked at Vini and he reactions while trying to help he keep up again. Then the two started walking towards the village."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "O..oh? Oh yeah, kind of the energy that makes it stay on runs out quickly so I'll only use it in cases of need because I need another part to recharge it. but yes he is normal, thanks for helping me get phone back."
    },

    {
        "type": "action",
        "value": "Vini was worried about his phone battery. It looked like his phone was the last thing left of items from Earth. Vini's clothes had mysteriously disappeared too."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Recharge a phone? Hmm... Maybe James can help you if he's willing to walk with you. He is a friend of mine who loves adventures. I believe he will be returning home soon."
    },

    {
        "type": "action",
        "value": "Kenny spoke thoughtfully as he continued to help you walk."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Okay... Let's go. Soon we'll be home!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "James? But I just met you! You're crazy?!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and ran forward, revealing that Vini were starting to walk alone without help, but then you started to lose he balance for a few seconds when he realized that there was no one helping he."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Oh? no no no no no!"
    },

    {
        "type": "action",
        "value": "Vini tried not to completely lose his paws balance."
    },

    {
        "type": "dialogue",
        "character": "think",
        "value": "At least he seems to be very silly. I see no reason why he wants to kidnap me."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Uff... About earlier, you said something about Elite Color, what would it be exactly?"
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Elite Color? oh! The Elite Color! Sorry, I forgot to talk about the Elite Color. Elite Color is a mysterious organization that claims to protect this world. We don't really know what they are, but sometimes they do some cruel things. They live on top of the highest mountain in Pony Driland, which is our island you're on."
    },

    {
        "type": "action",
        "value": "Kenny then looked at Vini walking. He was surprised and very happy."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh? Look! By the way! You are starting to learn to walk on 4 legs! You're learning fast!"
    },

    {
        "type": "action",
        "value": "Vini giggles a little before answering. trying to be a little friendlier"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "You also said at the beginning, or comment in a strange way, the way you entered me and said \"you also came from another dimension\" are there others besides me?"
    },

    {
        "type": "action",
        "value": "Kenny spoke with a worried face."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh yes... The others."
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "Oh shit... Here comes the bad news."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "All of us here come from many different dimensions. We've been stuck here forever, we don't know how to get out of here, it's been many years since I've seen my family, and I don't remember in detail what my real body was like."
    },

    {
        "type": "action",
        "value": "Kenny tried to be positive as he continued to explain."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "I hope you don't get scared by this fact, that's the motive I was worried when I found you here. It's very dangerous for newbies to walk alone around Pony Driland. This place is very dangerous if you don't know how things work around here."
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "HOLY SHIT! NO! FOREVER?! Is everyone here alien?! That's what i understood?! WHY?!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "Ah..."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Ah? Please don't be too surprised, Raquel and I are going to help you! If you've been in good company, I'm sure you'll do fine around here."
    },

    {
        "type": "action",
        "value": "Kenny was thoughtful, trying to calm Vini down, so he responded."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "It's what we can do for Pony Driland newcomers. I'm sure you'll like your new life. Unfortunately I can't hold back your curiosities. So...if you really want to find out more about this place. You'll have to try to be friends with James."
    },

    {
        "set": { "playlistPlay": null },
        "type": "think",
        "character": "Vini",
        "value": "James... Who is James? Why everyone is a alien in a pony body?! Look where I accidentally got myself into an X-Tudo! Someone save me from this nightmare. Please!"
    },

    {
        "type": "action",
        "value": "Kenny kept walking and he saw the village soon the front."
    },

    {
        "type": "dialogue",
        "character": "Kenny",
        "value": "Oh! Look! We are almost there! Right in time!"
    },

    {
        "type": "action",
        "value": "Kenny smiled and started to move faster. Vini was surprised. He just looked around for a few seconds, looking for something randomly. So Vini tries to follow Kenny's speed."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "value": "H..Hey! Wait me!"
    },

    {
        "set": {
            "playlistPlay": "fantasy-village",
            "where": "Greendream Village"
        },
        "type": "action",
        "value": "Kenny arrived in the village, the village was a little busy, Vini saw some random ponies starting another new day as Kenny arrived at his door."
    },

    {
        "value": "Kenny starts to smile and looks around looking for you.",
        "type": "action"
    },

    {
        "value": "Oh? Vini? Vini?! Oh Vini! You are there!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny smiled again and waved at Vini, happily inviting Vini to come faster.",
        "type": "action"
    },

    {
        "value": "Vini looked smiling back with a pokeface.",
        "type": "action"
    },

    {
        "value": "I'll get there. A moment...",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "You're doing great! Soon you will walk better on 4 legs!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny giggles a little before smiling again and kept waving at you, waiting for Vini to arrive.",
        "type": "action"
    },

    {
        "value": "Vini looked smiling back again with a second pokerface.",
        "type": "action"
    },

    {
        "value": "I'm coming... coming slowly.",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Vini looked smiling back again with a second pokerface. Vini then tried a little harder, with great difficulty, but he finally arrived.",
        "type": "action"
    },

    {
        "value": "Hah! I arrived! Yes!",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Vini then was very thoughtful, he looked all around and was surprised by the scenery that was being observed.",
        "type": "action"
    },

    {
        "value": "Wow There's a lot of ponies here and a lot of little houses here.",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Vini slowly felt that his walking skills were getting better and better. But he could still feel uncomfortable with the whole new environment. He looked very confused and at a loss as to how all this was possible. Why was he there, how did he get there. Everything was just amazing for Vini.",
        "type": "action"
    },

    {
        "value": "Yes. You are in Greendream Village. Be very welcome new one!",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny knock on the door happily.",
        "type": "action"
    },

    {
        "value": "Vini found Kenny's attitude strange, he watched and analyzed him for a few seconds curiously before asking the question.",
        "type": "action"
    },

    {
        "value": "Oh? Does this house belong to you?",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Ehe! It's the house where Raquel and I live. You can feel right at home now. Uou can stay here if you need some shelter.",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny is a little nervous for a few seconds to answer, but then he continues with a smile while he look at the door being opened, so Vini saw Raquel.",
        "type": "action"
    },

    {
        "value": "Good morning Kenny! How's the... Oh? New one?",
        "type": "dialogue",
        "character": "Raquel"
    },

    {
        "value": "Raquel spoke in a frightened way for a few seconds.",
        "type": "action"
    },

    {
        "value": "Calm down... it's Vini. I found him on the beach where newbies spawn when they teleport here sunddely. He is here to be received! Right Vini?",
        "type": "dialogue",
        "character": "Kenny"
    },

    {
        "value": "Kenny spoke happily while looking at Vini.",
        "type": "action"
    },
    {

        "value": "Ah... Yes?",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Yes? Yes... Hello Vini. Welcome.",
        "type": "dialogue",
        "character": "Raquel"
    },
    {
        "value": "Raquel looked curiously at Vini for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "My name is Raquel, nice to meet you. It's the first time I've seen a newbie visit our house.",
        "type": "dialogue",
        "character": "Raquel"
    },

    {
        "value": "Raquel spoke in a shy way before smiling back. Vini then tried not to scare Raquel too much and tried to respond kindly when he realized that this would be the best alternative to not being alone in the unknown world.",
        "type": "action"
    },

    {
        "value": "Pleasure, my name...well you already know. My name is Vini hihihihi. Kenny found me at the beach and brought me here, thank you very much for your consideration.",
        "type": "dialogue",
        "character": "Vini"
    },

    {
        "value": "Vini smile a little more while looking around. Vini saw houses and more ponies around having their daily routine, around Vini also saw some trees around the village, and under these trees there were sticks and some pieces of leaf, stones, it was a very rich place in nature mixed with the village , and later on, there were other places like the street vendors' square and some buildings owned by those who manage the village.",
        "type": "action"
    },

    {
        "value": "Well... Make yourself at home...I...I made some pancakes for breakfast today.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel continued with the shy happy face as she offered to enter. Vini then went back to listening to the conversation, surprised to hear about the meal.",
        "type": "action"
    },

    {
        "value": "Pancakes! Today is your lucky day Vini! Pancakes are the best morning meal we have here at home!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny said all excited in response. Raquel was a little surprised but then she laughed a little. Vini was still confused, trying to understand all that kindness. Then he would analyze the situation again and just respond. Vini was a little nervous trying to believe Kenny.",
        "type": "action"
    },

    {
        "value": "Ahn thank you very much, but why are you helping me? You don't know me or anything like that, for example, I'm a stranger to you, don't you think it's strange for a stranger to enter your house? Even weirder that he came from another world and doesn't even know how to walk right? Doesn't it seem a little strange to you?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Kenny got a little nervous and would just respond by laughing a little to relax.",
        "type": "action"
    },

    {
        "value": "Oh? Vini don't worry, I saw in your face that you were lost. We work hard to make guests feel welcome in the village and feel comfortable here. We don't want anyone to risk the life and end up going to the dark side of Pony Driland.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "So please make yourself at home. We just want to do this for your own good.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny answered Vini and offered Vini to enter too. He proved to be positive in what he was doing. He wanted Vini to feel good. He just waited for Vini to enter the house.",
        "type": "action"
    },

    {
        "value": "Okay okay... I understand, so excuse me, what a beautiful house! *-*",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Make yourself at home!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny smiled and rubbed he head at Raquel face. Raquel looks at Kenny for a few seconds before smile, so Raquel rubbed her face back while the two enter the house.",
        "type": "action"
    },

    {
        "type": "think",
        "character": "Vini",
        "value": "Hahaha... I think I get it. they are a couple. it is cute."
    },

    {
        "value": "Vini soon saw that it was a house mixed with a medieval style with the technological things of a modern house. Vini saw a beautiful room rich in furniture, Vini just missed some things that are normally used for communication like television and telephone. And just ahead Vini could see the table where Raquel was preparing breakfast with pancakes. So Vini waits for kenny to say something, waiting at the entrance, making Kenny look at Vini.",
        "type": "action"
    },

    {
        "value": "Oh? Vini? You may come in! Remember you are welcome here!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny invited Vini to enter again as Kenny went with Raquel towards the breakfast table.",
        "type": "action"
    },

    {
        "value": "Oh? Okay. Thank you again for everything.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini was a little more surprised to be invited in. Vini heading towards an empty chair at the table.",
        "type": "action"
    },

    {
        "value": "Did you talk about me meeting someone to know the right place? who was it?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Oh? James? Yep! James... He's a great adventurer who understands a lot about everything.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "James? Are you sure Kenny? He's kind of grumpy with new people. He always says he wants to do things all by himself. And Vini just arrived in our world. This is extremely dangerous for him.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel does a sad face, saying a little worried when she starts to think about the negative possibilities that could happen.",
        "type": "action"
    },

    {
        "value": "But... but Raquel. I'm sure James really needs an adventure partner. I get really worried if something happens to him along the way and there's no one to help him. He is very lucky that he is still alive.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied sadly back. Vini was worried trying to understand what was going on while watching the conversation.",
        "type": "action"
    },

    {
        "value": "Oh really? Where did I end up accidentally getting myself into?",
        "character": "Vini",
        "type": "think"
    },

    {
        "value": "If Vini is a good adventurer, I'm sure they can do well!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "...",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Cool.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini eats pancakes while doing a poker face in answering this.",
        "type": "action"
    },

    {
        "value": "Okay! The pancakes are great!",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "C..Cool?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel get confused when she hears Vini reaction.",
        "type": "action"
    },

    {
        "value": "Yep....That's nice! It will be really fun! Vini will enjoy a good adventure!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny does a silly laugh.",
        "type": "action"
    },

    {
        "value": "Yes... I said cool in the sense of finding it a bit cool when kenny said \"He's very lucky he's still alive\" I thought it was a little cool and weird, but nothing that scared me.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini continue eating pancake while doing a nervous giggles.",
        "type": "action"
    },

    {
        "value": "Kenny... Are you sure?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Weeeeeeeeeell...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny laughed nervously as he thought about the consequences.",
        "type": "action"
    },

    {
        "value": "if Vini likes a good adventure.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny continue speaking awkwardly while continuing to eat breakfast.",
        "type": "action"
    },

    {
        "value": "Kenny... Please no. Don't be like that, James will be fine, maybe we'd better help him to have a life in the village.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel talks about a way to make Kenny calm down. Raquel was worried about Kenny's reaction to trying to help James. Meanwhile, Vini was watching the conversation and was slightly worried about Kenny. But he is slowly trusting more as he sees Raquel talking to Kenny, and notes that they are just normal villagers.",
        "type": "action"
    },

    {
        "value": "Well, I'm new here, so I don't see why not meet new things and new ponies too, of course if it's not too much trouble.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini tried to remain calm and only responded with a slight nervousness. Kenny would then start trying to be more positive, trying to get some hope.",
        "type": "action"
    },

    {
        "value": "But but... You have a cell phone that does amazing things like you said.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "M..Mobile?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel reply, getting a little confused and surprised while holding a piece of the breakfast she is eating. Vini was curious and a little surprised before answering.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Oh really? Don't you have anything that looks like a cell phone? Cell phones are very common where I came from, they are very common everyone has them, we use them to communicate with other people, watch BoboFlix, play games, send nudity to people, basically it was a very well done work.",
        "value_alternative": "Oh really? Don't you have anything that looks like a cell phone? Cell phones are very common where I came from, they are very common everyone has them, we use them to communicate with other people, watch BoboFlix, play games, basically it was a very well done work.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "C..communicate? Amazing! Communication is rare in Pony Driland! BoboFlix? My God! That name... is this some specialist agency?!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny's eyes dilated a little as he got excited about the cell phone.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Wait.... Nudes? WHAT?!",
        "value_alternative": "W...what?",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel was very confused when trying to understand what is happening.",
        "type": "action"
    },

    {
        "nsfw": ["questionable"],
        "value": "Yes, nudes. A way for you to pay the people you work for.",
        "value_alternative": "Yes. This is the phone. Something wrong about it?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "Vini was a little embarrassed and thoughtful when thinking how to say about nudes without being explicit.",
        "value_alternative": "Vini tried to understand Raquel's reaction during some seconds.",
        "type": "action"
    },

    {
        "value": "Well... Yes Kenny, you can do everything inside the phone, it's amazing, but unfortunately it's limited in terms of functioning where it only stays on until the battery or batteries run out.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "......",
        "value_alternative": "Okay? Maybe i understood.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "nsfw": ["questionable"],
        "value": "Raquel is still embarrassed, trying to understand what Vini was talking about.",
        "value_alternative": "Raquel didn't know what to say and just continued watching the conversation.",
        "type": "action"
    },

    {
        "value": "Wait... run out of battery? And how do you recharge that battery? Did you bring anything to do this?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny remains excited, wanting to understand more about the mysterious cell phone.",
        "type": "action"
    },
    {
        "value": "Wait... I didn't bring the charger! SHIT!",
        "character": "Vini",
        "type": "think"
    },

    {
        "value": "Okay okay... Unfortunately I don't have the charger, because I wasn't with me on the beach and I don't have faith that it's here.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini was very uncomfortable and very nervous trying to think about what to do if the cell phone just ran out of battery. He was very worried. So Vini looked at Raquel and saw her reaction again, so he decided to ask.",
        "type": "action"
    },

    {
        "value": "Ah? Are you ok Raquel?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini speak calmly and surprised.",
        "type": "action"
    },

    {
        "value": "No...nothing...nothing. I hope I got it wrong. The breakfast was great, I'll take care of my gardening now. I will be right back.",
        "character": "Raquel",
        "type": "dialogue"
    },

    {
        "value": "Raquel makes a disguised smile of shocked reaction, and moves towards the door that leads to the garden of the house.",
        "type": "action"
    },

    {
        "value": "Raquel? Where are you going? Wait! Oh okay, too late.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kelly was looking a little confused as Raquel closes the door.",
        "type": "action"
    },

    {
        "value": "Well Vini, sorry I didn't see anything on the sand when I found you. But maybe James can help you with that. I don't know anything about technology, only James knows better about it.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny makes a slight smile, trying to show a feeling of apology for what happened.",
        "type": "action"
    },

    {
        "value": "Yeah, I'm going to save the remaining energy for something very useful. Don't worry, I forgive you.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini sighs deeply.",
        "type": "action"
    },

    {
        "value": "Well... Kenny, can I help you with something? What do you do on the morning? Can I help you with something?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Thank you... I'm going to the market to shop soon. If you want to accompany me, it would be a great help.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny giggles a little, trying to forget a little about the negative side of the previous conversation.",
        "type": "action"
    },

    {
        "value": "Ah, wow, yes yes, we can walk and you will instruct me more about walking on 4 and even trying to use the wings if possible of course.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "No problem! It's going to be fun and fun and a lot of fun! Every step is progress!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny speaks confidently.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe this is all a dream, maybe I hit my head while trying to eat my X-Tudo. Let's take it easy, the exit from this place shouldn't be too far. There must be someone superior who can send me home.",
        "character": "Vini",
        "type": "think"
    },

    {
        "value": "And about the wings, well... Raquel and I are earth ponies, we don't know how to fly, you'll have to find another pegasus to learn how to use them.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied with a nervous smile trying to find an answer for you.",
        "type": "action"
    },

    {
        "value": "Ah, okay okay.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "ARGH! Fall for the obvious. Nice.",
        "character": "Vini",
        "type": "think"
    },

    {
        "value": "What time are we going to the market?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "set": { "playlistPlay": null },
        "value": "Now! I've already finished my breakfast schedule.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied while finishing the rest of the food on his plate before leaving a small friendly giggles about Vini answer.",
        "type": "action"
    },

    {
        "value": "Ok ok ok, if possible I can accompany you and we can talk on the way ok?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Fine!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny replied happily as he got up from the chair and put the bag saddle on he body. Then Kenny and Vini started walking towards the market.",
        "type": "action"
    },

    {
        "value": "a saddle? Is that like a backpack? Interesting...",
        "character": "Vini",
        "type": "think"
    },

    {
        "set": { "playlistPlay": "think" },
        "value": "Vini watched Kenny use the saddle for a few seconds as he followed Kenny. Then the two ponies started walking through the village. Vini and Kenny were walking through the village towards the market, passing several and several ponies and houses, the village was very busy with several ponies living life, adults and children living their routine, and children playing happily on the street. Then Kenny would look at Vini and ask kindly.",
        "type": "action"
    },

    {
        "value": "Well. What would you like to talk about?",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Where do you and Raquel know each other from? very nice of you 2 to welcome me after I suddenly show up on the beach. In my world people aren't that kind.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Kenny was a little surprised and responded.",
        "type": "action"
    },

    {
        "value": "That's true? Is your species going extinct? This looks terrible.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "No, these are stupid things to be honest. Oh many nations in wars, deadly viruses and deadly diseases spread around the world, but I had a normal life. I woke up every day, I ate, I did my housework since I didn't have a job and I slept in peace, but it was a little life bad for people, people were very selfish and only thought about them, so it was a little bad. but I could live without any problems. But well, sorry to interrupt you, but you can continue.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Nations at war? virus? Were you in the middle of an apocalypse? That's terrible. Well, I forgive you, maybe one day everyone will understand better about this. Well then...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny speak a little scared for a seconds. So Kenny got a little emotional remembering this information, but then he responded.",
        "type": "action"
    },

    {
        "value": "Well... We met on the exact same beach you showed up on. We had a pure coincidence that we were teleported here at the same time, but we are from different dimensions. By instinct we decided to stay together to try to protect ourselves, and that ended up creating our friendship.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny grew slightly more worried as the conversation continued.",
        "type": "action"
    },

    {
        "value": "And who helped us start our life here was James, we met him in the middle of the forest when we were trying to discover how to survive in this place. It's a long story, I'd found him in need of help, he'd been attacked by Elite Color. So as a thank you, he helped us build a house and a new life around here.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny gave a nervous little laugh when he remembered more thing.",
        "type": "action"
    },

    {
        "value": "About your past... It reminds me a little the James's past... When he told me a little bit of his story, he said something similar.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "What?!",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini was a little surprised and worried to hear this.",
        "type": "action"
    },

    {
        "value": "Jeez, how long has he been here?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "I don't know for sure... but from the stories of the journeys he's taken... It seems like a long time ago. He has a lot of experience in what he does.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Okay... This doesn't look good. It's nothing good. Will I be stuck in this place forever?!",
        "character": "Vini",
        "type": "think"
    },

    {
        "value": "Interesting, it seems that he only has you as an friend.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Kenny laughed a little nervously.",
        "type": "action"
    },

    {
        "value": "James is kind of anti-social. A little...",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Oh, I see. Well, sorry to interrupt the conversation, but we will arrive the market?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Market? We are.....AAH!",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny bumps onto the door of the market shop by accident.",
        "type": "action"
    },

    {
        "value": "Y..Yes....we arrived. @.@",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Jeez, it looks like someone still doesn't know how to walk on all fours well yet.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini speak ironically but friendly. So Vini help Kenny.",
        "type": "action"
    },

    {
        "value": "Thank you. Don't worry. I am fine.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny moved to get up slowly while the market door swung for a few seconds because of the impact, and some ponies from the market looked a little surprised at the scene.",
        "type": "action"
    },

    {
        "value": "Kenny? Are you okay?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Me? I'm great.. I've never been better... It was just a light tap on the door.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny put his paw on his head to try to get as dizzy as possible. When everyone noticed that Vini was fine, everyone went back to the routine.",
        "type": "action"
    },

    {
        "value": "Okay. So, you came to buy what here at the market?",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Kenny smiled and answered.",
        "type": "action"
    },

    {
        "value": "Well, I came to buy food, but if you want, you can buy some important things for your daily life. Feel free. I can help you pay for things.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Vini starts to hear someone giggles around, making Vini looks towards the giggle. Vini laughed a little back.",
        "type": "action"
    },

    {
        "value": "Ah? I think someone laughed about it, I think as I came from another world, there are 2 details, even if I had some money here, I think my kind of money wouldn't be used here.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "So Vini looked at a female unicorn doing a suspicious face while laughing at Vini.",
        "type": "action"
    },

    {
        "value": "Ah? Another dimension? Interesting to know. I think we have a newbie here.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious unicorn was giggling again at Vini and approached slowly to analyze him.",
        "type": "action"
    },

    {
        "value": "Yeah yeah... if your world's money is just a sheet of paper like I've seen a few times... forget it. Wait, this voice? Oh no.",
        "character": "Kenny",
        "type": "dialogue"
    },

    {
        "value": "Kenny looked a little surprised from the voice.",
        "type": "action"
    },

    {
        "value": "Ah...Hi.",
        "character": "Vini",
        "type": "dialogue"
    },

    {
        "value": "Vini turns to Kenny for a few seconds. Then he turned to look at the mysterious unicorn.",
        "type": "action"
    },

    {
        "value": "Oh? You're rude...",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The unicorn giggles again and uses her magic, changing direction of Vini face for Vini to look at her. Vini saw her wearing a cape to protect her identity a bit, but she left her face visible to Vini.",
        "type": "action"
    },

    {
        "value": "Won't you even let me introduce myself? You are very impolite.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The unicorn approaches you while giggling more suspiciously.",
        "type": "action"
    },

    {
        "value": "W...wait! What are you doing?!",
        "character": "Kenny",
        "type": "dialogue"
    }

]