[

    {
        "type": "action",
        "text": "It was just another normal day on Planet Earth. It was a beautiful normal day like any other, Vini was living his normal life, he still hadn't showered, and he was talking to his friend Yasmin through Discord. It was a simple super decisive conversation for her to finally pay the X-Tudo Vini wanted so much. Vini was very happy, as he had been waiting for this day for several months, so this was the decisive magic moment. Everything was extremely quiet. It was just a silly Discord conversation like any other day."
    },

    {
        "type": "action",
        "text": "Yasmin then looked at the monitor impatiently, and just wanted to get this story over with, so he wouldn't need to talk about X-Tudo anymore."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "ah! Ready! I finally got my credit card working! I'm going to buy your X-Tudo now! Now it's time to stop this silly nonsense time!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Yes! Yeees Yasmin!!!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "message": "You've messed up the entire online casino! Don't think this will happen again!"
    },

    {
        "type": "action",
        "text": "Yasmin would then sigh deeply and slowly calm down when she realized that everything was finally solved. She was very thoughtful observing the whole situation before confirming the order"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "message": "Uff...Okay... I sent your order just the way you asked. The delivery man of food app is already on his way to your house. I recommend you keep an eye on the GPS, or the delivery boy will pass right by."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Wow, my address isn't right? Motoca is going to screw up my X-Tudo!"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Ah Vini! Nope nope! You sent the address! You're going to receive your X-Tudo!"
    },

    {
        "type": "action",
        "text": "Right now Vini's phone started beeping Food App Notifications."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Oh yes, man!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Heh! Let me see my phone beeped here."
    },

    {
        "type": "action",
        "text": "Vini anxiously raises his hand and takes the phone, after unlocking it with his finger he looks at the notifications"
    },

    {
        "type": "action",
        "text": "Vini saw the notification that the delivery boy was about to arrive, his cell phone already asking him to go to the door of his house to wait for the delivery boy"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "so? He is coming?"
    },

    {
        "type": "action",
        "text": "Yasmin spoke giving a silly little laugh."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "I want you to take the phone with you, I left a reminder in App Food about a little surprise for you when the order arrives."
    },

    {
        "type": "action",
        "text": "Surprised Vini speaks in a curious way."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "What the hell? What would that be?"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Okay, let me enter the call on my cell, HOLD IT!!!!!!!!!!"
    },

    {
        "type": "action",
        "text": "Yasmin laughs harder before answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Relax siily Vini... you'll find out. Please... Just don't screw it all up. Mainly the phone!"
    },

    {
        "type": "action",
        "text": "Meanwhile, Vini began to hear the noise of the motorcycle."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Okay okay! Let me go see the gate. YES!"
    },

    {
        "type": "action",
        "text": "Vini then got up from his computer. He was home alone. He then went to the gate to open it to receive the food. Meanwhile Yasmin kept laughing and answering."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Don't worry, the surprise will be all good like your X-Tudo."
    },

    {
        "type": "action",
        "text": "Vini then met with the delivery boy, already looking a bit confused about what Yasmin was talking about."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Hello... good afternoon sir, are you Vinicius?"
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Look there! Go mess up the delivery boy again!"
    },

    {
        "type": "action",
        "text": "Yasmin reply with a silly giggle."
    },

    {
        "type": "action",
        "text": "Vini was wanting to speed up and get back to his room soon before the delivery boy could hear jasmin laughing"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Oops good afternoon, it's me yes, is it the snack?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Oops... yes, Your lunch... An X-Tudo. Everything and a little more..."
    },

    {
        "type": "action",
        "text": "Delivery Boy tried to react naturally when he noticed a kind of anxiety in Vini."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "This burger was vibrating inside my motocycle, so please, if there's something wrong with your lunch, let me know that we'll exchange your lunch for a new one."
    },

    {
        "type": "action",
        "message": "Delivery Boy delivered the X-Tudo box kindly to you."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "The burger has arrived! Finally arrived!"
    },

    {
        "type": "action",
        "message": "Yasmin continued the silly giggles, happy to see Vini's reaction."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "it's a joke, right? prank right? What is this vibration?"
    },

    {
        "type": "action",
        "message": "Vini reply with a surprised face and mischievousness."
    },

    {
        "type": "action",
        "message": "Delivery Boy looked a little awkwardly, not knowing what to say."
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "Yes.... I saw...vibrating. Sorry for the expression, it was a quick word. Ah! Please! Just get it soon! It could be anything, maybe something inside the burguer, you'll need to check it out to see what it is."
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "...Okay can i open it now before you leave?"
    },

    {
        "type": "dialogue",
        "character": "Delivery Boy",
        "text": "feel free... Just don't delay please. I'm getting late."
    },

    {
        "type": "action",
        "message": "Yasmin kept laughing and trying to talk to Vini."
    },

    {
        "type": "dialogue",
        "character": "Yasmin",
        "text": "Then? Where's X-Tudo? We need to see the surprise together to be more fun!"
    },

    {
        "type": "dialogue",
        "character": "Vini",
        "text": "Calm down jasmin, the guy said there's some stuff vibrating here and I'll show you on cam."
    },

]