[

    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 3,
            "weather": "sun",
            "playlistPlay": "dark-ambient-melodies"
        },
        "type": "action",
        "value": "So Rayane and Vinny were getting ready to leave the cave. The path is a long way across an open field surrounded by forests all around. A tremendous smoke could be seen in a long distance coming from a village a little far away. Some forests around were on fire, and smoke from explosions could be seen all around. Vinny was very surprised by everything he was seeing."
    },

    {
        "value": "Wooow... O..okay, wherever you go, I'll go too. If you go to hell I will too!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started following Rayane. During the progress Vinny tried to fight his worry. When Rayane noticed Vinny's behavior, Rayane looked a little worried at Vinny.",
        "type": "action"
    },

    {
        "value": "Vinny... Remember that this is not training. If someone attacks you, nobody won't pity you the way I did. Alright? We just need to check out the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to enter the forest slowly, following the trail of smoke. Vinny tried to remain confident.",
        "type": "action"
    },

    {
        "value": "Y..yes. This time I don't have my little pot with sand or dirt, but I have my wings and I know how to fly. You can be calm about me. I know how to take care of myself in more delicate situations like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried when she thought about Vinny's actions.",
        "type": "action"
    },

    {
        "value": "Everyone here can have one sword or firearms. Please, be really careful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried while using magic to wear herself the protective armor. Vinny was a little surprised to see Rayane's armor. But then Rayane looked into Vinny's eyes, feeling a little guilty.",
        "type": "action"
    },

    {
        "value": "N..no no... He really won't just follow me around if I try to take the safest path. If I try to change his trajectory, he'll find out.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "V..Vinny. I...I can't see you like this. You really need armor. But I only have one unicorn armor left. You won't be able to use your wings when you're wearing the armor.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious about Rayane's change in behavior.",
        "type": "action"
    },

    {
        "value": "What? Won't that bother you? Do you think it's safer for me to wear the unicorn armor?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhh, don't worry. It's my old armor that I used during my life before I got my current armor as a gift. Please take good care of this armor and stay safe. I don't want to see you being ripped in half.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets a little scared, but Rayane felt calmer when she used magic to start spawning the ancient armor on Vinny's Body kindly.",
        "type": "action"
    },

    {
        "value": "O...oh wow. Thanks Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled and hugged Rayane gently in response when he felt safer by the armor.",
        "type": "action"
    },

    {
        "value": "All right then! I am going to follow you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little more while hugging back. Rayane was feeling better and more comfortable seeing Vinny feel safe.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Take good care of the armor~ When we find a store, we'll buy a backpack similar to James's backpack. Then you will have less problems with weight on your back.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh! Yes charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {

        "value": "Rayane does a little giggles then slowly resumed walking to give Vinny time to get back into the rhythm of the adventure. Meanwhile, high above the clouds was Rainbow Queen and the mysterious unicorn. The mysterious unicorn was wearing a special boot for her paws to stay on top of the clouds. Rainbow Queen seemed to be watching all the conflict that was going on in the mysterious village. Rainbow Queen's gaze was very serious, she didn't seem to be satisfied with what was happening.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "War never changes. War is such a ridiculous thing. Are you seeing this? Two ponies trying to be heroes, such a ridiculous and absurd fantasy. Hiroshi will not have the mental balance for this war.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn would get a little scared.",
        "type": "action"
    },

    {
        "value": "B...But he said this time he was going to try something better. And the Elite Color was going to try to control the balance of the war.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh.",
        "type": "action"
    },

    {
        "value": "What? Elite Color? Do you still trust the Elite Color?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh. The mysterious unicorn then became a little more insecure and tried to respond in a more determined way.",
        "type": "action"
    },

    {
        "value": "Y..Yes. Elite Color has always been something very important to all of us! This dimension urgently needs to expand the energy! Our dimension will become a real strong dimension! Isn't that what you want?",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen took a deep breath and responded disappointedly. Rainbow Queen looked a little angry as she started to respond. The mysterious unicorn then walks backwards when realizing Rainbow Queen's anger.",
        "type": "action"
    },

    {
        "value": "We don't need to kill many ponies to get souls to sustain this dimension. And a war was the worst choice you all ever made.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn slowly gets a little more intimidated as she saw the Rainbow Queen's sinister gaze from the hatred.",
        "type": "action"
    },

    {
        "value": "S...sorry. I know you have empathy for souls. I'm sorry!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "When this war is over, I'm going to want to have a very private conversation with Hiroshi and Marlon. I hope Marlon doesn't get scared when he sees a divinity for the first time.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn gets very surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "Y..Really? Are you really going to do this? You've always said that it's dangerous for normal ponies to discover the identity of gods.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen did a sinister little smirk before replying while the scythe poked the mysterious unicorn's neck gently for a few seconds. The mysterious unicorn then \"froze\", just shyly looking into the Rainbow Queen's eyes.",
        "type": "action"
    },

    {
        "value": "Shhhh~ Do you really think everyone in this world will believe that someone has seen a goddess? This world still needs more maturity to understand the existence of gods. We don't want the same mistakes to happen again.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. This is true. T...The true.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Good~ Very good~ Then you are free again. You can go back to your \"fun\".",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": " Just don't forget. You still have a chance to do something better.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": "Meanwhile, Rayane and Vinny is walking through the forest. So Rayane would stop for a while to look carefully around if there was no one around.",
        "type": "action"
    },

    {
        "value": "Okay. I need to trust you that no one will show up while I use my magic again just like other time when we left the cave. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to remember the moment where Rayane was using this ability.",
        "type": "action"
    },

    {
        "value": "W...what? Do you want me to keep looking around?",
        "character": "Vinny",
        "type": "dialogue"
    }

]