[

    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 3,
            "weather": "sun",
            "playlistPlay": "dark-ambient-melodies"
        },
        "type": "action",
        "value": "So Rayane and Vinny were getting ready to leave the cave. The path is a long way across an open field surrounded by forests all around. A tremendous smoke could be seen in a long distance coming from a village a little far away. Some forests around were on fire, and smoke from explosions could be seen all around. Vinny was very surprised by everything he was seeing."
    },

    {
        "value": "Wooow... O..okay, wherever you go, I'll go too. If you go to hell I will too!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started following Rayane. During the progress Vinny tried to fight his worry. When Rayane noticed Vinny's behavior, Rayane looked a little worried at Vinny.",
        "type": "action"
    },

    {
        "value": "Vinny... Remember that this is not training. If someone attacks you, nobody won't pity you the way I did. Alright? We just need to check out the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to enter the forest slowly, following the trail of smoke. Vinny tried to remain confident.",
        "type": "action"
    },

    {
        "value": "Y..yes. This time I don't have my little pot with sand or dirt, but I have my wings and I know how to fly. You can be calm about me. I know how to take care of myself in more delicate situations like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried when she thought about Vinny's actions.",
        "type": "action"
    },

    {
        "value": "Everyone here can have one sword or firearms. Please, be really careful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried while using magic to wear herself the protective armor. Vinny was a little surprised to see Rayane's armor. But then Rayane looked into Vinny's eyes, feeling a little guilty.",
        "type": "action"
    },

    {
        "value": "N..no no... He really won't just follow me around if I try to take the safest path. If I try to change his trajectory, he'll find out.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "V..Vinny. I...I can't see you like this. You really need armor. But I only have one unicorn armor left. You won't be able to use your wings when you're wearing the armor.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious about Rayane's change in behavior.",
        "type": "action"
    },

    {
        "value": "What? Won't that bother you? Do you think it's safer for me to wear the unicorn armor?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhh, don't worry. It's my old armor that I used during my life before I got my current armor as a gift. Please take good care of this armor and stay safe. I don't want to see you being ripped in half.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets a little scared, but Rayane felt calmer when she used magic to start spawning the ancient armor on Vinny's Body kindly.",
        "type": "action"
    },

    {
        "value": "O...oh wow. Thanks Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled and hugged Rayane gently in response when he felt safer by the armor.",
        "type": "action"
    },

    {
        "value": "All right then! I am going to follow you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little more while hugging back. Rayane was feeling better and more comfortable seeing Vinny feel safe.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Take good care of the armor~ When we find a store, we'll buy a backpack similar to James's backpack. Then you will have less problems with weight on your back.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh! Yes charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {

        "value": "Rayane does a little giggles then slowly resumed walking to give Vinny time to get back into the rhythm of the adventure. Meanwhile, high above the clouds was Rainbow Queen and the mysterious unicorn. The mysterious unicorn was wearing a special boot for her paws to stay on top of the clouds. Rainbow Queen seemed to be watching all the conflict that was going on in the mysterious village. Rainbow Queen's gaze was very serious, she didn't seem to be satisfied with what was happening.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "War never changes. War is such a ridiculous thing. Are you seeing this? Two ponies trying to be heroes, such a ridiculous and absurd fantasy. Hiroshi will not have the mental balance for this war.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn would get a little scared.",
        "type": "action"
    },

    {
        "value": "B...But he said this time he was going to try something better. And the Elite Color was going to try to control the balance of the war.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh.",
        "type": "action"
    },

    {
        "value": "What? Elite Color? Do you still trust the Elite Color?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh. The mysterious unicorn then became a little more insecure and tried to respond in a more determined way.",
        "type": "action"
    },

    {
        "value": "Y..Yes. Elite Color has always been something very important to all of us! This dimension urgently needs to expand the energy! Our dimension will become a real strong dimension! Isn't that what you want?",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen took a deep breath and responded disappointedly. Rainbow Queen looked a little angry as she started to respond. The mysterious unicorn then walks backwards when realizing Rainbow Queen's anger.",
        "type": "action"
    },

    {
        "value": "We don't need to kill many ponies to get souls to sustain this dimension. And a war was the worst choice you all ever made.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn slowly gets a little more intimidated as she saw the Rainbow Queen's sinister gaze from the hatred.",
        "type": "action"
    },

    {
        "value": "S...sorry. I know you have empathy for souls. I'm sorry!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "When this war is over, I'm going to want to have a very private conversation with Hiroshi and Marlon. I hope Marlon doesn't get scared when he sees a divinity for the first time.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn gets very surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "Y..Really? Are you really going to do this? You've always said that it's dangerous for normal ponies to discover the identity of gods.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen did a sinister little smirk before replying while the scythe poked the mysterious unicorn's neck gently for a few seconds. The mysterious unicorn then \"froze\", just shyly looking into the Rainbow Queen's eyes.",
        "type": "action"
    },

    {
        "value": "Shhhh~ Do you really think everyone in this world will believe that someone has seen a goddess? This world still needs more maturity to understand the existence of gods. We don't want the same mistakes to happen again.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. This is true. T...The true.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Good~ Very good~ Then you are free again. You can go back to your \"fun\".",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": " Just don't forget. You still have a chance to do something better.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": "Meanwhile, Rayane and Vinny is walking through the forest. So Rayane would stop for a while to look carefully around if there was no one around.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "tense-mystery"
        },
        "value": "Okay. I need to trust you that no one will show up while I use my magic again just like other time when we left the cave. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to remember the moment where Rayane was using this ability.",
        "type": "action"
    },

    {
        "value": "W...what? Do you want me to keep looking around?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I'm vulnerable when I'm using this spell, will you help me look around. If something happens, let me know and I'll react.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane came back into concentration to perform the mysterious magic again. Then Rayane's mane would slightly start to swing during the progress.",
        "type": "action"
    },

    {
        "value": "O..okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny worried, but he worked hard to stay focused. Rayane was very focused on Vinny's reactions as a warning reference. But Vinny didn't realize that. So Vinny heard the noise of hooves moving around. Vinny and Rayane liten to the very small sound of someone groaning in pain. Vinny start to talk very quietly so as not to distract Rayane.",
        "type": "action"
    },

    {
        "value": "Yeah. I can hear someone groaning in pain.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was still concentrating on magic and was slowly finishing magic progress when she heard Vinny's voice. Vinny could just see a leaf finishing doing some movement that maybe could be suspicious.",
        "type": "action"
    },

    {
        "value": "Oh no. This is not good.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh... Looks like there are some ponies around. But I don't know if the ponies are allies or enemies.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little worried as she concentrated on looking around.",
        "type": "action"
    },

    {
        "value": "Y..yeah. I had a slight feeling that someone is here. Maybe this is a trap.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes yes. We must already be inside some possible trap. Don't worry about it.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane replies as she started to spawn the sword. Vinny's eyes widen in surprise as he realizes the situation is getting serious.",
        "type": "action"
    },

    {
        "value": "Oh shit.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was feeling nervous, but watched around waiting for something. Vinny and Rayane didn't see anything. Just hear the sound of some body being left on the ground. Rayane looked a little intimidating to try to show that she was focused on the danger.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "O..okay. I felt someone moving there.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny points toward the place where he had the sensation of someone moving. It was a place with a lot of tree leaf, making it difficult to see the place. Rayane laughed a little while her horn glowed a little stronger, making her sword go up in flames as she prepares the attack.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "battle"
        },
        "value": "Yes. But this is not the only place. But good tip for us to start the fun~ Use your wings to throw my fire around. Alright?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and just moved his face in agreement.",
        "type": "action"
    },

    {
        "value": "Ok ok.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took off his armor a little, just so the wings were free and prepared to fan in order to help Rayane's plan.",
        "type": "action"
    },

    {
        "value": "Ok. it's now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The sword rotated forward, throwing some of the fire's combustion towards the trees. Vinny was a little more surprised, and reacted without a second thought. Vinny leaned over and started flapping his wings enough until he realized that the fire generated by Rayane was taking the path. Then when the fire reached the place. Suddenly more trees was wiggling, revealing a surprise attack from all directions made by arrows.",
        "type": "action"
    },

    {
        "value": "Get down now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "WHAT THE FUCK IS THAT?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane pulled Vinny to the ground while the sword start to spin violently, making the sword change the direction of rotation to horizontal, hitting the arrows in sequence.",
        "type": "action"
    },

    {
        "value": "WHAT A CRAZY SWORD!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny rolls a little. So Vinny gets up and starts to beat his wings with a little more intensity. The fire began to expand in a circular shape in the form of a ring, starting to catch fire in the other trees around, making whoever was there start to move away.",
        "type": "action"
    },

    {
        "value": "Yeah! You're doing well! We need to have a plan to react now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's take advantage of them moving away. I'll fly up and you prepare a teleport in my direction.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at the armor during some seconds.",
        "type": "action"
    },

    {
        "value": "I won't need the armor for now. Everypony here probably have firearms.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "V..Vinny? Be careful! You are an easy target while flying up.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little worried and then stopped spinning her sword. Rayane was very focused, starting to charge the teleport. Vinny waited for the fire to disappear before start to fly up.",
        "type": "action"
    },

    {
        "value": "Don't worry. I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up getting ready to fly forward in order to follow the plan to surprise the ponies that were in the front. Vinny could escape the situation. And everyone hardly noticed his attempt to escape. Then at the same time Vinny landed, Rayane appeared next to Vinny, helping Vinny put the armor back on.",
        "type": "action"
    },

    {
        "value": "Wow! It really worked!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane feels satisfied with the result, did not think twice and made the sword go up in flames again, preparing to do the first action that comes to mind.",
        "type": "action"
    },

    {
        "value": "Yeah! Block the way with your sword! You can make a fire barrier!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Barrier? Heh, good idea~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane used the fire sword to rip the earth floor, making all the trees that were close start to catch fire.",
        "type": "action"
    },

    {
        "value": "Let's get out of here Vinny! We'll have time to run away now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane quickly started to run very fast in a straight line.",
        "type": "action"
    },

    {
        "value": "AAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny followed Rayane, trying hard to keep the same speed as Rayane. Suddenly a unicorn sniper pony that was behind a tree tried to shoot Vinny, the shot passed grazing Vinny a lot, and at the same time Rayane used the sword and cut the sniper barrel, surprising the sniper. Vinny was a little scared, but he tried to laugh at the danger to calm himself down.",
        "type": "action"
    },

    {
        "value": "W...WOOOW!! IIIHAAAAAAA! YOU NEED TO IMPROVE THAT SIGHT YOU BLIND!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...WHAT?! RAYANE?! AH! FUUUCK!",
        "character": "Sniper",
        "type": "dialogue"
    },

    {
        "value": "The sniper fall to the ground and end up. The pony stayed behind and disappeared over the horizon.",
        "type": "action"
    },

    {
        "value": "Heh. Your head was nearly blown off. Are we going to hide or enter the village by force?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's hide! if we go through this, James and Jeff will too, let's hide somewhere and make a better plan than going out screaming!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little curious and laughed a little and answered.",
        "type": "action"
    },

    {
        "value": "Okay. I'll have to do this on the hard way. Get on my back and hold on tight!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane for a few seconds, laughing a little.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny climbs on Rayane's back.",
        "type": "action"
    },

    {
        "value": "That's not how I wanted to climb on you for the first time but I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh. Be careful not to fall~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane increased her speed in a much more extreme way and used the trees as platforms to parkur on the trees.",
        "type": "action"
    },

    {
        "value": "WOOOW!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "When Rayane got to the top of the trees, Vinny accidentally fell off her, so Vinny had some chance of trying to hold on to the tree slacks during the progress",
        "type": "action"
    },

    {
        "value": "RAAAYANE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny holds the branch, doing a POKER FACE. Vinny soon felt a magic levitating his up, Rayane was balancing on the top of the tree, trying to bring Vinny back towards her.",
        "type": "action"
    },

    {
        "value": "Sorry Vinny. Let's get out of here!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Aah... Don't worry, it's dangerous for us to stop here. I'll fly to the village. You can try to find me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny stepped onto the top of the tree and got off Rayane's back slowly. Rayane gets worried during the talk.",
        "type": "action"
    },

    {
        "value": "Fly? Don't fly too high or everyone will see you. If something happens, shout it out loud. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "It's going to be okay, charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane just smiles a little, trying to trust Vinny. So Rayane went back to parkur between the trees towards the village.",
        "type": "action"
    },

    {
        "set": {
            "where": "Village ???"
        },
        "value": "Vinny smiles and flies up. Vinny flew at high speed, trying to keep a good distance away from being noticed. Vinny started to see some other pegasu flying in the sky towards the village, it looked like the pegasus was holding something medium sized black on his back. Vinny tried not to get too close to the pegasus, Vinny just stared at the pegasus for a few seconds.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "W...What? Is this another bomb?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny could see the smoke from the previous confusion. Then Vinny would hear a sound of ponies entering the forest. And at the same time Vinny also hear the sound of something falling from the sky. It looked like the mysterious pegasus had hurled the mysterious black object. Vinny tried to get a better look at what it was. So Vinny realized that yes, the item is a bomb.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "OH MY GOD! OH FUCK! OOH FUCK! NOO!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny came down from the tree but being careful to the ground and tried to look more at the crowd. Vinny saw several ponies that were running desperately. Vinny saw a few more soldier ponies familiar with the ones Vinny saw during the trap, but the soldiers weren't even caring about Vinny anymore. Vinny saw something that looked like Rayane towards the wall.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "escape"
        },
        "value": "OH NO NO NO! RAYANE!!! SHIT! RAYANE NEED YOU!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies toward Rayane desperately, but Vinny felt a magic pulling his quickly to the side of the wall.",
        "type": "action"
    },

    {
        "value": "Vinny! This is good see you again! What is happening?! I heard ponies screaming that the village is going to be completely destroyed!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looks scared by the situation, trying to understand what is happening. Vinny gets nervous as he began to respond.",
        "type": "action"
    },

    {
        "value": "M...Maybe the black bomb I saw falling from the sky is something? I saw black bomb falling in the middle of the city. Please, look for a military or someone you think is involved in the invasion. We'll force this pony to talk about the bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Bomb?! Are you crazy?! My teleport takes seconds to charge! This is madness! You don't know the destructive power of this bomb!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Calm down! Calm down! Rayane, I can fly to the bomb and look myself. I'll be fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "How do you say that if you haven't finished your first training?! VINNY! NOOOOO!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies over the wall. Vinny kept a high speed to try to reach the bomb as fast as possible. Vinny saw the bomb entering the center of the village. Vinny realized that all the destruction was more focused on the center of the village than all the rest of the village. Vinny was getting tired very fast from flying so fast, but Vinny was very dedicated to trying to use as few seconds as possible.",
        "type": "action"
    },

    {
        "value": "Come on! It's going to be easy! Imagine that we are playing CS! Come on Vinny!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny were feeling more and more tired. The center of the village was very much destroyed with a huge crater in the ground. The bomb was about to land in the center of the crater. Vinny then saw the bomb. The place was extremely insulated due to evacuation.",
        "type": "action"
    },

    {
        "value": "WOW! OK I understand. This explains a lot of the noises I heard in the cave.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny landed next to the bomb and try to analyze the stuff. The bomb was starting to pierce the ground. Vinny was desperate to see that the bomb was starting to disappear into the ground.",
        "type": "action"
    },

    {
        "value": "What the fuck is that?! No! COME BACK HERE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried in various ways to stop the bomb process. As the bomb sank deeper and deeper into the ground, Vinny thought about using the pickaxe piece, but couldn't find time to come up with a plan.",
        "type": "action"
    },

    {
        "value": "FUCK FUCK! FUUUUCK! I'm FUCKED! AH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up and start screaming loudly for help.",
        "type": "action"
    },

    {
        "value": "IS ANYONE HERE?!?! THIS PLACE IS GOING TO EXPLODE!! I CAN TAKE YOU OUT OF HERE!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny accidentally finds Rayane running in the middle of the village, looking for something. Vinny saw lots of pony bodies lying on the ground and some gun remains lying around, but Vinny couldn't be sure if the guns could be working or not. Vinny was scared and worried for a few seconds.",
        "type": "action"
    },

    {
        "value": "O..oh god. This looks a lot worse than I imagined. R..Rayane? Holy crap! Rayane!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to fly towards Rayane in an extremely desperate way.",
        "type": "action"
    },

    {
        "value": "RAAAYANE! The time is almost zero! if you have something it's now! The bomb already started digging down! if you have any plans it's now or never!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "NO! Calm down! I had a plan ready! Let's use the plan now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane showed a a mysterious military pegasus. The pegasus was desperate and tired.",
        "type": "action"
    },

    {
        "value": "Wow! You are really quick at your task.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane invaded a basement door of a random house and entered this quickly. Vinny without a second thought, helped carry the mysterious pegasus while following Rayane. Vinny was extremely scared and regretful.",
        "type": "action"
    },

    {
        "value": "Rayane! You can use your teleport. S..sorry. No matter what happens, it's my fault. I brought you here. Do your best!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath, trying to keep calm, and just gave a slight serious look.",
        "type": "action"
    },

    {
        "value": "Please Vinny. This is no time to be sorry. Pray for everything to be on time. I'm trying to make your plan work.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y...Yes...yes. S...sorry Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very worried and kept quiet. Vinny tried to keep all his hopes on Rayane. Rayane was very dedicated to keeping her focus on magic as much as possible during the progress.",
        "type": "action"
    },

    {
        "set": {
            "playEffect": { "file": "nuke-1", "enabled": true, "instant": true }
        },
        "value": "Sssssh~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "AH! AAAAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then suddenly all the sound around was interrupted by an extremely deafening explosion sound. Everything around was extremely bright, Vinny was trying to maintain consciousness while Rayane tried to protect him, but Vinny passed out in the process.",
        "type": "action"
    },

    {
        "set": {
            "playEffect": { "file": "nuke-1", "enabled": false }
        },
        "value": "R...Rayane? H...hello? R..Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny's ears were ringing very loudly. It looked like Vinny's hearing was finally starting to recover the ringing as he woke up. The flash was calming down, Vinny was on the ground next to many burnt objects around.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "dark-ambient-melodies"
        },
        "value": "Hello? R..Rayane? Somebody?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very scared, worried, trying to look for Rayane and the pegasus. A few minutes passed, but Vinny finally found Rayane, she was alive, but extremely weak.",
        "type": "action"
    },

    {
        "value": "N...Nooo! R..Rayane? RAYANE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny realized that Rayane tried to combine teleport magic at the last minute along with the force field. Rayane's horn was very damaged from the process. Next to Rayane was the mysterious pegasus that was still alive, but also passed out. Vinny vision was returning back more and more.",
        "type": "action"
    },

    {
        "value": "Hey, Rayane? Rayane, are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugged Rayane gently, trying to wake her up. Vinny was very worried that Rayane was slowly losing more energy and Rayane's smartmoby was starting to fail. But Vinny smiled when he saw that Rayane's eyes were moving.",
        "type": "action"
    },

    {
        "value": "V..Vinny? I... I'm fine. It's great to see you again.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to cought, trying not to breathe too much smoke from the explosion.",
        "type": "action"
    },

    {
        "value": "I... I had to use a lot of magic. I just need to rest.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to keep eyes open due to extreme tiredness while hugging Vinny back slowly. Vinny then helped Rayane to slowly close her eyes.",
        "type": "action"
    },

    {
        "value": "R..Rayane. Don't worry, you can rest here, I'll take care of you and the other one here. Stay here while I go check out what happened. Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little and just accepted to keep her eyes closed and fainted again slowly. Vinny put Rayane on the bed delicately. So Vinny looked around trying to know where he was. Vinny see a huge smoke blocking the sunlight. Everything looked darker and it was very windy. But Vinny realized that his were close to the village wall which was well damaged from the explosion. Vinny gets extremely surprised and very curious as he looked around again.",
        "type": "action"
    },

    {
        "value": "B..But how did I survive it? What really happened here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny would go back to the basement of the house. Vinny take the spray and use this on Rayane horn slowly. Vinny was still worried about Rayane. But Vinny tried to keep hopeful.",
        "type": "action"
    },

    {
        "set": {
            "playEffect": { "file": "nuke-1", "enabled": false }
        },
        "value": "R..Rayane. It's gonna be okay. I promise.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny wear the miner helmet and got up slowly, looking around again while breathing deeply, trying to find some new shelter. Vinny would only find many houses without roofs or with half roofs. So Vinny starts to see a extremely deeper new crater on the village center.",
        "type": "action"
    },

    {
        "value": "W..what? It's the same crater. Was this all an excavation?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny went back to the basement and look for some rags, clothes, or anything to hold the mysterious pegasus. Then Vinny smiled as he looked at an abandoned wardrobe, then he opened the wardrobe.",
        "type": "action"
    },

    {
        "value": "That was good luck.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny could only find cloths of possible clothes and some pieces of some firearm.",
        "type": "action"
    },

    {
        "value": "Hoho!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny picked up all the rags possible and the rest of the weapon, but focused on the rags. Then Vinny would go back to where the mysterious pegasus was. The mysterious pegasus was still unconscious. Vinny ties up the pegasus to make sure it doesn't escape.",
        "type": "action"
    },

    {
        "value": "Okay. I think that's enough for him not to hurt Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walked over metal pieces, wood scraps, and other burnt materials on the floor. Vinny finally came back to the surface again and looked up at the sky. Now the sky was a little more visible, and Vinny could see that there were still some fireballs that had flown into the sky, falling over some parts closer to the center of the village.",
        "type": "action"
    },

    {
        "value": "Oh god...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walked a little further through the destroyed village area. Vinny watched the dead bodies on the floor, trying to find any usable items. During each walk, Vinny felt uncomfortable seeing each dead body. Many of these bodies were slowly disintegrating. Vinny saw that instead of blood, the bodies had pixels coming out of the bodies.",
        "type": "action"
    },

    {
        "value": "Wow! If this was supposed to be some censorship, it's just getting more bizarre.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "After a few minutes, Vinny was in a place where there were few houses, as many houses were completely destroyed by the explosion. Vinny picked up as many clothes as possible from the corpses and made sure there wasn't any melee weapon nearby like a knife or a spear.",
        "type": "action"
    },

    {
        "value": "This place is very depressing. Where are all the survivors?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then decided to go back to the basement where Rayane was, and during the progress, Vinny saw some mysterious shadow of a possible pegasus in the place, but the mysterious new pony was head down and sad. Vinny was completely surprised and curious. And he slowly watched the situation.",
        "type": "action"
    },

    {
        "value": "O...Oh fuck! I just opened my mouth! Who is this time?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny then walked slowly towards the shadow, Vinny heard a female voice crying and lamenting a lot. This voice seemed to be sad, but very full of hatred for something.",
        "type": "action"
    },

    {
        "value": "N..no...it's not possible. These two ponies are annoying! They just make wars!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Wait. This voice. That voice is very familiar.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny had a slight strange sensation of feeling a small cold wind coming from the directions of the dead bodies on the ground. It seemed to be some energy, but unfortunately Vinny could only feel this, Vinny couldn't see this.",
        "type": "action"
    },

    {
        "value": "Oh? T...That feeling. This is getting a little scary. But I think I'm getting what's going on here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was a little scared, and just kept walking towards the voice. Vinny tries to see if Rayane was okay during the progress. Vinny walked carefully, very curious when he started to feel a light coming from the basement.",
        "type": "action"
    },

    {
        "value": "O..oh no.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny left clothes and knives outside before entering the basement slowly. Vinny could see a little more of the shadow forming in an alicorn shape. The shadow was very familiar. Then Vinny realizes it's Rainbow Queen. Rainbow Queen was trying to do something with Rayane.",
        "type": "action"
    },

    {
        "value": "W...what?! You again! Who are you?!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Shhhhhhh~ Calm down Rayane. I didn't expect to find you here. I promise to take revenge on whoever did all this to you.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen seemed to be crying a little and at the same time doing an extremely strong dark aura in the place.",
        "type": "action"
    },

    {
        "value": "N...No! Wait! Rayane and I were trying to defuse the bomb!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walks backwards slowly without making any suspicious moves.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked very serious and looked back, trying to preserve her identity through the glow of her body. But when Rainbow Queen recognized Vinny voice a little, she tried to make some contact.",
        "type": "action"
    },

    {
        "value": "Y...yeah! I was with Rayane during the whole time. Rayane is very tired because she tried to protect me during the explosion.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked towards him slowly, looking into Vinny eyes. Vinny see two rainbow glow eyes. Rainbow Queen was starting to suspect something.",
        "type": "action"
    },

    {
        "value": "You? The energy of your smartmoby is familiar. What are you doing here?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny saw that the Rainbow Queen face started to form tattoos on her face during the progress.",
        "type": "action"
    },

    {
        "value": "A..Ah. We were here protecting ourselves from the explosion. We caught someone involved in this attack, he's passed out. I don't want to do anything with you, I wanted to stay close to Rayane until she wakes up. I've been with Rayane for a long time and I've never done her any harm, you have to believe me. We can talk about it if you want. What can I do to make you believe in me?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen was staring at Vinny, looking like she was analyzing something during some seconds. Rainbow Queen was even more suspicious of Vinny's presence. ",
        "type": "action"
    },

    {
        "value": "Hmm... So you claim to be her friend? And you still want to dare me to believe you? You have a lot of courage. Challange me will be the worst thing you'll ever do in your life. Simple words won't be enough to convince someone like me.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very surprised to see Rainbow Queen's body filled with brightly colored elements, her egyptian looks, her accessories. But what I most made Vinny's surprised is that Rainbow Queen didn't have a smartmoby on her arm.",
        "type": "action"
    },

    {
        "value": "Doesn't she have this weird thing on her arm? What does that mean?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "I...I can prove this! I have pictures of her smiling with me. It never crossed my mind to challenge you, I don't even want to think about it.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little worried for a few seconds, but he didn't give up trying to stay determined.",
        "type": "action"
    },

    {
        "value": "I...I just want her to be okay, I can show you the pictures of us or you can wait for her to wake up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "Rainbow Queen showed an expression of more suspicion before making a small sinister laugh.",
        "type": "action"
    },

    {
        "value": "Photographs? You are so innocent. This means that you have privileged technology in this dimension. Photographs are not common in this dimension.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked very deeply into Vinny eyes, wanting to watch Vinny senses to try to see if Vinny were telling the truth in a very intimidating way.",
        "type": "action"
    },

    {
        "value": "It seems that you are hiding something from me. How am I supposed to trust that you have not manipulated these images?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised and anxious during the conversation. Vinny tried to calm down a bit before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "If you don't believe in me, that's fine, Rayane has this picture in an album. She seems to have a lot of love and extreme affection in her photo album.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny calmed down a little more, breathing deeply to try to continue talking more calmly.",
        "type": "action"
    },

    {
        "value": "See I don't want to do any harm. You and me want the same thing now. I want try to help Rayane. Rayane is having nightmares now that she can't wake up. She didn't say anything about her past. Something tells me that you like Rayane a lot.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen made a slight smile a little evil when listening to Vinny's words.",
        "type": "action"
    },

    {
        "value": "How interesting. Is Rayane trying to make some kind of new friendship? I think this guy is going to need a special ritual for me to show him who he's dealing with. He seems to be more innocent than a dangerous pony.",
        "character": "Rainbow Queen",
        "type": "think"
    },

    {
        "value": "Hmmmm. I appreciate your courage in your words. You will have your little chance to see me walk away without bad things happening to you. You were too cowardly to just throw a little stone next to me.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to hear that. But he tried to keep quiet to continue listening to the conversation.",
        "type": "action"
    },

    {
        "value": "Really very interesting. I'm understanding what's really going on here. This pony is really very silly. It's going to be fun tormenting this guy's life until he learns a lesson.",
        "character": "Rainbow Queen",
        "type": "think"
    },

    {
        "value": "Heh~ If you really want to have my trust, then I'll wait for Rayane to say that to me. Now if you make a wrong move...",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen gave a sinister little laugh as she ended the words in a sinister and seductive way.",
        "type": "action"
    },

    {
        "value": "You're going to have some serious problems with me~",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Then Rainbow Queen used horn magic and levitated a long shiny scythe, and then used the scythe to finish levitating something around her, but Vinny just couldn't see it. Vinny was much more surprised, watching the scythe, trying to understand what kind of pony Rainbow Queen is.",
        "type": "action"
    },

    {
        "value": "W...What?! But what the fuck is this?!",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Weeeell... About the cave. This was Rayane who diminished the strength of my smartmoby. I understand you don't believe me right away, it's okay. But Rayane is in great need of help now. I can stay here until she wakes up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked a little more serious and does a movement with the scythe, bring Vinny's face closer.",
        "type": "action"
    },

    {
        "value": "Ssssh... Don't try to take advantage of my emotional weakness. Many souls needs me now~",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "When the Rainbow Queen's scythe disappeared, Vinny accidentally lost his balance and fell to the ground.",
        "type": "action"
    },

    {
        "value": "And stay well out from PROBLEMS.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen simply made a huge glow and disappeared through a teleportation spell. Vinny was still surprised and confused. But he was slowly calming down again.",
        "type": "action"
    },

    {
        "value": "W...what? Does she also know how to disappear?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "dark-and-mysterious-ambient"
        },
        "value": "When the silence finally returned. Vinny noticed that now Rayane's horn was no longer damaged as it was a few minutes ago. But Rayane was still fainting and resting.",
        "type": "action"
    },

    {
        "value": "W...Wow?! Rayane?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very curious trying to understand what was going on. When Vinny noticed that Rayane was feeling better, Vinny tried to look where the mysterious pegasus was. Pegasus was still passed out on the ground.",
        "type": "action"
    },

    {
        "value": "Ohh... the pegasus is here too.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Vinny looked worriedly at Rayane, going to analyze if Rayane was well.",
        "type": "action"
    },

    {
        "value": "R..Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised and feeling better to feel that Rayane was breathing better than before. Vinny rearranged the blanket to keep Rayane warm gently.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled for a few seconds before going to see if the pegasus was still passed out.",
        "type": "action"
    },

    {
        "value": "Time to see this suspect.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was thinking about getting the cloth and knife right away. The wind that was occurring, making Vinny feel a little cooler.",
        "type": "action"
    },

    {
        "value": "Why? Well that crazy pony could have stayed here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny took all the rags and the knife, reinforcing the bindings on the paws, wings. Vinny finished the last progress covering the mysterious pegasus's eyes.",
        "type": "action"
    },

    {
        "value": "Hmmmm. Good.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "The pegasus was still unconscious. The smoke and dust that was getting lower slowly. Vinny was starting to get worried as he noticed that the environment was getting cleaner to see.",
        "type": "action"
    },

    {
        "value": "Good. Good. This will have to be done very quickly.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Meanwhile, Rayane's horn was slightly finishing regenerating as her body started to breathe normally again, but she was still passed out. Vinny looked at Rayane again, doing Vinny feel much better and calmer.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe a little time.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value":"Vinny would place the pegasus's body next to the wall and then go back to Rayane.",
        "type": "action"
    },

    {
        "value": "Hey... My little baby? Wake up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny pokes Rayane very lightly.",
        "type": "action"
    },

    {
        "value": "Can you hear me? Is everything okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was shaking Rayane's body very gently. Rayane starts to touch a little, trying to wake up. Rayane was slightly trying to open her eyes.",
        "type": "action"
    },

    {
        "value": "H..huh? Rain? Is it you again?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very confused because I still hadn't fully regained consciousness. Vinny would get curious and then just continue the conversation.",
        "type": "action"
    },

    {
        "value": "Calm down. Calm down... I'm here, it's okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugs Rayane very tightly. Trying to do her feel really comfortable.",
        "type": "action"
    },

    {
        "value": "R..Rain? You really came back...? I...i...",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane slightly opened her eyes and finally realized Vinny presence.",
        "type": "action"
    },

    {
        "value": "A...Aaah? V...Vinny?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very surprised for a few seconds. Rayane blushed a little with embarrassment, but then continued the conversation.",
        "type": "action"
    },

    {
        "value": "You're alive. I thought my force field had failed.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane cries while hugging Vinny back. Rayane was very relieved to see that Vinny was okay. The hug was very comforting. Vinny smiled a little and just continued the hug.",
        "type": "action"
    },

    {
        "value": "Yes, I'm fine. I never leave your side, I've been here all along. You were VERY bad... How are you feeling now?",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "I...I'm feeling so much better, I'm surprised I'm alive too. Meeting you was one of the best decisions I ever made. I...I was very exhausted. I thought I was going to die. My magic felt like it was almost gone. Wh...what did you do to save my life?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane ended the hug while continuing to smile gently. Vinny was very thoughtful about whether to choose to tell the truth or not at this point.",
        "type": "action"
    },

    {
        "value": "I... I used my spray and stayed by your side the whole time. But first we have to settle something, then I need to talk to you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Ah? A spray? Are you sure it was just a spray? Didn't you use any special healing items? I... I was almost dying from lack of magic in my body.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was surprised for a few seconds, thinking it was something important, but then she calmed down to see Vinny pointing to the hostage.",
        "type": "action"
    },

    {
        "value": "What do you want to do? Do you want to try something first or not?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "T...The hostage? I'm still tired. I need to finish resting. But if you're feeling well. Try to find out who's responsible for all this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane coughed again as she lay back on the bed again.",
        "type": "action"
    },

    {
        "value": "Well... Just promise not to be scared?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets very curious to hear this",
        "type": "action"
    },

    {
        "value": "Scared? What are you talking about?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "I'm going to act on the pegasus.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny turns his back and walked to the pegasus on the floor. Rayane just remained curious, trying to understand what would happen.",
        "type": "action"
    },

    {
        "value": "Hey wake up. Waaaaake up!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny starts to shake the pegasus head. The pegasus gets startled and desperately tried to move.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "suspenseful-ambient"
        },
        "value": "H...huh?! WHAT?! Where am I?! And...didn't I die?!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Calm down! You didn't die and you won't die if it depends on you. I just need you to say a few things. You need to explain what happened and why this one dropped a bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The pegasus gets more confused when his realized that his was not seeing anything.",
        "type": "action"
    },

    {
        "value": "Wh... what? E..Elite Color?! N...No! Please! Don't turn off my smartmoby! I don't want to have this end! And..I swear it was just a blast bomb!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The pegasus was even more desperate trying to move and trying to get away. Vinny spoke close to the pegasus ear, pulling this up.",
        "type": "action"
    },

    {
        "value": "Hey! Don't lie to me motherfucker!! Say what else and I release you!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "O..oh god.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "CALM DOWN! I don't know anything else! I just oriented the coordinates! The only thing I knew was to be more careful with the last bomb! I just want to go home! I swear the explosion couldn't have been too strong!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The pegasus moved more desperately, trying to move in the opposite direction in response. Vinny then started talking a little lower in a very threatening way.",
        "type": "action"
    },

    {
        "value": "What? Tell me something I don't know. Where is your house, do you have family? I've been out there and seen some things. if you say something that doesn't lead with what I saw out there I'll cut your wings into little slices until you say more.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny pulls the pegasus ear harder during the progress.",
        "type": "action"
    },

    {
        "value": "Nobody wants to stay here boy, tell us what you want and I'll disappear and you'll be released. Nobody needs to know that we had this conversation.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "M..my wings?! You are crazy?! My life depends on them! YES! I have family! Everyone is waiting for me to come home! I'm just a coordinate helper! We were just trying to open a secret passage! Just that! We didn't want to hurt anyone!! STOP!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Yeah. A lot of ponies died here with this bomb! Who do you work for?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was very surprised, not understanding very well what was happening.",
        "type": "action"
    },

    {
        "value": "P..Ponies?! But the bomb wasn't even that strong! I...Impossible!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was extremely scared to hear this.",
        "type": "action"
    },

    {
        "value": "I'm just a military man from the East region. I just follow orders from my superiors. Just that! Our leader just wants to have the magic relic back! This is just my job!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised to hear this answer.",
        "type": "action"
    },

    {
        "value": "Ah? What's your leader's name? and why did he want to explode this bomb?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...we just wanted to open the secret passage! The secret underground passage that must be near you now. Wait... Don't you know my leader's name? Everyone knows his name.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious to see the mysterious pegasus very confused during the question.",
        "type": "action"
    },

    {
        "value": "Fine... Say his name and yours. I want to hear from you, if you lie on something I will clip your wings. I want to see if I can trust you. I know exactly what your boss is, I want to know if you're really going to tell the truth.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was very worried and tried to respond as quickly as possible.",
        "type": "action"
    },

    {
        "value": "No..no! His name is Marlon! Only that! MARLON! No secrets here! I just want to leave!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "And your name? Your name! Speaks your name too!",
        "character": "Vinny",
        "type": "dialogue"
    },
    {
        "value": "I already told! Marlon! Everyone at Pony Driland knows it's Marlon! P...Please stop!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Marlon is the fuck! YOUR NAME! I want to know your name! If it takes time we will leave you here without wings and with the elite color coming here!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny puts the tip of the knife on the upper part of the wings but without piercing.",
        "type": "action"
    },

    {
        "value": "N...NO NO NOOO! STOP! I speak! I speak! Just please stop! I just want to be a little calmer!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pony began to wail, asking for much mercy during the conversation. During this process, Vinny looks for an item on his body looking for anything suspicious. Vinny only find a small device used to guide the bomb's trajectory and a wing helper device hidden behind his wing clothes.",
        "type": "action"
    },

    {
        "value": "Hey... Come on, if you don't speak your name now I'll cut off a piece of your wing and put it in your mouth!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny press the knife harder against the wings only to provoke the mysterious pegasus.",
        "type": "action"
    },

    {
        "value": "N..NOOOOOO! Stop stop!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was trying to get away during some seconds.",
        "type": "action"
    },

    {
        "value": "M..My name is Wagner! WAGNER!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny was feeling better to hear Wagner's name. So Vinny continued to focus on the conversation.",
        "type": "action"
    },

    {
        "value": "Okay Wagner. who are the ponies that went to the crater? The bomb exploded there. No other pony has come here to see the crater yet.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny slowly withdrew the knife and give the pegasus more freedom. The mysterious pegasus slowly calmed down a bit more and continued to respond.",
        "type": "action"
    },


    {
        "value": "W..What. T... The pony is Marlon and his army. Marlon just came to take the relic. Only that. Marlon don't want to hurt anyone else!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Marlon? Marlon is a unicorn?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. My only obvious certainty is that Marlon is obviously the unicorn of the group.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Group? Hm. I don't think that's quite what's happening right now. There are no souls alive around here now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny picks up Wagner items and then went to Rayane slowly.",
        "type": "action"
    },

    {
        "value": "Please. Just be quiet.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane just agreed, keeping as quiet as possible so her voice wouldn't be heard while she was surprised by the conversation with Wagner.",
        "type": "action"
    },

    {
        "value": "What are you talking about? And what do you mean no living soul? T...This is wrong! It was a midsize bomb! IMPOSSIBLE!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner Gets scared, trying not to believe the possibilities of what happened. Vinny then returned to Rayane for a few seconds.",
        "type": "action"
    },

    {
        "value": "Well... Do you think it's suspicious?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny shows the items that the mysterious pegasus had. Rayane was very curious and thoughtful when observing the items. Rayane analyzes the items for a few seconds before responding.",
        "type": "action"
    },

    {
        "value": "Okay. Wagner probably won't talk about everything he's doing.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah. Please, you need to analyze a little. Outside I saw some pegasus going to the crater before the explosion.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Pegasus? Are we still in the blast zone? Hmmmm. All right.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny delivered the items to Rayane. Then Vinny walked towards the pegasus again.",
        "type": "action"
    },

    {
        "value": "Okay Wagner. Why did you want to do this work?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..Work? Well...",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was a little scared during the progress.",
        "type": "action"
    },

    {
        "value": "I...I just work to protect the east region. But I also like to enjoy and my adventure. It's all I can do for my life.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Do you like to protect by dropping bulldozer bombs on villages with innocent ponies in this? A village that had many families and in addition to having a confrontation? I'm believing in you. I just want you to help me understand why your group really blew up this bomb. No one goes around blowing up villages and killing ponies for magic items for nothing.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner showed nervousness as he was trying to understand Vinny's words. Wagner looked a little confused as to what was being talked about.",
        "type": "action"
    },

    {
        "value": "So please. Tell me if you know what your friends' next step is.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "B..but everypony was going to wait for the village to be evacuated! Someone promised me that they would do their best to evacuate the village as soon as possible! You talking like that sounds like it was a giant explosion! We just wanted to access the center of the village! Marlon just wanted to open the secret tunnel!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Tears started to come out from Wagner eyes when his started to lose the emotional balance of the situation.",
        "type": "action"
    },

    {
        "value": "So tell me about your family, do you live with your family? what do you tell me about your family? it was really a very strong bomb! There were many bodies scattered on the floor! Or what was left of the ponies body. How is your family? Why did you say that I could erase your Smartmoby?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was even more surprised and began to understand that the dialogue didn't sound much like an Elite Color conversation. But still Wagner was scared, Wagner was too scared to know what really happened.",
        "type": "action"
    },

    {
        "value": "B...But how can I trust you about my family's life? This is not true! Stop talking nonsense! I wouldn't let a military team drop a very destructive bomb!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Then Wagner was confused for a few seconds. Wagner kept trying to understand if Vinny is really an Elite Color member or not. Wagner was still very emotional and stuttered as he tried to understand what was really going on.",
        "type": "action"
    },

    {
        "value": "W..What? Do you then do not know how to turn off a smartmoby?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "You won't say anything? Okay...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Vinny held Wagner by the wings and pulled Wagner as Vinny walked up the stairs, they took the blindfold off their eyes.",
        "type": "action"
    },

    {
        "value": "Hey! But what the fuck is this?! Help!! I'd rather die than let you do something with my family! Let me go NOW!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "So Vinny took the blindfold off Wagner eyes slowly.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "nuclear-winter"
        },
        "value": "Okay Wagner. This doesn't look like a child's firecracker.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Let me go!! Let me... O...oh....WHAT?! WHAT HAPPENED HERE?!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was extremely scared and impressed. Wagner was beginning to feel extremely nervous, trying not to believe what he was seeing.",
        "type": "action"
    },

    {
        "value": "Yeaah. This is what your firecracker did. Look at the rest of bodies on the floor. Can you give me one good reason why I shouldn't leave you here? You can really say something you know and I don't, or you can just end up like them. The pony you work for did this! If you're alive or not, it would be good until you're dead for them to keep anyone from knowing about it!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a few deep breaths then Vinny looked at the crater for a few seconds.",
        "type": "action"
    },

    {
        "value": "Did you enjoy participating in a slaughter? Could be your family in these bodies.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was starting to feel sick when he saw the whole situation. He was trying not to pass out due to extreme nervousness about understanding what was going on.",
        "type": "action"
    },

    {
        "value": "No..no! This...this can't be true! I never knew we had a bomb like this! H..How does Marlon do something like this?! He's never done anything like this! W...What monster is this?!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was extremely terrified, trying to control himself emotionally, he seemed much more scared than usual.",
        "type": "action"
    },

    {
        "value": "Wagner, let's try again, no threats, no blindfolds. why would Marlon do that? Did someone cheat on him? You know something and you don't want to tell me? Just remembering that I came to stop the bomb with my hooves, but I couldn't. I came face to face with the bomb. Why would anyone want this city destroyed?? Do you have anything else? Revenge? Something of greater value in the underground?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was slowly starting to feel weak during the conversation due to extreme nervousness.",
        "type": "action"
    },

    {
        "value": "I don't know anything. Marlon was just talking to me a lot about a prophecy! We needed to help the East region at all costs! Our only goal has always the magical relic as we have done for generations!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was getting more and more traumatized and very shaken by the situation. Vinny was a little surprised and confused, and asked the question.",
        "type": "action"
    },

    {
        "value": "What? Tell me about this prefect, what is this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The prophecy of the great drought of the eastern region. O...Our world is slowly dying. This magical relic is our only hope for us to live for a few more generations. B..But the West region....c...built... a bunker.....u..a bunker for....for.......p...protect the relic.....",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner? WAGNER! No! it's ok, you don't have to try, I'll put that blindfold over your eyes again, don't worry, nothing will happen to you. I just need you to trust me enough for you not to see anything.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N...no.........the....the explosion........the....the prophecy........of.. .....R....Rainbow.........R...Raaaaainbow....",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner lost the balance and passed out on the floor. Wagner no longer showed any reaction and his body remained on the ground. But Wagner's smartmoby kept showing that he was still alive.",
        "type": "action"
    },

    {
        "value": "OH MY LUNA!! Because every adult is a child here!! FUCK!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Vinny would then put Wagner back in the basement of the house. The blindfold was placed over Wagner's eyes again. Wagner was kept away from Rayane for security reasons. Then Vinny looked at Rayane and nudged her gently.",
        "type": "action"
    },
    
    {
        "value": "Rayane? Rayane. Please wake up. I need to have a conversation with you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane seemed to be concentrating on some thought. So she was a little surprised to hear Vinny's voice, but she tried to stay calm as much as possible.",
        "type": "action"
    },

    {
        "value": "Huh? Vinny? Talk about what?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Did you hear our conversation?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "bad-think"
        },
        "value": "M..Me? I've heard many parts from the talk. I'm really worried about what happened out there. All I've seen so far is just this basement.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane seemed to show a more worried look than usual.",
        "type": "action"
    },

    {
        "value": "Hmm... How many alicorns do you know? The weather outside is sad, bodies scattered, houses and more houses destroyed. But do you know anything about alicorns?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was confused and even more surprised to hear this.",
        "type": "action"
    },
    
    {
        "value": "A..Alicorn? The forest still exists?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah, your friend in the cave seemed angry or irritated, I'm starting to put the puzzles together. Do you only know her?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to control her nervousness as she answered.",
        "type": "action"
    },

    {
        "value": "M..my friend?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little more insecure of the conversation.",
        "type": "action"
    },

    {
        "value": "Vinny. There is only one alicorn in Pony Driland.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay. Who was in the cave wasn't an alicorn?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. The unicorn was wearing a black outfit.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "And you only know her right?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N..no. There is only one alicorn.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a deep breath and then said.",
        "type": "action"
    },

    {
        "value": "Okay okay. I thought there were several like in my world, where people had MANY different gods. But going back to the beginning of the conversation I actually used a spray on you, and you got better right away. Don't you think it's weird a simple spray to do this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was slowly beginning to understand what was happening, and it made her feel more insecure.",
        "type": "action"
    },

    {
        "value": "B..but that was my question. I thought you knew the answer to answer me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hmmm... I just used the spray.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Wagner for a few seconds. Wagner was on the floor passed out without doing any movement.",
        "type": "action"
    },

    {
        "value": "I had a little surprise when you was almost dying. Heh! Look on the good side, this time it didn't even cross my mind to kiss an alicorn again. This alicorn knew everything about you and almost even how many kisses you've already given in life.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wh... what?! I...Impossible! A...Are you serious?! We've had a lot of disagreements lately!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very surprised, trying to understand what was happening.",
        "type": "action"
    },

    {
        "value": "Yeah. She didn't get well with my presence and with me saying that you were very close to me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny sits on the floor, doing a facehoof.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Well she had magic just like yours, but instead of a sword, it was a scythe and when she got really upset to see you in critical condition, some black stuff started to come out too. This one really seemed to care a lot about you. It just doesn't seem to care about me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane then became quiet and tears began to come out of her eyes. She prepared to continue the conversation.",
        "type": "action"
    },
    
    {    
        "set": {
            "playlistPlay": "sad"
        },
        "value": "M...Nagic like me? Did you say scythe? I've never seen magic scythes. I knew about her magic getting dark. But I've never seen this mysterious scythe.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ah? Why the concern? She said that my energy is strange. She said that she had many souls waiting for her. What do you want to do now? We can't forget about James and Jeff.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "She...she's getting weirder with each passing day by this dark energy. Don't worry about souls. This sounds strange, but she really loves take care of souls. She likes to take care of dead ponies.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious and at the same time surprised to hear Rayane's words.",
        "type": "action"
    },

    {
        "value": "Okay... and that alicorn didn't have a smartmoby.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Smartmoby? Yes. She never had a smartmoby. This is a great curiosity for me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to hold back a little more tears as I thought about what could be happening.",
        "type": "action"
    },
    
    {
        "value": "Yeah. it seems that everyone, when so close to me, the past comes to haunt",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "H..haunt? What do you mean by that?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane stopped crying a little and looked at Vinny curiously.",
        "type": "action"
    },

    {
        "value": "I mean that the past comes back to settle the bills.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "B...but she's going crazy! She is increasingly losing her mind! I tried to help her in many ways! But she is much more paranoid about the past than I am!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to hide her face a little while crying again. Vinny analyzed Rayane's behavior and was even more surprised before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "Hey... calm down. Caring for the dying ponies, every moment really must be depressing. But calm down, we'll fix this, she still likes you, that's a good thing.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "She always liked taking care of the dead. I never imagined that she would forgive my life after so many things had happened. But I have no hope that she will ever want my help again. She always gets very angry when I try do something to make her feel better.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little more surprised and even more curious to find out what was going on.",
        "type": "action"
    },

    {
        "value": "What exactly do you want to do with her?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I want to try to help her find some much less brutal alternative to saving Pony Driland. That's all. She just wants to save Pony Driland. But she is increasingly losing her mind trying to do this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to find some acceptance of what was happening. Rayane slowly began to calm down. Vinny took a deep breath and hugged Rayane for a few seconds until she calmed down.",
        "type": "action"
    },

    {
        "value": "Don't worry. We'll find an alternative. I've had many friends, and the kind of concern by your horn was a true friendship. Everything will be ok. How are you feeling? Can you walk? Do you want to go outside with me so you can see how you are?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I should have a little more hope that there is still the old Rain I knew.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rain? Does she have a nickname? Interesting.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Rayane lifted his head a little, trying to have some optimism while wiping her eyes.",
        "type": "action"
    },

    {
        "value": "I'm feeling better. My legs still hurt a little. I just need a rest. But I can walk until we meet the others.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well... if exist deities in this world, are there other deities too? Or souls, or spirits, angels, demons, gods or something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was curious about Vinny's words.",
        "type": "action"
    },

    {
        "value": "Y..Yes. The Master smartmoby is the highest deity in this world. But it's been a long time since te Master smartmoby disappeared. I never knew who used this by the last time.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh. Alicorns and I have an interesting chemistry. I need to turn into a alicorn, maybe we won't get more intimate. I'm laughing so I don't cry in a figurative logical way.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Rayane laughed a little because of Vinny's silliness. Rayane responded with a little nervousness.",
        "type": "action"
    },

    {
        "value": "You won't like having her around if you see someone breaking a promise with her.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Rayane found a piece of broken mirror on the floor and used the magic to see how her face was. Rayane gets a little startled when she saw the mysterious dark tattoos on her face, but the tattos were already disappearing again because she felt calmer again.",
        "type": "action"
    },

    {
        "value": "W...What?!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah, your friend also had the same tattoos on her face.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "O..Okay okay. I also saw the tattoos when we were in the cave. But... but what is this?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised to hear that. So Vinny responded calmly.",
        "type": "action"
    },

    {
        "value": "I thought you really knew.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "No.... I have no idea what's happening now. We need to get out of here before someone unknown appears. I'm getting worried if something happened to James.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to try to get up to start walking again.",
        "type": "action"
    },

    {
        "value": "Well... What are we going to do with our supposedly innocent hostage?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked curiously at Wagner for a few seconds.",
        "type": "action"
    },

    {
        "value": "Leave him somewhere safe. He has already suffered a lot while being questioned.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little tired, but she kept walking towards the basement exit.",
        "type": "action"
    },

    {
        "value": "Ah? Safe place? Where?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane stopped and looked around for a few seconds until she saw her abandoned mattress on the floor. Then Rayane uses her magic to store the new items in her inventory.",
        "type": "action"
    },

    {
        "value": "Use my bed. I'm sure he will feel better.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Are you sure? Don't you want to try to wake him up?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little sad for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "He won't wake up so early in the same way. He just passed out from a panic attack. It will take time for his body to calm down and he can wake up again.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny felt extremely confused, thinking about something for a few seconds.",
        "type": "action"
    },
    
    {
        "value": "GOD! Why are males like children and females are more... \"brute\"? All the females I've met are crazy. Kenny's wife was even crazier.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "While talking, Vinny placed Wagner on the mattress gently.",
        "type": "action"
    },

    {
        "value": "And his items... I don't feel like taking what's his, is there anything useful you can take us? Maybe James can't touch that remote control device to know if there's another one like this pegasus.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane laughed a little before answering.",
        "type": "action"
    },

    {
        "value": "This must be a coincidence. We just left the south region where normally everyone is much more peaceful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane analyzed Wagner items for a few seconds during the progress.",
        "type": "action"
    },

    {
        "value": "We'll have to take his items whether we like it or not. If we don't, other ponies will possibly steal from him.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and agreed.",
        "type": "action"
    },

    {
        "value": "Okay, I hope so. Will you go back to James or do you want to go to the crater?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Don't worry. We can find him later.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The Rayane horn's magic glowed for a few seconds, focusing on Wagner's smartmoby. Then Rayane would make a small smile of satisfaction before returning to talk to Vinny. Vinny was still surprised, but he still smiled and started to thank Rayane.",
        "type": "action"
    },

    {
        "value": "What? Well... We are where the bomb exploded, by the way, thank you very much! The whole plan went wrong and you still went there and almost died to protect me. Thank you very much!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ You're welcome. So let's go. The mysterious crater awaits us.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane feel better for the thanks, she smiled a little and just prepared to continue the adventure. But then Vinny suddenly boops Rayane. Rayane gets a little surprised by the boop, blushing a little.",
        "type": "action"
    },

    {
        "value": "H..huh?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wow. How cute, you blushed, are you ashamed that I booped you? What is this magic you used on Wagner?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gave a light laugh before doing a smirk back, booping Vinny back.",
        "type": "action"
    },
    
    {
        "value": "Silly you~ I just used a spell on his smartmoby so I could locate him later. But don't forget, this magic is temporary.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Heh. Well... are you ready to see what's left of the small village?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny slowly gets more serious during the talk. Rayane was then worried and very curious to hear about it.",
        "type": "action"
    },

    {
        "value": "W...what? What do you mean about it?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well, it's a small village, a bomb dropped, I thought you were thinking that the damage was not small, by the way you saw the poor pegasus fainting.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The... the village? The village we were in?!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "nuclear-winter"
        },
        "value": "Rayane left the door. Rayane is extremely surprised to see the village completely destroyed.",
        "type": "action"
    },

    {
        "value": "M...my god... N....No! This is not true!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well... we need to leave here, I think in this world there must be something like Radiation too. You want to use your magic to know if there was a pony around?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..What? Radiation? What's this?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane kept looking around, trying to find someone for a few seconds.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe we can find a way out. But first I need to analyze the crater.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was starting to feel sad due to the completely destroyed place. Rayane didn't know what she could say to Jeff. So Rayane closed her eyes and began to concentrate the magic to look for some pony presence.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious to look at Rayane. Vinny tries to see if anyone was around. But Vinny only found more dead bodies, no life.",
        "type": "action"
    },

    {
        "value": "T..this a macabre place.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Okay. It looks like the survivors are on the other side of the destroyed wall. The forest is probably alive. But it's very strange that I have a feeling presence of ponies in the center of the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane became a little more serious and worried, watching the center of the village.",
        "type": "action"
    },

    {
        "value": "Yes, Wagner said someone wanted to get a magic item here. I guess there was some betrayal and some organization must now be going to get the item.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was surprised to hear Vinny words, so Rayane understood what was really happening.",
        "type": "action"
    },

    {
        "value": "What? The magic item? N..no! The magic item!! The magic relic! This is going to become a huge war problem!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to force herself to run, but she got tired and one of her legs made her lose her balance.",
        "type": "action"
    },

    {
        "value": "AAAH!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hey hey! Calm down! Calm down! Why this hustle of nowhere?",
        "character": "Vinny",
        "type": "dialogue"
    },

    
    {
        "value": "if this item is stolen by someone mysterious. Both the east and west region will be destroyed!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to force herself up, trying not to get too distracted by the hurts. Vinny gets worried about the Rayane's reaction.",
        "type": "action"
    },

    {
        "value": "Rayane... Calm down. And the prophecy?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The prophecy? R..Rain created this prophecy just as a warning. She knows that a discord between the two regions will be total destruction.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wow...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face during some seconds.",
        "type": "action"
    },

    {
        "value": "Well... I had an idea.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "I will try in my gallant way to borrow the magic item there, and you go get James and Jeff. Jeff must have more influence here. What do you think? I'll be fine alone.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N..No! I'm not sure if I'll be able to use the teleport spell now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane sits on the floor, trying to get some rest again. Vinny was curious to see Rayane's determination.",
        "type": "action"
    },

    {
        "value": "Okay... My idea was a bad idea. Do you have a better idea? We have 2 options, go after the magic item, or go get James. You have influence here too.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was extremely thoughtful and spoke with a bit of nervousness.",
        "type": "action"
    },

    {
        "value": "Weeeeeell... Can your grim reaper friend help us?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath and responded calmly and a little depressed.",
        "type": "action"
    },

    {
        "value": "First, we need to have her trust. But this is going to be an extremely hard task. I've been trying to do this for a long time. We don't have much time now. Now that the entire village is all destroyed, we'll probably find James here again on sometime.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay. So you don't have his location? ",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was curious about Vinny's behavior.",
        "type": "action"
    },

    {
        "value": "Unfortunately not. My only way to locate someone is through the magic.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay. So I can try to fly up and see if I see someone walking towards us.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane seemed to like the idea, so she smiled a little.",
        "type": "action"
    },

    {
        "value": "Fly up? Seems like a good idea.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ok, I'll go up a bit. You can try to wake Wagner, we'll need Wagner if his friends are here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets confused by Vinny's ideas.",
        "type": "action"
    },

    {
        "value": "Vinny... Wagner just passed out. You forgot?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny made a nervous smile and just answered.",
        "type": "action"
    },

    {
        "value": "A...aaaahh... Don't worry, if he doesn't wake up, you can try to throw some water on him or something. It's okay for him not to wake up. We just have to try.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "What?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny just tried to forget about the awkward moment and started flying upwards.",
        "type": "action"
    },

    {
        "value": "FUCK! I'm a real idiot!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny tried to feel calmer for a few seconds before starts to look for someone. Vinny went through the smoke of the explosion. Above the smoke, the environment was cleaner, Vinny could finally see the forest and another village far away. Vinny could see that the whole place around his was normal, but Vinny were surrounded by many curious ponies wanting to know what had happened. Around the sky there were more pegasus patrolling the place. The village army was heavily reinforced. It looked like ponies had come from several other places to reinforce security.",
        "type": "action"
    },

    {
        "value": "Wooow. Looks like James will take a while to get here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny tries to look for James or Jeff during some seconds. Everything was so far away, Vinny couldn't really see who was who. Vinny could only see a little of the ponies' colors. Vinny could see two ponies accompanied by some guards.",
        "type": "action"
    },

    {
        "value": "Fineeee... There's really nothing here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny tries to look at the crater. The crater is an entrance to an underground tunnel now.",
        "type": "action"
    },

    {
        "value": "Tunnel? It's the tunnel Wagner mentioned! Good!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny then went back to where Rayane was. Rayane is trying to use some scent liquid to try to make Wagner wake up.",
        "type": "action"
    },

    {
        "value": "W..what? Rayane? Wagner made something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "No. It seems that his consciousness is slowly coming back. This scent will help his body finish calming down to wake up.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay, I see. I saw that the whole place around here is normal, but I was surrounded by many curious ponies wanting to know what had happened. But we are being extremely patrolled. I probably saw James and Jeff with some guards coming here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised, and then Rayane then demonstrates to have some idea.",
        "type": "action"
    },

    {
        "value": "Guards? Got it. I have an idea.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane's horn started to glow, getting ready to do something during the progress.",
        "type": "action"
    },

    {
        "value": "Ah?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets curious and looked at Rayane. Rayane's horn focused on the color of her magic. But she made a little more effort trying to manipulate the color of her magic until the color changed to a blue color. At this moment she throws up the spell's energy towards the sky.",
        "type": "action"
    },

    {
        "value": "Wow! Are you going to be okay with all this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath to keep calm and made a small smile.",
        "type": "action"
    },

    {
        "value": "Yes. I'll be fine. I can be sure some help will get here soon. Help me keep Wagner's identity. He'll be fine if no one knows who he is.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Rayane and Vinny started to hear the sound of footsteps approaching.",
        "type": "action"
    },

    {
        "value": "Ah?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets surprised and Rayane looks toward the sound. Vinny and Rayane saw some shadows approaching, it looked like 4 different ponies.",
        "type": "action"
    },

    {
        "value": "W..what? Did you see Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets ready for any attack during the progress, but Rayane would put her hoof in front of Vinny for him to let his guard down.",
        "type": "action"
    },

    {
        "value": "No no. Calm down. It's him. He's alive.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ah? He who?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny saw a very tall unicorn, the unicorn is an elderly pony. The unicorn is bearded, and he was accompanied by 3 guards who protected him.",
        "type": "action"
    },

    {
        "value": "W..wow?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious unicorn then stared at Vinny.",
        "type": "action"
    },
    
    {
        "value": "Who are you? What are you doing here? This place is very dangerous for survivors.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised, but then Vinny got the courage and responded.",
        "type": "action"
    },

    {
        "value": "Hi, my name is Vinny. We are here since the beginning of this mess. By a miracle I am here alive.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane very curiously for a few seconds.",
        "type": "action"
    },

    {
        "value": "Hey. Who is he?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked curiously at Vinny and answered.",
        "type": "action"
    },

    {
        "value": "He's Hiroshi. He's the leader of the West region. This place.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi was curious to see that Rayane knew Vinny. Hiroshi then took a deep breath and spoke calmly and peacefully.",
        "type": "action"
    },

    {
        "value": "So Rayane knows you? This makes me a little surprised. Your sincerity in not knowing me shows me that you're new here. I'm sorry your first visit was at a very tragic time.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Vinny felt a little nervous. Vinny was very curious as to what could be really going on right now.",
        "type": "action"
    },

    {
        "value": "God! Looks like things are really going to get serious here.",
        "character": "Vinny",
        "type": "think"
    },
  
    {
        "value": "The other 3 ponies let their guard down at Hiroshi's request. 2 ponies were unicorns and 1 pony is a pegasus.",
        "type": "action"
    },

    {
        "value": "I... I apologize for not recognizing you. Yes, Rayane and I were here when the explosion happened. I stayed on top of the bomb but unfortunately I didn't get time to stop the disaster. We ended up having to flee. But luckily we managed to survive.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi showed a bit of a feeling of surprise, so he replied calmly.",
        "type": "action"
    },

    {
        "value": "So you are brave? You two could have died instantly from all this. If you come with me, I can offer a shelter. We'll just check you before continuing. We need this place clean to continue the search for survivors and find out what happened here.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious and then just accepted.",
        "type": "action"
    },

    {
        "value": "Sure, here are my items.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny allowed the guards to check each item during the progress.",
        "type": "action"
    },

    {
        "value": "Unfortunately I didn't find anyone surviving while looking for someone or something that would help in the current situation.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi was even more curious, trying to understand the attitudes that Vinny was choosing. Hiroshi was a little more curious to see Wagner passed out.",
        "type": "action"
    },

    {
        "value": "Okay. I understand. But first I need to ask you a question. Who is this other pegasus that is with you?",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised, but still tried to remain determined to continue responding calmly.",
        "type": "action"
    },

    {
        "value": "I found a single survivor before the explosion, according to him his name is Wagner, but after the explosion, he got a little crazy, started talking about his family and fainted when he saw the situation outside. However, I don't know anything about him, that's motive he's wearing those rags.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi took a deep breath slowly when thinking about Wagner's life for a few seconds.",
        "type": "action"
    },

    {
        "value": "Well... I hope you don't mind. But I'm going to send my messenger to warn a friend of yours that we ended up accidentally meeting you two.",
        "character": "Hiroshi",
        "type": "dialogue"
    },    
    
    {
        "value": "Vinny gets a little surprised to hear this.",
        "type": "action"
    },


    {
        "value": "Friend of ours? I don't understand, our friend? Are you by any chance talking about James? A unicorn with a brown mane?",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Yes. He was found along with Jeff in an abandoned mine. He is extremely desperate wanting to know if you are all right. I will then authorize the messager. Okay?",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "O...okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi does a sign, then Hiroshi's pegasus opened he's wings and started flying towards the forest. Hiroshi seemed very curious to see that Rayane was getting comfortable with Vinny's presence. Hiroshi looked at Rayane for a few seconds before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "My final question is the friendship between you and Rayane. I've never seen her accompanied. She seemed much more serious and discreet since the last time we spoke.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Rayane, who was quiet, trying to remain silent as much as possible during the conversation to analyze what was happening, was interrupted when Hiroshi mentioned her name.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Rayane",
        "type": "think"
    },
    
    {
        "value": "Vinny continued the dialogue in a very curious way.",
        "type": "action"
    },

    {
        "value": "Well... I'm new here. I've been seeing that everyone knows Rayane. But It's the first time I've seen her. Do you believe this? I don't know how she was before and how she is different. I think it would be the attitude of any pony. Does not agree?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny sat down. Vinny took a deep breath, feeling relieved to know that James is okay. Rayane slowly opened her eyes a little wider. Rayane looked like she was meditating to try to recover her energy faster. Hiroshi was very curious and a little surprised to hear all this. So Hiroshi was a little thoughtful before answering.",
        "type": "action"
    },

    {
        "value": "This is something very unexpected. This is not the same Rayane I met. But I'm glad to hear that she tried to open up to a new pony like you. This is a good hope. The hope that Ariella's spirit still exists in this world.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi took a deep breath and smiled a little.",
        "type": "action"
    },

    {
        "value": "The generation of Ariella that unfortunately disappeared and started all this chaos.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi was showing a little nostalgia before thinking about the subject of the conversation again. Vinny just looked at Rayane again. Vinny was very curious, trying to understand what was going on. Rayane was very surprised by what she heard, but then she tried to keep quiet.",
        "type": "action"
    },

    {
        "value": "Whaaat?",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "G...Generations? I didn't know generations had names.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yes. I'm much older than you two can think. There are few who are interested in my stories. I will be happy if you two allow me to talk more about this in the future.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi took a deep breath, trying to have determination and courage to prepare to continue what he was doing.",
        "type": "action"
    },

    {
        "value": "Well. I need to get back to my work now. Sorry.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. Alright, anything if you need me, I'll still be here, I'll stay here in case the pegasus wakes up. The pegasus probably lost his family. I think it would be more relaxing for a friendly face to be the first face he sees. T...Thank you. Thank you so much for everything. This is nice to meet you, Hiroshi.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi looked curiously at Vinny for a few seconds. Hiroshi seemed to have felt something different about Vinny. But Hiroshi tried to hide this feeling.",
        "type": "action"
    },

    {
        "value": "You seem to be showing a pure behavior. If I'm right about your purity, I'm sure our goddess Rainbow Queen will light your way. She would really enjoy meeting you if she came back after many years since she mysteriously disappeared.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "R..Rainbow Queen?! Wait... Rain? Rainbow? Rainbow Queen? What?!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was surprised to hear this name. Vinny was extremely thoughtful for a few seconds. Rayane was uncomfortable hearing this name. But she tried to keep calm.",
        "type": "action"
    },

    {
        "value": "Have a nice day for you two. Stay safe.",
        "character": "Hiroshi",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi bowed for a few seconds. The two guards then prepared to follow Hiroshi while returning the items to Vinny. Then Hiroshi starts to walk toward the crater while the two guards start to follow Hiroshi. Vinny was still very curious about Hiroshi's behavior.",
        "type": "action"
    },

    {
        "value": "Weeeeeeeell... Oh?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane's face, showing feeling of fear.",
        "type": "action"
    },

    {
        "value": "Ah? Rayane? Are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was surprised thinking about many things for a few seconds before paying attention to Vinny.",
        "type": "action"
    },

    {
        "value": "W..what? Me? I'm fine now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny breathed a very relieved way.",
        "type": "action"
    },

    {
        "value": "My beloved Celestia! This was almost in. Did you hear the whole conversation?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "A..ah? Yes yes. I listened to every detail while I was recovering my energy.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "My heart almost came out of my mouth. But anyway, this pony is more one to the list of ponies that know Rayane. Seriously I think it's easier to ask who doesn't know you. I wish I had the this fame.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked at Vinny's face, trying to understand what was happening. Rayane then felt a little calmer and laughed a little.",
        "type": "action"
    },

    {
        "value": "Not all ponies know me more personally. I'm usually just an urban legend.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles a little before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "Ah? Tell me a pony that doesn't know you that we had some contact? if you remember one, I take my hat off for you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane made the silly, malicious smirk face while booping Vinny in response.",
        "type": "action"
    },

    {
        "value": "The sniper only recognized my face. But he never talked with me~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hmm... Okay. Heh. Do you want to try to wake up the little pegasus?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane stopped the fun moment and looked curiously at Wagner.",
        "type": "action"
    },

    {
        "value": "Hmmmmm. Okay. Wagner must be feeling much better to wake up now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Weeell, I hope that at some point we can talk more about your past. I would sincerely like to hear from the original source of the facts. But everything has its hour, Charming Rayane!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles for a few seconds before getting a little curious about Vinny's behavior.",
        "type": "action"
    },

    {
        "value": "M..my past?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah! Well... Today is the Wagner lucky day. Let's go!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a deep breath for a few seconds, and prepared to wake Wagner. Vinny pokes Wagner curiously during the progress.",
        "type": "action"
    },

    {
        "value": "Hey? Are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked at Wagner again for a few seconds before poke him again.",
        "type": "action"
    },

    {
        "value": "Heeey?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner started coughing a little while trying to open his eyes very slowly.",
        "type": "action"
    },

    {
        "value": "Heh~ The smell really helped.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "H...huh? W...What?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner? Hey! You're ok now. Calm down, help arrived and it's ok now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugs Wagner kindly. Wagner was very confused by Vinny decision.",
        "type": "action"
    },

    {
        "value": "W...What happened here?",
        "character": "Wagner",
        "type": "think"
    },

    {
        "value": "Help? Wait... This are...are you again?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was extremely confused as he calmed down during the hug.",
        "type": "action"
    },

    {
        "value": "Yes. Do you want me to let you go? You can't just run away.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny gave Wagner freedom to move slowly.",
        "type": "action"
    },

    {
        "value": "I didn't know you were sensitive to certain things to the point of passing out.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner gets very surprised, trying to understand again what was going on.",
        "type": "action"
    },

    {
        "value": "Y..yes. It was very scary for me to find out that this all was my fault.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner slowly looked around, and began to try not to cry. Rayane then looked at Wagner, and was already planning what could be done. Wagner was a little more scared to see that Rayane was there. But Wagner slowly calmed down to see Rayane approaching peacefully.",
        "type": "action"
    },

    {
        "value": "Sssshh~ Don't worry your head about this. You can still redeem yourself.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yes, calm down. We need to talk about a few things, do you want to take some time to breathe or do you want to talk now?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "T..things?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner gets a little scared during the talk.",
        "type": "action"
    },

    {
        "value": "No no no. It's nothing serious. We just need to know if you want to help us find the culprit of whoever did this. We know and trust you when you said you didn't know anything else, but maybe with your help we can make progress on this mission.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would then give Wagner some seconds to understand what was happening, and then continue the conversation.",
        "type": "action"
    },

    {
        "value": "So... want to help us?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner slowly thought about what he was going to say. Wagner looked very nervous, he was getting ready to say something. Wagner realized he had no choice left, he chose to continue the conversation.",
        "type": "action"
    },

    {
        "value": "O..okay okay. The pony responsible for the bomb? It was Marlon. Marlon asked me a lot to guide this last bomb. B..But be careful. Please... Be very very careful. Marlon knows that invaders can come after him.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner begins to show concern. Wagner didn't want to look like some traitor.",
        "type": "action"
    },
    
    {
        "value": "Calm down, no one is going to capture anyone. You can feel better about this, unlike Marlon you can choose if you want to help us or not.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a light deep breath for a few seconds.",
        "type": "action"
    },

    {
        "value": "Just saying that here was full of guards, they would arrest you, but I helped you. You are free to choose what you want to do now. If you choose to stay with us, you will not always stay, you will be able to do your thing, see your family. When we need you we will let you know so you don't get confused. Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner felt even more afraid when he thought about Hiroshi's guards for a few seconds.",
        "type": "action"
    },

    {
        "value": "O..okay. I'm surprised about your decision. If you promise me to keep your word, I'll keep mine. But there is one condition. I don't want to do all this and then go back to the misery that the East region is becoming. You're going to have to promise me to do something to bring some hope back to my home.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Vinny then became very thoughtful for a few seconds. Then Vinny would smile sympathetically before answering.",
        "type": "action"
    },

    {
        "value": "Hmmmmmmmmmmmm... I'm not a god. But I promise to do my best to give you all comfort.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looked at Rayane nervously.",
        "type": "action"
    },

    {
        "value": "Can you get his wing accessory back? Will you want your bomb guide item? I think it's dangerous for you to walk around with that.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I...",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane and Vinny were interrupted by listening to Wagner talking to himself. Wagner looks without much hope.",
        "type": "action"
    },

    {
        "value": "Oh god. That's funny. if this prophecy pony were here. She could really do something if she's as important as Marlon said. I don't understand why he believes these so much legends.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little thoughtful for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "Okay... Wagner, we will return some items that belong to you.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "M..my items? Oh yes! My itens!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner is very happy about that.",
        "type": "action"
    },

    {
        "value": "Heh. I kept everything in my inventory.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane spawned Wagner's wing equipment. Wagner was curious and surprised to see Rayane's magic.",
        "type": "action"
    },

    {
        "value": "Thank you very much! Thank you!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles and give back a few more items before looking back at Vinny.",
        "type": "action"
    },

    {
        "value": "Heh~ Fine. Don't worry about it. This radar can be useful later on and we know someone who knows how to use it very well.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y...Yes. Yes yes.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious and looked at Rayane curiously for a few seconds before look at Wagner again.",
        "type": "action"
    },

    {
        "value": "Hey Wagner. So you agreed to do all this to help you with money?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was surprised to hear this and tried to respond as quickly as possible.",
        "type": "action"
    },

    {
        "value": "W..What? No! Our crops are dying more and more! And we are getting less and less money to buy food from the West region.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "I see.... By the way, do you know what or who is Rainbow Queen?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised and at the same time Wagner was confused.",
        "type": "action"
    },

    {
        "value": "Rainbow Queen? I've never seen this pony. But I always see Marlon and Hiroshi talking about her. But it seems that the one who talks about her the most is Hiroshi himself. He talks so much about his past. I think he's more than an old man who lived longer than usual.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and then looked curiously at Rayane again.",
        "type": "action"
    },

    {
        "value": "W..What? Rayane, is he that old?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was also very curious to hear this.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Ah? I never knew Hiroshi true age. But if he says he lived an old generation, that seems like a long time ago.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked at Wagner with a slightly worried look.",
        "type": "action"
    },
    
    {
        "value": "Okay... Wagner, you need a new identity. I think it's not good for you to go around talking about what you really did. Try to think a random stuff. I said that you had passed out and got a little dizzy from the bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Wagner looked at Vinny and responded nervously.",
        "type": "action"
    },

    {
        "value": "W..what? Y..yes! I'll try to think on something. I...I will try the better.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner gets a little scared. Wagner sat on the floor to think about something. The dust from the explosion was much lower and now the sky was becoming much more visible to observe. Vinny and Rayane began to analyze this.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "bad-think"
        },
        "value": "Hmmm... Wagner? Tell me, why the wing accessory? Do you not know how to fly well?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "A...Accessory? Ah! My accessory! This is a special planning equipment. It helps me fly longer distances. It's so curious to imagine what life would be like if this were giant mechanical wings to make a giant object fly.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner took a deep breath, feeling depressed.",
        "type": "action"
    },

    {
        "value": "I think we could do something really fantastic.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to hear this, but then he was interrupted when he heard a little James' voice trying to scream his name and Rayane's name. Rayane was very curious and a little surprised to realize this too.",
        "type": "action"
    },

    {
        "value": "Well.... Ah? J..James?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. James is here.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at James. Vinny was very happy to see James.",
        "type": "action"
    },

    {
        "value": "Hey JAMES!!! JAAAMES!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "VIIIIIIIINNY! It's yourself!! OH GOD! I never thought I would feel so happy to see you and Rayane so suddenly like this one day!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James arrived and hugged Vinny and Rayane very strong and comfortable. James was extremely worried and was starting to cry a little, very happy to see everyone alive.",
        "type": "action"
    },

    {
        "value": "W...wow. James.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane and Vinny was a little surprised by the hug before contributing the hug back.",
        "type": "action"
    },

    {
        "value": "Awwwww. Sssssh~ Calm down silly scientist. We're all fine.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yes Yes. We survived. How are you?",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Please, don't do this crazy thing! I had my heart in my hand just now!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James was still very emotional, trying to calm down from the situation. Jeff then arrived a little late and tired from the rush while trying to breathe.",
        "type": "action"
    },

    {
        "value": "Uff......Y...yeah....he was really in a hurry...And...I almost couldn't keep up with him.... AAH.",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff lay on the floor, feeling very tired. Meanwhile, Wagner was looking at all. Jeff was feeling relieved, trying to show some feeling that everything was fine. When Vinny noticed Jeff's presence, Vinny would start talking to Jeff.",
        "type": "action"
    },

    {
        "value": "Jeff? Hey! How was it in the cave? Are you two really ok?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Uuufff.. Yes. We are fine. But unfortunately we didn't find anything. I was heartbroken to see the village destroyed, but I wanted to hope that you were alive.",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny realized that Jeff was depressed too. So Vinny helps Jeff join to hug time.",
        "type": "action"
    },

    {
        "value": "Y..yeah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Don't feel that way. The worst has gone~ Let's all calm down now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. I already feel so much better to see that you and Rayane are okay. I didn't know what else I would have done if I had lost all of you.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Heh. We will still have more marshmallows for you to see in the next few months. Don't worry~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "James and Wagner were slowly calming down. Then the hug moment finally ended and everyone went back to talking normally. Wagner was feeling more depression during the talk.",
        "type": "action"
    },

    {
        "value": "Y...Yeah.",
        "character": "Wagner",
        "type": "dialogue"
    },
    
    {
        "value": "Jeff. I'm sorry about your house, a good thing is that before I came here, I saw a lot of ponies running away, maybe you'll find who you're looking for. I had a good idea to come face to face with this bomb. But unfortunately I arrived too late so we didn't have time to do anything.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James gets outraged and started shaking Vinny at the same moment without thinking twice.",
        "type": "action"
    },

    {
        "value": "BUT WHAT THE FUCK IS THIS?! YOU'RE CRAZY?! VINNY! You could have evaporated during the explosion!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "AAAAAHH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Everyone was surprised by James' reaction for a few seconds.",
        "type": "action"
    },

    {
        "value": "W...Well. Maybe you're right. I'll try to wait a bit for everyone to meet again.",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff took a deep breath, and was very thoughtful for a few seconds. Then Jeff would look at Wagner and feel a great curiosity about his presence.",
        "type": "action"
    },

    {
        "value": "W..what? Who is this pony?",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "James and Vinny stopped the mess and they both looked curiously at Jeff as they listened to the question. At the same moment Vinny does a poker face, thinking about some quick plan.",
        "type": "action"
    },

    {
        "value": "Oh? Who?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "...Fuck.",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Wagner... His name is Wagner. Rayane and I found him before the explosion.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Wagner, waiting for him to say something nervously. Wagner was very anxious and trembling trying to think of something to say. This made Jeff very strange to Wagner and a little worried about him.",
        "type": "action"
    },

    {
        "value": "W..what? Are you two okay?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "I ask the same. Did he lose anyone during the explosion?",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Vinny looked at Rayane for a few seconds. Rayane was concentrated just watching the conversation. Vinny then looked back at Wagner.",
        "type": "action"
    },

    {
        "value": "I...I don't know, he seems to be very sensitive, when I showed him the condition out here, he fainted. I think asking him very sensitive questions still won't do him feel good.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles nervously. So Vinny goes to Wagner.",
        "type": "action"
    },

    {
        "value": "O..Okay?",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "So Vinny smiled before starting to talk.",
        "type": "action"
    },

    {          
        "set": {
            "playlistPlay": null
        },
        "value": "Okay Wagner. Everypony here is my friend. You don't have to force anything, you can feel free to talk whenever you want.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N..no!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Everyone was surprised by Wagner's behavior.",
        "type": "action"
    },

    {
        "value": "Wagner?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "No! No! That's not right!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "dramatic"
        },
        "value": "Wagner was trying hard not to break down emotionally. But Wagner started to cry a lot and run away. Wagner was extremely afraid of accidentally hurting the emotions of more ponies.",
        "type": "action"
    },

    {
        "value": "W..Wagner? NO! H..HEY! WAIT! WAAGNER!",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff tries to follow Wagner worriedly while James was a little scared in response.",
        "type": "action"
    },

    {
        "value": "W..What?!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Oh no... I should have predicted this would happen.",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "DAMMIT! I think he also feels guilty for what happened!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny flies at Wagner, trying to do him stop. Vinny used all his speed as well.",
        "type": "action"
    },

    {
        "value": "WAGNER!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner keeps trying to run away more and more.",
        "type": "action"
    },

    {
        "value": "No! NOO! Leave me alone! This is going to be the worst punishment!!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner opened his wings and began to fly to try to escape.",
        "type": "action"
    },

    {
        "value": "Wagner! CALM DOWN!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny grabs Wagner hoof so he doesn't take flight. Then the two pegasus accidentally fell to the ground and rolled on the ground against each other for a few seconds.",
        "type": "action"
    },

    {
        "value": "WAGNER! STOP! Why?! Let's talk. You need to trust me. You promised and I promised. It's going to be okay, listen to me, you didn't mean to do anything, you were tricked, that's okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to keep holding Wagner's hoof during the talk.",
        "type": "action"
    },

    {
        "value": "No! Let me go! PLEASE! N...no!! Look what I've gotten myself into! I'm feeling in purgatory and I don't even want to die! How am I going to redeem myself from so many things at the same time?!",
        "character": "Wagner",
        "type": "dialogue"
    },


    {
        "value": "Wagner was extremely desperate and depressed about the situation, trying to find some way not to lose emotional control even more.",
        "type": "action"
    },

    {
        "value": "Wagner... Stop. Please stop. You're thinking a lot. Calm down and listen to me! It's not your fault, you saw us all in there, you can join us, be a family, you don't have to blame yourself for something you didn't do! If you want I can help you explain it to them. But we need you, you need to recover! We can help you!! Trust me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner slowly calmed down and started crying again during the conversation.",
        "type": "action"
    },

    {
        "value": "W...what will everyone think about me when they find out the truth? Do you think everyone will stay by my side?! No one is going to care about me! Hiroshi is going to want to rip my head off!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wahner cries a lot, trying to do everything possible to try to escape his mental issues.",
        "type": "action"
    },

    {
        "value": "But you didn't know. if you help us, you can have your free pass. Nobody is born knowing things, it's not written in the heads of all ponies who is good and bad. I just don't want you to do anything stupid. Calm down, let's try to calm down. Think about your family, if something happens to you and your family? Try to calm down you are not to blame for anything. Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner slowly tries to calm down again. Wagner continued to cry, but slowly became less aggressive, just continuing to cry. Vinny watched Wagner empathetically, thinking about what to do next.",
        "type": "action"
    },
    
    {
        "value": "W...what are you going to do? How can I end all this?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Calm down... You will end well, you have a chance to fix your issues. i'll be by your side, okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner then felt more and more calm during the talk. Wagner was finally able to calm down better than before.",
        "type": "action"
    },

    {
        "value": "Okay. I... I'll try my best. I don't have anything else I can do for now. But I will try my better.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "I'm here. Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny gently caress Wagner's head for him to finish calming down. Wagner slowly wiped the rest of the tears from his eyes as he stopped crying.",
        "type": "action"
    },

    {
        "value": "Heh. Let's go back. Everyone is scared, tired, we need to rest a little. I'll do my best to make sure everyone understands what really happened to you.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "I...I'll try to trust you. But please. Take it easy. I'm not ready for that yet.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner looks towards the crater for a few seconds. Wagner then looks for acceptance as he faced all the destruction around him.",
        "type": "action"
    },

    {
        "value": "I know. Don't worry, I'll talk to you in private. What do you want to do now?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner then took a deep breath slwoly, feeling much better.",
        "type": "action"
    },

    {
        "value": "I just need a little space to recover me.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner slowly started to get up while closing his wings. Vinny then got curious and asked in a hopeful way.",
        "type": "action"
    },

    {
        "value": "I understand, are you going to join us or are you going your own way?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner looked into Vinny's eyes. Wagner was very thoughtful for a few seconds before finally doing a decision about the Vinny's question.",
        "type": "action"
    },

    {
        "value": "Okay okay. I will join you. You are right. I can't be here alone.",
        "character": "Wagner",
        "type": "dialogue"
    },
    
    {
        "value": "Heh! Got it, don't be sad. Let's go back then.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then helped Wanger walk towards everyone. All the ponies were back in the same shelter. Everyone was sitting and talking randomly. Rayane was at the entrance to the shelter, waiting for Vinny to come back. Rayane was surprised and happy to see that Vinny and Wagner were doing well.",
        "type": "action"
    },

    {
        "value": "Hmmmm. Look who's back~ Everyone here was waiting for you.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles a little before responding emotionally.",
        "type": "action"
    },

    {
        "value": "Yes. Time for us to bring everyone together now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Go ahead~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny and Wagner entered the shelter slowly. Vinny could see that the improvised place was more organized and everyone was having lunch and talking time.",
        "type": "action"
    },

    {
        "value": "Wow. Okay. Hey guys, we are very tired and scared by everything that happened. I was thinking of going somewhere or right here for everyone to sleep or rest to calm down a little.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Jeff would then look at Vinny and smile. Wagner was shy and just kept quiet during the conversation.",
        "type": "action"
    },

    {
        "value": "Vinny? Vinny! He really came back!",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Heh. I said he'd come back. I always feel everyone's presence.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "James was curious to hear Rayane's words. James thought for a few seconds before asking the question.",
        "type": "action"
    },

    {
        "value": "Rayane? What is this magic about sensing the presence of other ponies?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Rayane then interrupted James in a fun way.",
        "type": "action"
    },

    {
        "value": "Ssssh~ Focus on your meal. We have more important things to solve now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "What?",
        "character": "James",
        "type": "think"
    },

    {
        "value": "James was still curious and just kept quiet. Rayane used her magic and offered some lunch to Vinny and Wagner kindly.",
        "type": "action"
    },

    {
        "value": "Here. Lunch time~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wagner looked at the snack and smiled a little before taking the snack and starting to eat.",
        "type": "action"
    },

    {
        "value": "T...thank you.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "You're welcome~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled as he watched the scene for a few seconds, until Vinny was interrupted by Jeff.",
        "type": "action"
    },

    {
        "value": "I don't understand. What happened here? Are you ok?",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff lookes very worried during the talk. Vinny made a nervous smile and looked at Rayane in response.",
        "type": "action"
    },

    {
        "value": "Are you sure it wasn't my scent that gave me away? I usually have a smell that only females usually notice.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny made a slight nervous smile.",
        "type": "action"
    },

    {
        "value": "Silly~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face and then looks at Jeff again.",
        "type": "action"
    },

    {
        "value": "Y..Yes! We're great, we're just not adepted to having to deal with situations like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Okay?",
        "character": "Jeff",
        "type": "think"
    },

    {
        "value": "Jeff got even more curious, but Jeff just continued to socialize with Wagner in response. Vinny looked around. Vinny looked very confused. Vinny looked very worried about what to do at this moment. Then Vinny took a deep breath and looked at James.",
        "type": "action"
    },

    {
        "value": "Fine! We have a crater, a mystery of magic items. Okay! First James will have to help me with something.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Hey James. I need to talk to you about my smartmoby. I will need your analysis skills.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James was curious, trying to understand the situation. James looked curiously at Vinny's smartmoby for a few seconds.",
        "type": "action"
    },

    {
        "value": "What? Your smartmoby? What are you intending to do?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Weeeeell... I need to see some things on my smartmoby. I'm still thinking about the right word.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "See some things? Vinny! You're confusing me. But that's okay. I will be waiting for you.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Yeah yeah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Dammit!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny then looked at everyone before starting to speak again.",
        "type": "action"
    },

    {
        "value": "Okay okay! Okay everypony! Come eat!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hmmm~ Silly. Don't think you'll get out of this without an answer later. Okay?~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny laughed a little at Rayane's answer. But Vinny was a little surprised to see that Jeff was helping Wagner socialize while the two ate the meal.",
        "type": "action"
    },

    {
        "value": "A..ah.",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Vinny felt a little nervous seeing Rayane's analysis, but then Vinny looked at James again. Vinny giggles a little before nudging James.",
        "type": "action"
    },

    {
        "value": "Jaaames. I need you to analyze the energy of my smartmoby.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets ready to eat the meal during the talk.",
        "type": "action"
    },

    {
        "value": "What? Vinny! Come on! Specify this better! You are not helping me! Are you wanting to modify your smawrtmoby? I still don't have the skill to do that.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny felt very nervous, not knowing exactly what to say as he looked at James. James was very confused, trying to understand what was happening.",
        "type": "action"
    },

    {
        "value": "A... Are you not very skilled at modifying or analyzing and comparing?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a deep breath before answering.",
        "type": "action"
    },
    
    {
        "value": "Vinny... I know how to modify a smartmoby, but that's too dangerous. If I make a big mistake and it shuts down, you will die.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets scared to hear about it. Vinny then became extremely thoughtful for a few seconds.",
        "type": "action"
    },

    {
        "value": "SHIT! Fineeee... Plan B.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "R..Really? Is there a way to hack this? Okay. Can you hack Rayane's heart?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny spoke ironically while laughing a little.",
        "type": "action"
    },

    {
        "value": "Ah?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Well, when you want to just let me know. I just need to make sure if there's something different in the energy of my smartmoby. I also need to talk to you privately at some moment.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would then start eating his meal. James was still very curious.",
        "type": "action"
    },

    {
        "value": "Fine.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked like she was listening to the conversation again, she just giggled a little before breaking into the conversation.",
        "type": "action"
    },

    {
        "value": "Silly ones. Don't give me ideas~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "James looked a little suspiciously at Rayane for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "I need to know first what you want to do in your smartmoby.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "N..No! You didn't understand, I mean if you can analyze my smartmoby, just analyze, looking to know if it has something unusual or rare or different from yours, from others.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hmmmm. The only pony here that seems to really enjoy analyzing smartMobies here is Rayane.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Huh?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little curious.",
        "type": "action"
    },

    {
        "value": "Am I that mysterious to you? I think you ate too many marshmallows~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "James does a facehoof. Trying to understand why Rayane was being silly.",
        "type": "action"
    },

    {
        "value": "Well... There is nothing special about your smartmoby unless you upgrade this.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Wow! We see the upgrades if you want, but explain to me what would these upgrades be? Does it have anything to do with weird dreams I had about Rayane dancing?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..What? What fuck?! Vinny? Are you okay?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James... Dreams are weird. But I want to see my smartmoby just to make sure it was just a dream.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James does a facehoof.",
        "type": "action"
    },

    {
        "value": "Do you want to come to a conclusion through a dream? I should have analyzed your sanity!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "You can also analyze this! If you want to analyze my little body too.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James tried to control himself in the face of Vinny's silliness. Meanwhile, Vinny happily finished eating the food.",
        "type": "action"
    },

    {
        "value": "Oh god! Let's just keep your smartmoby which is better.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Heh. When do you want to see this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James prepared to explain as best he could.",
        "type": "action"
    },

    {
        "value": "I just plug a usb cable into you. Yes. I know this is very strange.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very surprised and scared for a few seconds.",
        "type": "action"
    },

    {
        "value": "Alright. You know. I thought my first time that someone would plug something into me would be something conscientious, but if it comes from you that's fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James found Vinny's words very strange and kept staring at him for a few seconds.",
        "type": "action"
    },

    {
        "value": "What? It's just a usb cable on your smartMoby. I have a modified entry to connect it to my computer. What did you think was going to happen?",
        "character": "James",
        "type": "dialogue"
    },
 
    {
        "value": "Vinny makes a poker face and looks at his butt for a few seconds.",
        "type": "action"
    },

    {
        "value": "I didn't think anything. But it's ok. When do you want to do this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles in the background during the talk. James was a little disgusted and just went back to answering.",
        "type": "action"
    },

    {
        "value": "Well... We just need to sit down in a comfortable place for me to connect everything.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles a little too for a few seconds.",
        "type": "action"
    },

    {
        "value": "Do you want this now?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I want to know what you're planning to do. I can't guess the reason for all this!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "What? James... I said it like 5 times, I want to see if my SmartMoby is \"original\" or the same as everyone else's. I'm looking for something unusual about this. I'm looking for upgrades too.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Oh GOD! Ok! Please, just don't try to scream.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James shows the USB cable. Vinny looked a little worriedly at the USB cable before smiling again.",
        "type": "action"
    },

    {
        "value": "Let's go...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James uses his magic to levitate the cable toward the Vinny's smartmoby while Vinny put his arm next to James. James opened his backpack and took out his notebook to prepare the analysis progress.",
        "type": "action"
    },

    {
        "value": "Now the cable will drill your smartmoby a little bit. Please be quiet.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny made a nervous look while Rayane giggles a little.",
        "type": "action"
    },

    {
        "value": "Hmmm... Good luck for you two~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane hugs Vinny's arm kindly to try to make Vinny feel a little safer.",
        "type": "action"
    },

    {
        "value": "N..Nah. it looks like my arm is going to fall off. Don't worry.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yeah. Don't say me I didn't warn you.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny then felt a shock inside his body that circulated in all directions. Vinny felt uncomfortable for a few seconds. The pain then ended when the puncture finally entered the smartmoby.",
        "type": "action"
    },

    {
        "value": "FUCK! Good James, you blew a hole in me, so what happens now?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James was a little annoyed, but still he kept doing everything as calmly as possible.",
        "type": "action"
    },

    {
        "value": "Time to do the analysis.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Sillies~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "O..okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny felt another shock, this time a little longer. This was a little unbearable pain, but Rayane was there to help Vinny feel better. Vinny made a few faces to try to hide the pain, but soon it was all over and Vinny took a deep breath to feel calm.",
        "type": "action"
    },

    {
        "value": "Shhhh~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay! Now This is working.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James was satisfied to see that the most boring part was over, so he just started looking at the results on the computer. Rayane just giggles for a few more seconds at the situation. Vinny was a little embarrassed, but he just ignored it and looked at James.",
        "type": "action"
    },

    {
        "value": "Hey, what are you seeing? Doctor!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "NOTHING! There's nothing special here. You were making unnecessary drama. At least now it will be easier to connect your smartmoby next time.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face again.",
        "type": "action"
    },

    {
        "value": "Are you sure? What about the upgrades?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. Your upgrades will be later. You will need to really think about what you are going to do. Don't be in such a hurry!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "W..Well, can you give me examples about upgrades?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a deep breath before answering.",
        "type": "action"
    },

    {
        "value": "You can have a map inside your smartmoby. This will allow you to feel the places you are without needing to see the map.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Rayane then got a little curious to hear this, but she kept quiet.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Got it. Well, is there anything else you want to see on my smartmoby? I'm still curious, if it only serves to carry like a \"soul\". Don't you have ponies that can already make more complex upgrades? Like the alicorn from the cave.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James was curious about Vinny's words. Then James looked curiously at Vinny before replying.",
        "type": "action"
    },

    {
        "value": "Yeah. The soul is what powers the smartmoby. If your soul stops feeding the smartmoby, you die. if your smartmoby has power distribution issues due to lack of some synchronization of the your body like magic, you also die.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James was a little worried as he said the last reply.",
        "type": "action"
    },

    {
        "value": "If your arm is amputated, the smartmoby will still try to keep you alive for a while as long as your arm isn't too far away from you.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James then calmed down and was slowly surprised again by remembering Rainbow Queen visit in the cave.",
        "type": "action"
    },

    {
        "value": "Wait... I don't even remember seeing a smartmoby on that alicorn. She must have hidden it very well.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Meanwhile, Rayane was quiet, just listening to the conversation, trying not to participate too much in the talk.",
        "type": "action"
    },
    
    {
        "value": "So is my smartmoby safe? No virus? No spell? Is there a place where ponies are modifying each others smartmoby?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a deep breath before answering.",
        "type": "action"
    },

    {
        "value": "Vinny... This is fate that somewhere there is some secret laboratory of experiments. Let's just end the conversation here. You're safe now. There's nothing wrong with your smartmoby.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny was thoughtful for a few seconds while he was curious and with a slight feeling of fear.",
        "type": "action"
    },
    
    {
        "value": "O..okay. Rayane, next time I'll say that the goddess of death was mad at me. She thinks the energy of my smartmoby a little strange.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James does a facehoof. So James was going to do something else. So Vinny shakes his head slowly.",
        "type": "action"
    },

    {
        "value": "Fine.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked at James and ignored the situation. Rayane just wanted to continue the conversation.",
        "type": "action"
    },

    {
        "value": "G...Goddess of death?",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "Yes, she said that my energy was strange. I came from another world, I was sucked into a snack!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hmm. Heh. But we all come from other dimensions. This is no surprise for us.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to hear this as he remembered Kenny's words saying something similar.",
        "type": "action"
    },

    {
        "value": "Y...Yeah.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "So James came back eating a marshmallow. Rayane looked at James, so she laughed a little. Rayane made the silly, malicious face in response.",
        "type": "action"
    },

    {
        "value": "Oh! I knew you couldn't resist~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "NAH! This is no time for this!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James sat down and took the notebook. Vinny laughed a little and looked at James too.",
        "type": "action"
    },

    {
        "value": "Hey, how's the Marshmallow?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shut up!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James took a deep breath as he calmed down as he listened to the giggles.",
        "type": "action"
    },

    {
        "value": "And sorry. I don't have much to do. We need another pony or something that has what i need to install some new feature on your smartmoby.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets a little surprised and then responded.",
        "type": "action"
    },

    {
        "value": "W..What? Okay. All right. I'm already relieved that my smartnoby is normal.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ Now everyone is satisfied. It seems that this is the time to end the fun moment. We have important things to resolve now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Important things? Oh yes! Rayane is right, let's go to another subject.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I'm already preparing my stuff~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane then started to pack the items. Vinny approached James to speak more quietly. James was finding Vinny's behavior odd, but he just waited for him to speak.",
        "type": "action"
    },

    {
        "value": "Let's talk discreetly, did you like Wagner? Do you think he is trustworthy?",
        "character": "Vinny",
        "type": "dialogue"
    },


    {
        "value": "W..Wagner?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James gets a little confused for a few seconds.",
        "type": "action"
    },

    {
        "value": "You look like you know something about him. Nobody runs away like that.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Weeeeell... Before the bomb exploded, I asked Rayane to get a soldier who was involved, she brought him and we talked. I found out that he is involved with the explosion, but going deeper, according to him, he and his family are poor and out of necessity. He seems to be depending on working with his boss. I just hope you think before you try anything with him. You were so sensitive to Jeff when you saw him for the first time. I don't know if you'll have the same reaction for Wagner.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W.....wait. Wagner... is who guided the bomb?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James gets very surprised for a few seconds. James then kept quiet, trying to remain calm.",
        "type": "action"
    },

    {
        "value": "And is Marlon really involved in this? Vinny, this is going to be very... veeeeeery bad if it's true!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets worried to hear this.",
        "type": "action"
    },

    {
        "value": "Ah? W..Why?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "This will trigger a serious diplomatic crisis. We urgently need to stop this! This is not the time for us to have fun! We need to take action now!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Calm down James! No one wakes up wanting to throw bombs around. I understand that Marlon is a boss from a place and it's a poor place where they don't have money or food or similar, they would even understand the reason to keep bombing the neighbor if the neighbor has been a bad neighbor. Don't you agree?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I need to prepare a project to solve this problem. And you and Rayane, please. Don't blow yourself up again!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James looked very concerned about the situation. Vinny was more concerned about James' behavior.",
        "type": "action"
    },

    {
        "value": "James... We don't know anything about both sides. One side is extremely poor and the other one is rich. We don't know what's really happening, the real reason for the bombs, and everything else, the Elite Color may be using the region as a scapegoat.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a little deep breath trying to keep calm.",
        "type": "action"
    },

    {
        "value": "Yeah. Most likely the Elite Color know I'm here too.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Ah?",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Then Rayane entered the shelter again. Rayane looks like she's completely ready, and everyone in the shelter seems to have left already.",
        "type": "action"
    },
    
    {
        "value": "Heeey. Everyone is already outside just waiting for you two~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Vinny and James does a poker face to see that the place was already completely empty.",
        "type": "action"
    },

    {
        "value": "A....",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at James and giggles a little.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Sorry! It was just boring. I'll try to lower the level. Okay? If I get really boring you can talk. Well... Where is Wagner? Where are we going?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James looked at Vinny and just kept quiet.",
        "type": "action"
    },

    {
        "value": "Yes?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James then finished storing his stuff into his backpack.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "bad-think"
        },
        "value": "Shhh... Don't worry. Jeff is trying to keep Wagner calm. I have a great impression that Haroshi entered the Bunker that was blown up by the bomb.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked a little worried, so she just grabbed the rest of her stuff and walked out of the shelter.",
        "type": "action"
    },
    
    {
        "value": "W..What? Both Marlon and Hiroshi are suspects! Hiroshi may be involved in the explosion too!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny followed Rayane while James was just quiet listening to the conversation.",
        "type": "action"
    },

    {
        "value": "Hiroshi blowing up the bunker? That doesn't make the most sense. Hiroshi is the leader here.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was trying to control himself and not lose his sanity during the conversation.",
        "type": "action"
    },

    {
        "value": "AAAH! Politics! More politics! In where I came from, my leader was stabbed before becoming our leader! Some say it was fake, others say it was real. it make me crazy!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to calm down as he thought about the situation. James was curious and a little surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "Oh? What kind of crazy scenario is this you were living in?",
        "character": "James",
        "type": "dialogue"
    },
    {
        "value": "Heh~ For someone who trying to touch a bomb, he must have come from a crazy world.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny kept quiet and tried to avoid the topic of conversation when he realized what he had accidentally said.",
        "type": "action"
    },

    {
        "value": "Y...yeah. A pretty crazy world.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then the 3 ponies started walking towards a mysterious path. As everyone walked, Rayane took a deep breath for a few seconds. Rayane spoke very quietly, preventing everyone from hearing.",
        "type": "action"
    },

    {
        "value": "Yeah... I really wanted to talk to Hiroshi. I can't believe he would be crazy enough to do that. I hope I still have a chance to talk to him before it's too late.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looks worried as she arrived at Jeff and Wagner. So Jeff and Wagner looked back and were happy to be reunited.",
        "type": "action"
    },

    {
        "value": "Hey Wagner! Look! Everypony is here now!",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff happily waved to everyone. But Wagner still seemed very shy during the conversation, but a little better than he was feeling a few moments ago.",
        "type": "action"
    },
    
    {
        "value": "H...hello.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Vinny then smiled with a little hope to see everyone well.",
        "type": "action"
    },

    {
        "value": "Hey Jeff! How are you?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Jeff was smiling a little sympathetic, but answering a little worriedly.",
        "type": "action"
    },

    {
        "value": "Wagner is still depressed and scared. I don't understand why he's scared, but he's at least trying to calm down.",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Vinny looked worriedly at Wagner for a few seconds.",
        "type": "action"
    },

    {
        "value": "Yeeh. Thank you Jeff. Hmmm. Wagner, are you okay? Sorry but you didn't get to talk to me or the everypony here. if you don't feel comfortable saying about your you, it's ok, here everyone is family.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to smile a little at Wagner, but nothing interesting happened.",
        "type": "action"
    },

    {
        "value": "Okay okay. Sorry Wagner. So... I need to talk to you on sometime, okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I...I still need more time to recover me.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner looked even more depressed. So Vinny tried to get away from Wagner a little so he wouldn't accidentally make things worse.",
        "type": "action"
    },

    {
        "value": "Vinny? What do you mean by that?",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff gets a little surprised. Vinny took a deep breath before doing a small dramatic smile.",
        "type": "action"
    },

    {
        "value": "James, Jeff, come here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James and Jeff were curious.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Yeaaaah...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then the 3 ponies walked away from the group. Rayane was curious about Vinny's behavior. So Rayane kept Wagner close so he wouldn't feel alone.",
        "type": "action"
    },

    {
        "value": "James, you need to try to cheer Wagner up. And Jeff... How was it in the cave? Did you find your friend? Sorry to ask now, a lot happened, even with Wagner. Did you like him?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Jeff made a depressed smile, but he tried to be positive.",
        "type": "action"
    },

    {
        "value": "C...Calm Wagner down? How?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Calm down James. Maybe I have a plan. So...No. we didn't find anything. The cave was emptier than I imagined. I've already lost hope of finding someone. About Wagner, I'm trying my best for my emptiness with him. Let's try to be together here. Maybe making new friends will make us feel better. I don't even know where I'm going to sleep tonight. My house has been completely destroyed.",
        "character": "Jeff",
        "type": "dialogue"
    },

    {
        "value": "Jeff tried not to cry as he answered Vinny. Vinny would then be thoughtful and empathetic with Jeff for a few seconds.",
        "type": "action"
    },

    {
        "value": "Okay... Please wait here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Oh? All right.",
        "character": "Jeff",
        "type": "dialogue"
    },
    
    {
        "value": "So Vinny would go to Rayane again. Vinny looked worriedly at Rayane.",
        "type": "action"
    },

    {
        "value": "Rayane? Are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Huh? Ah. Hello Vinny. I'm just worried about what must be happening in the hole. We should hurry to get into this hole.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked at James, Jeff, Wagner for a few seconds before looking back at Rayne.",
        "type": "action"
    },

    {
        "value": "Ooh. Do you want to go with me? Or do you want to call others? I think it's better just us and anything the others can run out here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I was thinking about this. Jeff and Wagner are extremely tired and depressed. And James is the one who can help them.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny thought some more for a few seconds before agreeing with Rayane.",
        "type": "action"
    },

    {
        "value": "Ok, if you can, please prepare my armor. I'm going to let everyone know that we're leaving now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Okay.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath and became very thoughtful again. Then Vinny would go back to James.",
        "type": "action"
    },

    {
        "value": "Hey James! Rayane and I are going to investigate the hole. If you find anything strange, go as far away as possible. You will take care of Jeff and Wagner now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James gets very scared and worried to hear this.",
        "type": "action"
    },

    {
        "value": "W...WHAT?! Are you and Rayane going to get involved in yet another danger again? Are you two crazy?!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "H..Hey! Calm down James. The worst has already happened. We'll just need some device to keep contact.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a few deep breaths before answering.",
        "type": "action"
    },

    {
        "value": "Vinny, look at me. Please! Are you sure you're going to do this? You have to promise me for today you won't almost die in explosions like now!",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny got very nervous looking at James' worried look.",
        "type": "action"
    },

    {
        "value": "Don't worry. You have my word. If not, I'll pull your paw while you're sleeping. Do you have some trackers?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Your word? Are you SURE?",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets even more worried, and just agreed with James.",
        "type": "action"
    },

    {
        "value": "Y...yes. I'm sure. I will do my best.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "James took a deep breath as he realized he couldn't possibly change Vinny's mind. James was a little emotional. When James realized that Rayane was going to be together with Vinny, James then had an idea.",
        "type": "action"
    },

    {
        "value": "Okay, okay. You already have one of my best trackers. But you don't have my most powerful tracker that I use to try and track parts of Master SmartMoby. But please be careful. This device emits a lot of wave signals.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James took the Master Radar out of his bag. James was very thoughtful looking at the Master Radar.",
        "type": "action"
    },

    {
        "value": "I don't know how deep underground you go. But this radar is all I have for you to ask for my help.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "master-radar",
                "owner": "vinny",
                "amount": 1
            }]
        },
        "value": "James hands the Master Radar to Vinny. Vinny was very surprised to look at the radar. The radar appeared to be made of a much stronger material.",
        "type": "action"
    },

    {
        "value": "Y..Yeah. T..thank you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I'm trusting you. If we ever need to get out of here. We're going back to the cave. Be very careful.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "James was still worried, trying not to get too emotional. James then just tried to walk away, without looking back.",
        "type": "action"
    },

    {
        "value": "B..bye Vinny and Rayane. G...Good luck.",
        "character": "James",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. B..bye James...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "The two waved at each other. So James was finally leaving with Jeff and Wagner. Vinny just watched the scene for a few seconds.",
        "type": "action"
    },

    {
        "value": "Good luck for you too.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would just be very thoughtful for a few seconds and then go back to Rayane.",
        "type": "action"
    },

    {
        "value": "Rayane? I...I did. Are you ready?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised by James' reaction, so Rayane just continued the conversation.",
        "type": "action"
    },

    {
        "value": "Oh. Heh~ I'm ready. So it looks like the big time is now.",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "Oh hey! Your armor... will you borrow it again?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little before smirking a little while trying to feel calmer.",
        "type": "action"
    },

    {
        "value": "I thought you would forget~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "tense-mystery"
        },
        "value": "Then Rayane spawned the armor again on Vinny's body. Vinny then looked at Rayane again, very curious, wanting to know something.",
        "type": "action"
    },
    
    {
        "value": "So... You know something right? Is something really good in there? You are acting as if a part of the Master Smart Moby is there.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little surprised.",
        "type": "action"
    },

    {
        "value": "What? No. But I'm surprised you think this too. I can't be sure. This Master SmartMoby story is something new for me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hmmmm. Fine. Let's show these assholes how it's done!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started walking towards the crater. Rayane kept quiet, giggling a little at Vinny's reaction.",
        "type": "action"
    },

    {
        "value": "Silly. It's good you have your combat skills up to date~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "dayNightCycle": "evening"
        },
        "value": "So Rayane followed Vinny. The sky was much clearer, but still a little cloudy. The strong wind still continued due to the much cleaner place after the explosion. A few surviving ponies were found along the way being helped by the village guards. The place was very depressing, but Vinny and Rayane continued walking very quietly. It seems that the morning time has already ended, now it is the evening time.",
        "type": "action"
    },
    
    {
        "value": "Rayane? What's your plan? Have you ever thought if you find someone from the Elite Color here? Or enemies?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhhh~ If we find any organization, we have to be extremely careful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny and Rayane then finally got close to the crater. The place was surrounded by guards patrolling the place.",
        "type": "action"
    },

    {
        "value": "O...okay. What will we do now?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little before asking Vinny the question.",
        "type": "action"
    },

    {
        "value": "Do you want to do it the hard way or the easy way?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "W..What? Tell me what are the hard way and the easy way?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ The easy way is for us to use teleportation to get past them. But then if they discover us as intruders, we'll have little problems. The hard way is to convince them that we're going to have to go there for some good cause involving Hiroshi.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very thoughtful. Vinny wasn't too interested in making more trouble by remembering his promise to James.",
        "type": "action"
    },

    {
        "value": "Hmmm... Heh! You silly evil. Let's go hard way. I'm good with my words, and you have popularity.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I'm evil?~ Guess I'm not the only evil. You really think I forgot who wanted to rip someone's wings?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane smirks at Vinny, making Vinny do a poker face, feeling regretful for a few seconds. Rayane giggles for a few seconds before continuing with the dialogue.",
        "type": "action"
    },

    {
        "value": "Y..Yeah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then okay. I'll help you~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane smirks again. Rayane maintained a very respectful posture and walked gently towards the guards. Some guards were unicorns and others were earth ponies. The guards were a little surprised and curious due to Rayane's presence. When Vinny tried to approach the guards, some guards pointed spears to block Vinny's path.",
        "type": "action"
    },
    
    {
        "value": "W...wow! Hey! Calm down there friends. We came to talk to Hiroshi about the bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "One of the guards then looked curiously at Vinny for a few seconds. Rayane then became curious, trying to understand what Vinny was doing.",
        "type": "action"
    },

    {
        "value": "Hiroshi? And do you have any written mandate from him to respond to that?",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then slightly nervous when he realized what he had done.",
        "type": "action"
    },

    {
        "value": "L...Look, you're delaying me and Rayane, every second that passes we're all in danger.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "What? Hiroshi already gone on his mission. How can I trust your words if I don't even know you?",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "Rayane then took a deep breath and poked her paw on the ground to get the guards' attention.",
        "type": "action"
    },

    {
        "value": "Oh? Rayane? R..Rayane! What kind of joke is this? Hiroshi never informed me that she would be accompanied by someone.",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "The guard then became curious, trying to understand what was happening.",
        "type": "action"
    },

    {
        "value": "Welll... What's your name?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The guard then became serious again before replying.",
        "type": "action"
    },

    {
        "value": "Hey! No! We don't reveal our names! You are very innocent. Only Rayane can convince me that she is with you. I'll have to invite you to leave here.",
        "character": "Guard",
        "type": "dialogue"
    },


    {
        "value": "The guard was very suspicious of the situation, but then Rayane interrupted the conversation.",
        "type": "action"
    },

    {
        "value": "Hey! Okay. Enough of the silly talk. I'm with him~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The guards were then extremely confused and surprised.",
        "type": "action"
    },

    {
        "value": "Wait... what?!",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "The guard was extremely thoughtful and worried about which decision to choose.",
        "type": "action"
    },

    
    {
        "value": "I...I don't know what you are planning and why Rayane is with you. But... I'll let you in accompanied.",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "Heh~ It's fine. Maybe a little extra help could be good.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. Let's go soon. You can come with us.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The guard remained curious for a few seconds, and then looked at the other guards for a few seconds. Then some other guard soon agreed with each other.",
        "type": "action"
    },

    {
        "value": "Okay. Go ahead. They're going with you. But remember we've got our eyes on you.",
        "character": "Guard",
        "type": "dialogue"
    },

    {
        "value": "Then everyone released the way. Allowing Vinny and Rayane to walk towards the entrance to the crater. Vinny then was happy to see this and said.",
        "type": "action"
    },

    {
        "value": "Okay, be careful out there. Keep an eye on the sky.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh~ Silly~ You've done a lot of silly stuff here. You're lucky I'm here.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny made a slight nervous smile. Rayane then started walking towards the crater and Vinny was a little quiet, following Rayane. Vinny was very curious about something he thought.",
        "type": "action"
    },

    {
        "value": "O..Okay. Sorry. What do you think Rayane? Will we find Hiroshi in time?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little.",
        "type": "action"
    },

    {
        "value": "We'll have to take a shortcut if we really want to get there.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah... So we all go?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked curiously at the two guards who were approaching to accompany Vinny and Rayane. The two mysterious guards just nodded and kept quiet. Vinny found the behavior of these two guards a little strange.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Okaaaay? Everyone is very quiet here. Let's go then.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Heh. Let's go~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "dark-ambient-melodies",
            "where": "Banker ???"
        },
        "value": "Then Vinny and Rayane and the two guards went down the crater, everyone approached the entrance and began to enter the tunnel. The place is very typical of a very advanced banker. Vinny were impressed. Meanwhile, the two guards continued to analyze Vinny's behavior curiously.",
        "type": "action"
    },

    {
        "value": "Vinny. This was really as I imagined. This is a bunker. It seems that all this destruction was a desperate attempt to open this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was slightly nervous trying to think of a good answer.",
        "type": "action"
    },

    {
        "value": "Yes. S..so Guards? Don't you know anything about Hiroshi?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The guards then looked curiously at each other very thoughtfully. so they decide to say something.",
        "type": "action"
    },

    {
        "value": "We're just watching the place. We're not allowed to say anything about this. But if you know where he is. Go ahead.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "What? I never said I knew where he was.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little confused for a few seconds. But then Vinny was a little more surprised to see the details of the place. Vinny could see that many lights were damaged and sparking or flashing. Soon everypony would see signs that there was some conflict inside the corridor of the bunker. The guards were slowly starting to get worried as they saw the trails of destruction around. Rayane and Vinny discreetly analyzed the guards' behavior during the progress.",
        "type": "action"
    },

    {
        "value": "This is very strange. These guards don't seem to know what's really going on with Hiroshi.",
        "character": "Rayane",
        "type": "think"
    },

    
    {
        "value": "Vinny and Rayane started to see doors of some rooms around. Some doors were badly damaged and looted. Meanwhile, Rayane was very thoughtful, looking at the administration door quietly.",
        "type": "action"
    },

    {
        "value": "Wasn't the administration room attacked? I'm not liking this. Someone must be spying on us.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Hey guards! Careful, there might be something on the floor, can you use your magic to see if it's safe to walk here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 was quiet, looking at Vinny for a few seconds in response. Vinny did a poker face."
    },

    {
        "value": "S...Sir?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 took a deep breath before responding."
    },

    {
        "value": "Well. We've already searched this entire place. We'll let you know when you enter an unknown area. After this journey, we cannot guarantee if you will still be able to continue walking here.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "During the conversation, Rayane was still very quiet. Rayane enter the administration room slowly, looking around. Guard 2 gets surprised to see Rayane entering the room in response.",
        "type": "action"
    },

    {
        "value": "Huh? R..Rayane? What are you doing?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Sssh~ Everyone better be quiet.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane answered in a serious way and entered the room, looking for something delicately. Rayane look at some drawers for a few seconds before looking at a monitor screen. Then Vinny and Guard 1 were interrupted by hearing the sound of the Rayane's presence.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Yeah. She told everyone to be quiet.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "R...Rayane? Did you find something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh~ I found documents and some photo records. There's nothing interesting in this room.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looks at the monitor and press the power button. Then a login screen appears. Guard 1 was very curious, trying to understand the Rayane's behavior nervously.",
        "type": "action"
    },

    {
        "value": "R..Rayane... This is confidential. Are you sure you know what you're doing? If you miss the password 3 times, all alarms will be triggered.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looks at Guard 1 curiously.",
        "type": "action"
    },

    {
        "value": "Ah? How do you know? You've never been here and you don't know anything.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 got a little more nervous, but Guard 2 continued the conversation for Guard 1 to calm down.",
        "type": "action"
    },

    {
        "value": "Because this is the Bunker's protocols against invasion. Everyone know the bunker's protocols.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. It's very dangerous for you to end up getting the password wrong 3 times. It's going to get everyone's attention here.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny then stopped the conversation when he saw that the guards were calming down again. Vinny was starting to suspect something about the guards.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was analyzing and seeing what she could do with the computer password.",
        "type": "action"
    },

    {
        "value": "Hmmmmm...",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Vinny was slightly nervous, not wanting to interrupt Rayane. So Vinny tried to look for something inside the drawers, but he only find some tablets with some bunker logs. Everything seemed to be just technological gadgets.",
        "type": "action"
    },

    {
        "value": "Fuck! There is no paper here?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Okay. It's time to try to discover something interesting on this computer.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ah? Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wait... What? The...the computer? You will end up activating the alarms.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 looked a little worried again, while Guard 2 tried to help keep Guard 1 calm again. Vinny then laughed a little, just to keep the atmosphere more friendly.",
        "type": "action"
    },
    
    {
        "value": "Are you doubting Legendary Rayane's ability? I'm surprised anyone not worried about me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "item": [{
                "id": "mysterious-tablet",
                "owner": "vinny",
                "amount": 3
            }]
        },
        "value": "While Rayane was making the guards pay attention to the password, Vinny took 3 tablets and put the tablets in the saddle.",
        "type": "action"
    },

    {
        "value": "Hey. Who has access to technologies like this around here? James is a smart unicorn that can help us at some moment.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The guards then became curious as they looked curiously at Vinny. Guard 1 was starting to get a little suspicious at Vinny.",
        "type": "action"
    },

    {
        "value": "James? Is he a scientist? We do have scientists here and you need to be careful. If you do something stupid, we will be punished.",
        "character": "Guard 1",
        "type": "dialogue"
    },


    {
        "value": "Vinny does a poker face and tried to calm the conversation.",
        "type": "action"
    },

    {
        "value": "W...Weeeell, my first adventure here I was face to face with a Elite Color's member. I had to save James from trouble with Elite Color. I agree with you. I just want to confirm if i need your help, you will help me. if you fall I will help you. This is partnership. You are free to decide here what you want to do.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "H...help me? But what is this story?",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "The guard 1 was curious, but still suspicious, trying to understand the conversation.",
        "type": "action"
    },

    {
        "value": "Yeah. And now after all this, someone very powerful exploded a bomb here. We now need to try to work together to find out what's going on here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then took a deep breath in a sad way.",
        "type": "action"
    },

    {
        "value": "I tried to deactivate the bomb too. But I failed on this mission.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...What?! Disable the bomb? Are you crazy? You would be dead now!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "The Guard 2 laughs a little in response. But Guard 1 was a little thoughtful as he sensed Vinny's sincerity.",
        "type": "action"
    },

    {
        "value": "Hmmm... Okay. If you don't put us in danger, it's our task to help you. But even so, be careful what you're getting yourself into. If you really like danger tasks so much, you could talk to Hiroshi about getting you some work.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 was slowly showing less defensive behavior, trying to understand a little bit how Vinny would react. Meanwhile, Rayane was still working on the computer, but no one was watching her.",
        "type": "action"
    },

    {
        "value": "Hah! I think you're too worried. Marlon wasn't going to send this pegasus along with Rayane.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then very curious to hear the word \"Marlon\".",
        "type": "action"
    },

    {
        "value": "Marlon? Who is Marlon?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "But then everyone was interrupted by the sound of Rayane finishing doing something on the computer.",
        "type": "action"
    },

    {
        "value": "Marlon. Hmmmmm... What?!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 gets completely surprised to see the computer monitor. Guard 1 tried to remain calm while trying to understand the possibilities.",
        "type": "action"
    },

    {
        "value": "H..how?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Sssssh~ The drama is over. I already solved the problem on the computer.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets curious about the guards' reaction, but then Vinny was also surprised to see Rayane.",
        "type": "action"
    },

    {
        "value": "Yeah. You are dangerous on the keyboard.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little in response.",
        "type": "action"
    },

    {
        "value": "Fine! What's going on here? Everypony! Get out of my way!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 would then push Vinny and Guard 2 away, walking towards Rayane.",
        "type": "action"
    },

    {
        "value": "H...Hey! Take it easy!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 gets a little scared. Then everyone finally looked at the monitor screen. Then everyone was surprised again to realize the bunker's map on the monitor screen.",
        "type": "action"
    },

    {
        "value": "Heh. Silly ones~ This is the bunker map. I extracted the map data and now I know perfectly where to go. We are close to the metro. Let's keep walking straight to get to the train. From the train we will go towards the magic item place.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "B..but...but... How did you do that! You don't even know the password!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 was extremely surprised.",
        "type": "action"
    },

    {
        "value": "Looks like you're not the only pony here who has Hiroshi's trust. Let's go~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 was extremely surprised, not knowing what to say.",
        "type": "action"
    },

    {
        "value": "Wow! She's a badass girl! Trust her!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then laughed a little, to try to calm the tense atmosphere of Guard 1. Guard 2 who was watching, just giggles nervously in response.",
        "type": "action"
    },

    {
        "value": "O..Okay. Let's go.",
        "character": "Guard 2",
        "type": "dialogue"
    },
    
    {
        "value": "Heh~ Yeah. Let's go to the elevator. We have a long way to go.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane then stops poking her smartmoby and leaves the room, walking towards the door at the end of the hall.",
        "type": "action"
    },

    {
        "value": "Weeeell... Yes.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny laughed a little ironically and followed Rayane. The two guards looked at each other, wondering what to do. So the two finally agreed to follow Rayane.",
        "type": "action"
    },

    {
        "value": "I hope this is all being a good idea.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Don't worry. It's Rayane. Hiroshi always trusted Rayane. We just need to be careful with the crazy pony.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Then everyone finally arrived at the elevator door which was damaged. Rayane analyzed the situation of the door a little, then she used magic to forcefully open the elevator door.",
        "type": "action"
    },

    {
        "value": "Wow. But what trust is this?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Calm down, there's no superior here among us.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looked around as he waited for Rayane to get into the elevator to make the elevator work.",
        "type": "action"
    },

    {
        "value": "Hey! I'm the superior here. And if I fail, Hiroshi will punish me! That's motive I want you to listen to me when I say that we've reached the limit!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Shhhhh~ Sillies one. Don't worry, we won't do anything wrong.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 tried to remain calm when listening to Rayane's words. Then Guard 1 took a deep breath. Rayane began to focus energy on the horn slowly.",
        "type": "action"
    },

    {
        "value": "Fine.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Wait. How are we going to get through this damaged door?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 was curious to see that the elevator door could not be closed. Rayane then used her magic energy sphere and blew up the rest of the elevator door, making all the remains of the door flies around.",
        "type": "action"
    },

    {
        "value": "What the hell is that?!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "FUCK!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "WOOOOW!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Heh. Problem solved. Let's go~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "R...Rayane? Don't you want a megaphone to let everyone know we're here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny rubbed his paw on his head after the scare.",
        "type": "action"
    },

    {
        "value": "Well... About your superior, we know that you are responsible, but don't you think that being punished is not something you have to review? Do you like this life?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little before doing a silly, malicious face. Ignoring the guards' startled reaction.",
        "type": "action"
    },

    {
        "value": "Would you want to remove the door piece by piece then?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face, looking at the situation not knowing what to say. Then Vinny would smile a little, trying to respond in a calm and fun way.",
        "type": "action"
    },

    {
        "value": "Aaah... Fine. I let the next doors for you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ Thank you.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane entered the elevator and invited everyone to enter. Then everyone got in the elevator while Rayane analyzed the whole situation. The Guard 1 took a deep breath.",
        "type": "action"
    },

    {
        "value": "If I'm going to die on this mission, I want us to at least save some innocent lives. This has been my main purpose since I found out about this place. You must have your life goals too.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then curious to hear this.",
        "type": "action"
    },

    {
        "value": "What? Ah! I have my ideas, but I'd rather stay alive without goal. if I die who will continue where I left off?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Oh? What kind of conversation is this?",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Yeah. A good thought for you if you want to continue here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "The guard was curious about Vinny's strange behavior. Guard 2 just kept quiet, trying to understand the situation.",
        "type": "action"
    },

    {
        "value": "Okay! What do you think, Rayane? The ponies that used the elevator, were they angry?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh~ We'll find that out in the next room.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "We'd better wait for something bad, if Hiroshi hasn't come back and he has rough signs of fights, we need to prepare ourselves then.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hmmmm... It looks like you're already starting to understand the odds of this place. I'm glad for that~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane press the button for the elevator to start going down. Everything was very quiet. The two guards were starting to get worried as they understood Rayane and Vinny's thoughts. Then Vinny start to stare at Guard 1. Guard 1 gets a little curious and tries to keep a straight face.",
        "type": "action"
    },
    
    {
        "value": "So... If the pony you love the most in life do something wrong and you have to kill them? Would you do what they ask you to do? Or would you try to help everyone? Examples? Your family. I don't know anything about you but I'm sure at some point you already had a family. If you have any quetions about me, feel free to ask.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 was quiet and a little surprised. Meanwhile Guard 1 just took a deep breath and responded.",
        "type": "action"
    },

    {
        "value": "This is much more personal than you might think. I can't answer this kind of question.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. Your conversation is getting too serious.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Rayane just kept quiet while she reflected on the situation while calmly listening to the sound of the elevator coming down.",
        "type": "action"
    },

    {
        "value": "Everyone seems lost not knowing what is really going on here. Or they must be hiding something very covidiential. What are Hiroshi and Marlon doing this time? I've never seen these two ponies create a war of this level. This story must go much deeper than a simple war. I'm sure there's something very wrong going on here.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Okay sir guard. It's ok, I respect your privacy.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looked at Guard 2.",
        "type": "action"
    },

    {
        "value": "And you? How did you end up as a guard?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "M...Me? You're too curious!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "The Guard 2 gets a little uncomfortable during the question.",
        "type": "action"
    },

    {
        "value": "Are you really not going to say anything? Rayane is here with us.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The two guards looked at each other, just keeping silent.",
        "type": "action"
    },

    {
        "value": "Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then the elevator finally arrived at the destination. The elevator then shook a little, getting ready to open the door. The two guards started to prepare their spears during the progress.",
        "type": "action"
    },

    {
        "value": "W...What?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ We're already much further from home than you might think. You need to get ready too.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny looked a little nervous, but then he tried to accept the situation.",
        "type": "action"
    },

    {
        "value": "F..fine. I'm not enjoying this.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was a little surprised to begin to realize what he was really doing.",
        "type": "action"
    },

    {
        "value": "Oh fuck. Okay! I'll prepare myself with my... my.. hooves? Does anyone have a weapon or something to help me?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The two guards were then confused.",
        "type": "action"
    },

    {
        "value": "What?! I thought you specialized in brute force around here! You're an earth pony!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny then made a super poker face when he saw that the wings were hidden behind the armor.",
        "type": "action"
    },

    {
        "value": "Weeeeeeell... I'm new here. Any kind of weapon will be enough for me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "New one? How did you face a bomb?!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "SHUT UP you two! We need to open the elevator door!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "A..ah?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Ops?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little when she saw the 3 ponies talking.",
        "type": "action"
    },

    {
        "value": "It's not the best way to build a friendship, but it's at least working.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Guard 1 opened the magic backpack and gives Vinny a sniper.",
        "type": "action"
    },

    {
        "value": "Look here sir explosive! This will be my first test of confidence! If you claim to be so innocent and that you beat an Elite Color member. So you'll have to survive here too!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets completely surprised to look at the sniper.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "A...ah?! Where did you get that? Come on! Are you seriously going to trust me as a sniper while you're left with a sharp stick in the front?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "We don't have time for discussion!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "F..fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Meanwhile, Rayane was looking at her smartMoby. When she realized that everyone was finally more focused, she prepared to open the door.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "troubles"
        },
        "value": "Okay then. Let's go.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane uses her magic to slowly open the door. When the door opened, it was visible to see the subway entrance ahead. Everything was very quiet. It was possible to see a train with the door open. The guards are ready for any surprise melee attack. The guards protected Rayane as she started to spawn her sword.",
        "type": "action"
    },

    {
        "value": "Hmm... This doesn't seem to be that difficult.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Vinny tried to prepare his paw as best he could on the trigger. and stayed in position, looking for any threat. At the time Vinny were positioning the sniper, someone shot in Vinny direction, but Rayane quickly used her sword to block the shot.",
        "type": "action"
    },

    {
        "value": "AAAHH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised to see Rayane defending him. Rayane had a very serious and concentrated look.",
        "type": "action"
    },

    
    {
        "value": "Vinny! Don't lose focus! We now need to look for a hiding place before taking the firearms!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "S..sorry.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane would then summon a force field to help the guards move towards the subway pillars.",
        "type": "action"
    },

    {
        "value": "Heh~ I saved your life again. Time is precious now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    
    {
        "value": "Ah... Thanks again.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then tried to look for any possible pony that tried to shoot him while following Rayane to take cover behind some pillar. Rayane kept using her sword to block the shots from a second shooter as the sword started to go up in flames. The shots then stopped due to the flaming sword's intimidation.",
        "type": "action"
    },

    {
        "value": "Just go ahead! I can't take my eyes off where the shots are coming from!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane remains focused as she went to hide behind another pillar. Vinny was feeling nervous and positioned the sniper again. Vinny focused on the glowing gun barrels that were just barely visible behind some pillars next to the subway roulette.",
        "type": "action"
    },

    {
        "value": "Crap! I'm going to lose my head today.",
        "character": "Vinny",
        "type": "dialogue"
    },

    
    {
        "value": "Vinny concentrate, waiting for a weapon becomes more visible to shoot at this. Vinny saw that the weapon was already preparing to point directly at his. But one of the guards who had already caught a sniper, hits a pony that was on the right side of the pilasters.",
        "type": "action"
    },

    {
        "value": "WOOOW! HEY!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Keep focus!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a deep breath and then took the flashlight hat and used this to distract snipers trying to shoot towards the helmet.",
        "type": "action"
    },

    {
        "value": "Holy shit! But what boring ponies!",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Vinny then realized that a third shooter was getting ready to shoot him again. The other two shooters were distracted by the guards.",
        "type": "action"
    },

    {
        "value": "FUCK! YOU ARE REALLY A BITCH! I WILL KILL YOU!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane and the guards were a little worried to hear Vinny's unexpected intimidation.",
        "type": "action"
    },

    {
        "value": "Whaaaaat?!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "All the shooters then looked at Vinny, feeling irritated to hear the taunts. So at this moment Vinny heard something that sounded like a pony was switching weapons to some different mysterious weapon.",
        "type": "action"
    },

    {
        "value": "Oh fuck.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny does a poker face and then look at Rayane and the guards. Vinny makes a sign for everyone to be careful. Vinny heard that the second pony was also changing weapons. And the first one still wasn't doing anything, but Vinny would start to see that the pony had a heavy weapon.",
        "type": "action"
    },

    {
        "value": "What did Vinny do this time!",
        "character": "Guard 1",
        "type": "think"
    },

    {
        "value": "Ooooooooooooh fuck.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "N...not this one! I'll have to go with plan B!",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Rayane took advantage of the quiet moment to get time to use a spell, not to mention what she was going to do. Meanwhile the guards are positioning their weapons to try to have more balance when shooting.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe I can hit that mystery weapon.",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Vinny then aimed at the mysterious heavy weapon. But the second pony on the left pillar appeared, revealing his had a machine gun and started shooting at Vinny nonstop.",
        "type": "action"
    },

    {
        "value": "FUUUUCK! WHY ME?!",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Vinny desperately tried to hide behind the pillar that was starting to fall apart very fast due to the shots. When Rayane hears the sound of the machine gun fire, she gets extremely worried about whether or not she would teleport Vinny out of there, but she decided that she would go back with the original plan after a very hard decision.",
        "type": "action"
    },

    {
        "value": "V..Vinny! N..No! Okay. This will definitely get their attention!",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "So Rayane used teleportation spell to steal the supposed heavy weapon from the third pony. So now Rayane had a barzooka.",
        "type": "action"
    },
    
    {
        "value": "YES! I did!",
        "character": "Rayane",
        "type": "think"
    },

        {
        "value": "Ah? HAH! THANK YOU RAYANE!",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Guard 2 was very surprised while Guard 1 was choosing another weapon during this time. Guard 2 then used the moment to try to hit the second mysterious pony that was scared that his lost the bazooka. Then all 3 mysterious ponies became unfocused due to surprise.",
        "type": "action"
    },
    
    {
        "value": "R..Rayane! You rock!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Fine! Everyone distracted. This is the best time for it.",
        "character": "Guard 1",
        "type": "think"
    },

    {
        "value": "Guard 1 then decided to throw a grenade towards the pony that was using the machine gun. Then all the shots stopped instantly when everyone noticed the presence of the grenade.",
        "type": "action"
    },

    {
        "value": "F..FUUUUUCK! GRENADE COMING!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Aha! The time is now!",
        "character": "Vinny",
        "type": "think"
    },

    
    {
        "nsfw": ["extreme_violence"],
        "value": "Vinny reload the weapon and shoot against the scared pony head that lost the bazooka. Mysterious pony was hit with no chance of escape. The pony then simply dropped to the ground, without much reaction to the well-aimed shot. The pony made few moves, gasping in pain. He didn't look like he was going to stay alive for long.",
        "value_alternative": "Vinny reload the weapon and shoot against the scared pony that lost the bazooka. Mysterious pony was hit with no chance of escape. The pony then simply dropped to the ground, without much reaction to the well-aimed shot. He didn't look like he was going to stay alive for long.",
        "type": "action"
    },

    {
        "value": "W...WHAT! NOOO! YOU MONSTER!",
        "character": "??? 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then surprised and scared to realize that he had possibly killed a pony.",
        "type": "action"
    },

    {
        "value": "W..what? Did I kill anyone?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "The machine gun pony was extremely terrified when he saw the grenade falling on his side. He looked at the grenade and at the same time dropped the machine gun, trying everything to crawl on the ground to try to escape.",
        "type": "action"
    },

    {
        "value": "NOOO! FUCK! FUCK! FUUUUUUUUUCK!",
        "character": "??? 2",
        "type": "dialogue"
    },

    {
        "nsfw": ["extreme_violence"],
        "value": "The mysterious pony strayed a good distance away, but unfortunately the explosion still hurt him a lot. The mysterious pony fell to the ground. The pony body completely damaged and with some parts amputated from the impact.",
        "value_alternative": "The mysterious pony strayed a good distance away, but unfortunately the explosion still hurt him a lot. The mysterious pony fell to the ground. The pony body completely damaged.",
        "type": "action"
    },

    {
        "value": "Wow!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rayane hugged Vinny to help protect him during the explosion while the two guards hide behind the pilasters to protect themselves.",
        "type": "action"
    },
    
    {
        "value": "Then when everything finally calmed down. Vinny open his eyes and looks at Rayane curiously. Rayane was fine and she just took a deep breath in relief that everything had ended well. At this moment everything was extremely quiet. Only the sound of injured ponies could be heard, but no sound could be heard of any survivors returning to the rescue.",
        "type": "action"
    },

    {
        "value": "H..hey? Is everypony okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane made a little smile in response.",
        "type": "action"
    },

    {
        "value": "Good~ I'm glad you survived here.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "sad"
        },
        "value": "Rayane ended the hug and her mane slowly started to float as she started to use the presence detection magic in a very calm and peaceful way.",
        "type": "action"
    },
    
    {
        "value": "Yeah. You're welcome.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "The other two guards then slowly moved out of their positions as they realized that all possible survivors were no longer there.",
        "type": "action"
    },

    {
        "value": "Pheeeeew... We really did it.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Yes. I think I underestimated Vinny too much. Anyway I'm sorry. I thought you would die here, but it looks like you did better than I imagined.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "aaaaand... I can't believe Rayane managed to steal a bazooka!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Heh~ Silly ones, I just needed time to recharge my teleport but everything ended well.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles a little at the situation to try to make himself feel better. But then Vinny spoke a little worriedly.",
        "type": "action"
    },

    {
        "value": "Yeah. But... let's see if there's any live pony to ask about Hiroshi. This story is not cool. If Hiroshi entered here, and here is the only place that has an entrance, I wanted to know better what happened here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 was breathing deeply, trying to get some rest during the conversation as well.",
        "type": "action"
    },

    {
        "value": "Vinny is right. It's not time for us to celebrate yet.",
        "character": "Guard 1",
        "type": "dialogue"
    },
    
    {
        "value": "My concern is whether Hiroshi has been captured. This place wouldn't be being guarded by opponents.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised and nervous as he remembered the ponies that had been injured during the conflict.",
        "type": "action"
    },

    {
        "value": "Y..yeah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "nsfw": ["extreme_violence"],
        "value": "Vinny then walked over to the pony that was lying on the ground. The pony was still breathing, but he was exhausting. The blown pony was already very disintegrated, was crawling on the ground, trying to reach the his backpack. The blown pony smartmoby was crashing a lot, making a lot of weird noises.",
        "value_alternative": "Vinny then walked over to the pony that was lying on the ground. The pony was still breathing, but he was exhausting. The blown pony was already very tired, was crawling on the ground, trying to reach the his backpack. The blown pony smartmoby was crashing a lot, making a lot of weird noises.",
        "type": "action"
    },
    
    {
        "value": "Hey? Calm down. I'm here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny showed a regret look as he saw the blown pony struggling to get his backpack. So Vinny took the backpack.",
        "type": "action"
    },

    {
        "value": "I...I'm sorry it ended like this. I hope you understand that this was all a consequence of your choices.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny could see a little bit that the blown pony is a unicorn, but his horn was already extremely damaged. The unicorn was no longer in any condition to present any threat to Vinny. His still kept trying to touch the backpack as if this was the last thing he could do.",
        "type": "action"
    },

    {
        "value": "N....no.........the.....the region...East....can't end.....p...please no.",
        "character": "Unicorn Soldier",
        "type": "dialogue"
    },

    {
        "value": "Vinny watched the unicorn's tears for a few seconds before looking at what was inside the bag. Vinny only saw a few items that seemed to be family memories, some damaged electronic devices. It was very difficult to identify what the rest of the other items were, as they were very destroyed.",
        "type": "action"
    },

    {
        "value": "R...Really. I'm so sorry about all this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was even more sorry, showing a little empathy. Rayane leaned her hoof on Vinny shoulder, talking calmly.",
        "type": "action"
    },
    
    {
        "value": "Vinny, all you can do now is just let them have his dignity during these last few life minutes. He don't have to suffer anymore for what happened.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y..yeah. It will really help me feel better.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled a little and delivered the family items to the blown pony's paw along with the backpack.",
        "type": "action"
    },

    {
        "value": "We're going to stop this now. Who told you to stand guard here? Do you have any last wishes?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The unicorn started to cry while hugging the items.",
        "type": "action"
    },

    {
        "value": "M...Marlon... wants to..s...save....the...the East region.....at all costs. M...arlon is our hero.",
        "character": "Unicorn Soldier",
        "type": "dialogue"
    },

    {
        "value": "The unicorn started coughing a lot, and during each cough he disintegrated a little more.",
        "type": "action"
    },

    {
        "value": "P..Please...s..save the east region. My family....along with...the entire east region. Don't leave us die alone.",
        "character": "Unicorn Soldier",
        "type": "dialogue"
    },

    {
        "value": "The unicorn tried harder and harder for conscience as his eyes closed more.",
        "type": "action"
    },

    {
        "value": "Y...Yeah. Don't worry, you can be at peace now. We will help your family and the east region. We'll find out what's really going on here.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "T...Thank you..t..thanks....I.....can already....feel.. ...the...the end.....Rainbow Queen.....is waiting...for....m...my soul...the..soul...m...my good soul. Y..yes...m..my soul.",
        "character": "Unicorn Soldier",
        "type": "dialogue"
    },

    {
        "value": "The unicorn was almost passing out completely, smiling a little as he slowly accepted the death that was coming.",
        "type": "action"
    },

    {
        "value": "We'll be here by your side until the end.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would place his paw on unicorn head, waiting for something to happen gently.",
        "type": "action"
    },

    {
        "value": "T...thanks....you...and........and Rayane....R..Ra...",
        "character": "Unicorn Soldier",
        "type": "dialogue"
    },

    {
        "value": "The unicorn would then finally pass out and stop reacting completely. Then this pony's smartmoby simply stopped working permanently while the body continued to slowly disintegrate. Vinny had a feeling that the pony's soul wasn't there anymore now. Then Vinny closed his eyes and breathed deeply for a few seconds before looking at Rayane.",
        "type": "action"
    },
    
    {
        "value": "It's the life, he knew you. Do you know who is?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took an empathic breath before answering.",
        "type": "action"
    },

    {
        "value": "No. I'm just popular as an urban legend. Nothing more.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hey Vinny. Please finish what needs to be done. We decided that we are going to take the train. We have to follow Hiroshi's advice now. Let the soul go where the soul needs to go.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 was crying a little before responding.",
        "type": "action"
    },

    {
        "value": "Why have we never seen Rainbow Queen? Why did she never show up again?! I always wanted to meet Rainbow Queen! It's really annoying to have only faith that something exists without being sure if it really exists. I get confused if Hiroshi is right or wrong about Rainbow Queen existence.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny and Rayane were a little surprised and just kept quiet watching the conversation.",
        "type": "action"
    },
    
    {
        "value": "Yes. Hiroshi is the last pony who claims to have seen Rainbow Queen in person for the last time. This is our mission to try not to let this legend die. You know how dangerous it is for a story to be erased from existence and no one else to know the origins themselves?",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Y...You're always repeating this to me. But yes, in a way you are right.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 replied a little sorry for what he said.",
        "type": "action"
    },

    {
        "value": "Rainbow Queen? W...What does all this mean?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Then Vinny looked at Rayane again.",
        "type": "action"
    },

    {
        "value": "Hey? How many times have you been in a situation like this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "M...me?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised to hear this, replying sadly.",
        "type": "action"
    },

    {
        "value": "Many times. Enough to learn to respect the end of every lost life.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little more surprised and responded.",
        "type": "action"
    },

    {
        "value": "I'm sorry for what you saw and heard at times like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugged Rayane and Rayane hugged back kindly. Rayane was very thoughtful about her past during the hug time.",
        "type": "action"
    },

    {
        "value": "If...if one day I die. I hope I can receive this same hug from my friend Rain.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "So Rayane rested her thoughts a little while Vinny took a deep breath and looked at the Guard 1.",
        "type": "action"
    },

    {
        "value": "Well, do you want the sniper back? You will need this at some point.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hm? Yes. But this is my reserve sniper in case I lose mine. You can keep the sniper for now.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "W..What? Are you sure?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised to see Guard 1's trusting him.",
        "type": "action"
    },

    {
        "value": "Yes. I trust you this time. We need to be together now.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "O...Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then everyone got up and started walking towards the train.",
        "type": "action"
    },

    {
        "value": "Well... Rayane is really trying to be a better pony. We could start a campaign to try to improve Rayane's mysterious reputation. Instead of a mysterious dangerous pony, we can change that to a mysterious friendly pony.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Rayane wiped away her tears a little and was a little surprised to hear that.",
        "type": "action"
    },

    {
        "value": "W..what?",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "Hmmmm... Better let everything as this is, Rayane can go back to being the mysterious at any time if she wants to. Who has to decide that is only her.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I know there will be a lot of ponies who will still question this, but we need to start this somewhere. We have no reason to exaggerate so much about Rayane. That's all we can try to do for her.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Rayane was more anxious to want to say something, so she finally decided to say something.",
        "type": "action"
    },

    {
        "value": "Wait! Make me less dangerous in everyone's eyes? Of course I accept!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane started to cry emotionally as everyone started to get into the train.",
        "type": "action"
    },

    {
        "value": "Oh? Wow! Heh! I'm very close to Hiroshi. It will be easy to convince him to create this campaign. You will remain mysterious, but at least everyone will be less afraid about you. When I find Hiroshi, I'll talk to him about this. Okay?",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Thank you very much! Thank you! That's a great start!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled excitedly as she answered and wiped her face. Vinny and Guard 2 were very surprised to see Rayane's sincere happiness.",
        "type": "action"
    },

    {
        "value": "If that's what you want, I will support you. I see it's something special for you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiles a little at Rayane in response as everyone finished getting into the train.",
        "type": "action"
    },

    {
        "value": "Yes. It's something very special for me. I still have to be careful with my popularity, but it will be great to know that not everyone will want to run away from me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane slowly calmed down and kept a look of hope.",
        "type": "action"
    },

    {
        "value": "Yes! Glad everyone is feeling happy again. So... the train is already waiting for someone to drive it.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 giggles a little while getting ready to go to the train cabin.",
        "type": "action"
    },

    {
        "value": "Yeah. But... Guard 1? What are your plans?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "This is the train that connects all stations in the bunker. Let's use this to go directly to where the magic relic is and finally find Hiroshi.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Rayane then finished feeling calm and went back to spying on the subject of the conversation when she heard the name \"Hiroshi\".",
        "type": "action"
    },

    {
        "value": "Hiroshi? Will Hiroshi be there? There's something really weird, did he go through those ponies without killing?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Hiroshi probably passed through here by force. And these ponies were just here to prevent the station from receiving reinforcements. So it's important that we find Hiroshi alive. I wish you two a good travel. I'm going now.",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious, but didn't know what to say. So he just made a simple answer.",
        "type": "action"
    },

    {
        "value": "Okay. Thank you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Then Guard 1 followed Guard 2 towards the train cabin. Vinny then looked at Rayane for a few seconds.",
        "type": "action"
    },

    {
        "value": "So it's you and me inside a train journey.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was feeling fine, but she was still a little worried about Hiroshi.",
        "type": "action"
    },

    {
        "set": {
            "playEffect": { "file": "train-1", "enabled": false }
        },
        "value": "Heh. Yes. A long journey. Me and you only~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "bad-mystery",
            "playEffect": { "file": "train-1", "enabled": true }
        },
        "value": "Vinny giggles a little in response as he waited for the train door to close. The train slowly started to move. Vinny would then look out the train window and watch the bodies of the dead ponies on the ground. Vinny took a deep breath, reflecting on the situation, feeling the same cold wind he was feeling some minutes ago.",
        "type": "action"
    },

    {
        "value": "Yeah yeaaaaah... Sorry ponies. I hope someone helps you find the peace you want.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was still watching the dead ponies on the ground. But Vinny felt as if he had seen a shadow of a pony far away watching him. This shadow belonged to a very familiar alicorn.",
        "type": "action"
    },

    {
        "value": "What?! She again? I...Is this really her again?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Then Vinny was interrupted by Rayane.",
        "type": "action"
    },

    {
        "value": "Vinny? What are you doing?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ah? Hi charming Rayane! Sorry. I got too distracted by the window.",
        "character": "Vinny",
        "type": "dialogue"
    }, 
    {
        "value": "Silly you~ This took you long enough to make me want to boop you.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "A..ah? Ah! I had a weird feeling, we just killed some ponies, don't you think this might get a certain someone's attention?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was even more worried as he watched the mysterious shadow watching him. So Vinny just closed the train curtain and sat next to Rayane.",
        "type": "action"
    },

    {
        "value": "Someone? Who would this someone be?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised, trying to look through Vinny's behavior to try to understand who he was talking about. So Rayane came to a conclusion and said.",
        "type": "action"
    },

    {
        "value": "You do not need to be afraid. She knows how to recognize the causes of each pony's death. What she really doesn't like is selfish death.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny then tried to remain calm during the conversation, and Rayane slowly began to understand what was really going on.",
        "type": "action"
    },

    {
        "value": "Yeah. I don't know if she'll like to see me. You was killing ponies around. By the way, I think if I die, a lot of bad things will happen to me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then laughed very nervously in response.",
        "type": "action"
    },

    {
        "value": "We didn't get along well at first time.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane would get a little worried, but then Rayane would try to distract Vinny's worry a little.",
        "type": "action"
    },

    {
        "value": "If she doesn't like you, she must be watching you~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane slowly started talking more seriously to try not to scare Vinny.",
        "type": "action"
    },

    {
        "value": "I don't worry too much about this. She knows me more than you can imagine. She knows the reasons I'm here. She is in a very bad mood only. Maybe the things will get better at some special moment.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny giggles nervously for a few seconds before getting curious and a little worried.",
        "type": "action"
    },

    {
        "value": "You need to protect me if she try to attack me. She was really mad at me and very suspicious. But you can save me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny was surprised to remember another part of the dialogue.",
        "type": "action"
    },

    {
        "value": "Wait... Is she watching me? W...what is this? What does that mean? Is this some friendship ritual?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little sadly, before answering.",
        "type": "action"
    },

    {
        "value": "Shhhhhh~ Silly, don't confuse her anger with her natural evil side. Who do you think I learned to play my malicious pranks on?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little worried during the conversation again.",
        "type": "action"
    },

    {
        "value": "Just be careful during your decisions, she analyzes the behavior of those who talk to her a lot.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then even more curious to hear about this.",
        "type": "action"
    },

    {
        "value": "Hmmmmm... Rayane? Anger and the evil side aren't they the same thing? Well, I told her that we are friends then I mentioned your photo album, which had a photo of us there. Does she have access to this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a few deep breaths before responding in a friendly and a little emotional way.",
        "type": "action"
    },

    {
        "value": "Anger is a feeling, evil side is a personality. She's a little crazy. I don't want you to go crazy because of her personality.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Rayane remembered the mention of the photograph, doing her scared.",
        "type": "action"
    },

    {
        "value": "W...What? What did you do? Photographs are restricted technologies. She will think you are someone who has had some privileged information without permission!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was then startled by Rayane's reaction and tried to respond more calmly.",
        "type": "action"
    },

    {
        "value": "Hey! Calm down! That was just a photograph. What could go wrong?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "if she thought you were an spy, she wouldn't think twice about punishing you in some way. I hope you didn't unintentionally give her a bad impression.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face of pure nervousness, rubbing his head nervously.",
        "type": "action"
    },

    {
        "value": "C..can you save me? I don't want to die. FUCK! I'm going to die 2 times. Celestia! Luna! Save me!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was curious to hear these two names, but she simply ignored everything and continued the conversation.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "You just need to be careful. She knows how to be a predator. She won't give you any chance of escape.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was still nervous, but tried to respond more calmly.",
        "type": "action"
    },

    {
        "value": "A..ah? But she seems to like you a lot. Can't you tell her I'm not a bad pony?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane breathed deeply for a few seconds. Rayane showed depressive behavior, but tried to hide this.",
        "type": "action"
    },

    {
        "value": "Yes. But don't forget. Her empathy won't work the way you'd expect.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets confused and a little worried.",
        "type": "action"
    },

    {
        "value": "What do you mean about it?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Don't you remember? She wants to save Pony Driland. But I don't want her to be too brutal in doing this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "...AH.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Vinny goes white with fear when he hears this.",
        "type": "action"
    },

    {
        "value": "Fine.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "set": {
            "playEffect": { "file": "train-1", "enabled": false }
        },
        "value": "Then suddenly the train tried to stop, causing Vinny and Rayane to be thrown to the ground accidentally.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "tense-mystery"
        },
        "value": "AAAH!",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "Rayane positioned herself to fall backwards against the train wall by instinct due to surprise. But Vinny wasn't so lucky and just tried to get up during the process.",
        "type": "action"
    },

    {
        "value": "FUCK! A moment I'm seeing the floor texture up close!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "This is not texture time! What hell was this?!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The train then stops braking definitively, finally maintaining a calmer environment.",
        "type": "action"
    },

    {
        "value": "A...Ah? Let's calm down. It seems that despair is over.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looked towards the Guard 2 voice that began to be heard in the distance.",
        "type": "action"
    },

    {
        "value": "HEY! Everyone is okay?!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked up and saw Guard 2 next to the cabin door doing a worried look.",
        "type": "action"
    },

    {
        "value": "Well, except that my face hit the floor, yes. What happened here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "S..sorry! We found something blocking the way. We almost crashed the train. Hope no one got hurt.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Ah? Blocking the way? This sucks. Maybe we'll find more surprises.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little worried as she got up determined to find out what this is. Vinny was surprised and not sure how to react.",
        "type": "action"
    },

    {
        "value": "A...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny looks around analyzing everything.",
        "type": "action"
    },

    {
        "value": "Okay? Any plans?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes! Someone needs to to go outside and see what's going on. We can't stand here for long. This could be time for some intruder to get on the train.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny makes a poker face and noticed that the outside was very dark, could not see any station presence.",
        "type": "action"
    },

    {
        "value": "Okay okay. I have a hat with a flashlight. This hat will help me, but this will attract attention. Who will go with me to see what is happening?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane then looked worriedly at Vinny and said.",
        "type": "action"
    },

    {
        "value": "Nope~ I won't leave silly Vinny alone. I'll go with you. I can use my teleport skill to make us appear somewhere randomly.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane without thinking twice, started to prepare the teleportation magic.",
        "type": "action"
    },

    {
        "value": "W..What? That's a risky and quick decision! I'll be watching the train cars while my friend guards our cabin.",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Vinny then looked at the Guard 2 a little worried, but realizing he had no other choice and decisions needed to be quick, Vinny accepted the situation.",
        "type": "action"
    },

    {
        "value": "Be very careful you two! Not wanting to take advantage of the moment but you two will be alone and in the dark. Maybe no one will see what you two are doing together in!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a Lenny Face.",
        "type": "action"
    },

    {
        "value": "A...Ah?",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Guard 2 was embarrassed for a few seconds until Vinny was interrupted by Rayane.",
        "type": "action"
    },

    {
        "value": "Shhhhh~ Vinny, now it's time for us to work. Are you ready for our dark place too?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane does a silly, smirk face while her horn showed that the teleportation magic was ready. Vinny would get a little embarrassed too, but then quickly get back into focus.",
        "type": "action"
    },

    {
        "value": "I...I was born ready! Let's go.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny put the flashlight hat on his head while Rayane giggles a little in response.",
        "type": "action"
    },

    {
        "value": "It's ok. Let's go~",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "So Rayane finally used teleportation magic to teleport her and Vinny to the top of the train car. Vinny was a little surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "A..ah? This really was very random.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ Now let's keep silent.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny and Rayane was quiet and looked around for a few seconds until then Vinny located a other train car in the middle of the darkness. This train car was abandoned and was getting in the way of the train.",
        "type": "action"
    },

    {
        "value": "Hey, Another train car here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yeah. This is very suspicious. it's still not a good idea for me to use my magic to try to discover the presence of whoever is here.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane then spawns her sword, getting ready for any danger situation. Vinny was a little curious about this.",
        "type": "action"
    },

    {
        "value": "Fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "So Vinny prepared the sniper and went carefully to investigate the place. Vinny moved slowly to keep still on top of the train car. Everything was very quiet, and all Vinny could see was the abandoned train car. This abandoned train car did not have any lighting.",
        "type": "action"
    },

    {
        "value": "Hmmm.. Want to go to the abandoned train car?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little surprised and worried.",
        "type": "action"
    },

    {
        "value": "I will stay here to keep you safe. You can go ahead.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane focused her magic even more on the sword and at the same time a second magic, but this made her go much slower than usual. Vinny was worried when he noticed Rayane's effort.",
        "type": "action"
    },

    {
        "value": "H..hey. Calm your magic. Do not worry about me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhh~ Don't worry about me. It'll just slow me down while I'm doing it.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny then just kept quiet and looked around again. Vinny would then jump to the ground and turn on his hat's flashlight.",
        "type": "action"
    },

    {
        "value": "Well... What do we have here then?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started to get very curious when he started to hear a strange sound of magic coming from inside the abandoned train car. Vinny was surprised, but still very curious, wanting to find out what was going on.",
        "type": "action"
    },

    {
        "value": "There's a faint magic sound coming from the train car.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Hey. Vinny, be extremely careful. Don't make any sudden movements. This could be a trap.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Fuck...",
        "character": "Vinny",
        "type": "think"
    },

    {
        "set": {
            "playlistPlay": "dark-and-mysterious-ambient"
        },
        "value": "Hmmm. Okay okay. Let's try.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would get very nervous and look directly at the abandoned train car, starting to try to get even closer slowly.",
        "type": "action"
    },

    
    {
        "value": "H...Hey? Anyone there? If no one moves. I'm going to throw a grenade in there!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then pointed the sniper towards the train car while waiting for some reaction, but nothing interesting happened. Everything was pretty quiet, making Vinny feel disappointed.",
        "type": "action"
    },

    {
        "value": "Hm?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny would then pick up a rock from the floor and throw it into the train car. But nothing happened, only the relaxing sound of weak magic continued to be heard. Vinny was slowly starting to feel calmer, not knowing what was going on.",
        "type": "action"
    },

    {
        "value": "Really? Will it be the hard way?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Okay! I'll go ahead now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was slowly approaching the window of the train car while holding the sniper, watching if there was anything. Rayane was starting to show concern to see Vinny's action.",
        "type": "action"
    },

    {
        "value": "Vinny? Come back here! Be careful what you hear.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny ignored Rayane's warnings and kept looking inside the train car. The place looked pretty abandoned a long time ago. But Vinny could still see the body of a large unicorn lying on the ground. Vinny couldn't see if he was alive or not. The relaxing sound of magic continued, but this time it got a little louder, making Vinny understand that maybe it could be some magic leak.",
        "type": "action"
    },

    {
        "value": "R...Rayane? This sound is very strange. And it's also very relaxing. What can this be? Are you feeling something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane then began to suspect something and became more worried.",
        "type": "action"
    },

    {
        "value": "W..What? O..Oh no.",
        "character": "Rayane",
        "type": "dialogue"
    },


    {
        "value": "Rayane tried to keep quieter, worried about a possible trap. Vinny tried to move, but Vinny's movements were much more relaxed than usual, making his movements very slow.",
        "type": "action"
    },

    {
        "value": "W...What? F..fuck! Teleport us to the guards!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny's voice was also weaker, making it difficult for him to speak. So Vinny would start to lie down inside the train car, trying to find some good alternative to moving.",
        "type": "action"
    },

    {
        "value": "But what the fuck did I get myself into!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was trying to keep moving, but Vinny was starting to feel very sleepy. The sound of Vinny's body laying on the floor then seemed to be causing some reaction inside the train car.",
        "type": "action"
    },

    {
        "value": "R..Rayane? Remember when you made my smartmoby weak? H...help me...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane remained quiet, maintaining a defensive stance, very worried about what could happen to Vinny. But still, Rayane kept her focus.",
        "type": "action"
    },

    {
        "value": "W...why me?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny seeing that he had no other choice, he tried to look at the mysterious unicorn's body to lighten the place. Vinny saw the big unicorn shadow. He seemed to be responsible for that. But he still didn't do anything to Vinny, it looked like he was analyzing what was happening.",
        "type": "action"
    },

    {
        "value": "Holy crap.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny tried to use the sniper, but only managed to make a random shot that scared the unicorn a little. At this same moment, Rayane suddenly used teleportation magic to bring Vinny to her. At the same time this shot also caught the attention of the guards, they got out of the main train car as quickly as possible.",
        "type": "action"
    },

    {
        "value": "That was close!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane hugged Vinny, trying not to let Vinny's sleepy body fall. Rayane then looked at Vinny's body, giggling a little before returning to the mission's focus.",
        "type": "action"
    },

    {
        "value": "You're safe now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane hugged Vinny, trying not to let Vinny's sleepy body fall. Rayane then looked at Vinny's body, giggling a little before returning to the mission's focus.",
        "type": "action"
    },

    {
        "value": "Yes! the shot came from here!",
        "character": "Guard 2",
        "type": "dialogue"
    },

    {
        "value": "Ah? Don't get on the train! Just point the guns!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The guards who were already arriving at the place. They pointed combat weapons towards the train car.",
        "type": "action"
    },

    {
        "value": "Hey you! Drop everything on the floor now and just get off the train car!",
        "character": "Guard 1",
        "type": "dialogue"
    },
    
    {
        "value": "The motherfucker is behind the train car, a big unicorn! BIG UNICORN!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Ssssh~ time for Vinny's body to be active again~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane stayed hidden on top of her train car while helping Vinny recover.",
        "type": "action"
    },

    {
        "value": "Don't touch anything! Stay right there!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "During the process, the guards finished capturing the mysterious unicorn. Vinny then took a deep breath, feeling better. Vinny giggles a little before replying.",
        "type": "action"
    },

    {
        "value": "Ah. I feel better. I could even kiss, but the situation is complicated.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Kiss?~ Don't talk as soon as the day arrives~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane smirks while helping Vinny finish getting up. Then Rayane used teleportation magic to teleport her and Vinny back to the ground.",
        "type": "action"
    },

    {
        "value": "You were just under the effect of sound drugs emitted by unicorn magic. This magic is not common.",
        "character": "Rayane",
        "type": "dialogue"
    },
    
    {
        "value": "The guards then bring in the mysterious unicorn. The mysterious unicorn was quiet, but then when the unicorn started to be illuminated by the light, its face and body started to become visible.",
        "type": "action"
    },

    {
        "value": "So it's... it's... W...WHAT FUCK?! it's Hiroshi?!",
        "character": "Guard 1",
        "type": "dialogue"
    },

    {
        "value": "Guard 1 is completely scared by the situation.",
        "type": "action"
    }

]