[

    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 3,
            "weather": "sun",
            "playlistPlay": "dark-ambient-melodies"
        },
        "type": "action",
        "value": "So Rayane and Vinny were getting ready to leave the cave. The path is a long way across an open field surrounded by forests all around. A tremendous smoke could be seen in a long distance coming from a village a little far away. Some forests around were on fire, and smoke from explosions could be seen all around. Vinny was very surprised by everything he was seeing."
    },

    {
        "value": "Wooow... O..okay, wherever you go, I'll go too. If you go to hell I will too!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started following Rayane. During the progress Vinny tried to fight his worry. When Rayane noticed Vinny's behavior, Rayane looked a little worried at Vinny.",
        "type": "action"
    },

    {
        "value": "Vinny... Remember that this is not training. If someone attacks you, nobody won't pity you the way I did. Alright? We just need to check out the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to enter the forest slowly, following the trail of smoke. Vinny tried to remain confident.",
        "type": "action"
    },

    {
        "value": "Y..yes. This time I don't have my little pot with sand or dirt, but I have my wings and I know how to fly. You can be calm about me. I know how to take care of myself in more delicate situations like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried when she thought about Vinny's actions.",
        "type": "action"
    },

    {
        "value": "Everyone here can have one sword or firearms. Please, be really careful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried while using magic to wear herself the protective armor. Vinny was a little surprised to see Rayane's armor. But then Rayane looked into Vinny's eyes, feeling a little guilty.",
        "type": "action"
    },

    {
        "value": "N..no no... He really won't just follow me around if I try to take the safest path. If I try to change his trajectory, he'll find out.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "V..Vinny. I...I can't see you like this. You really need armor. But I only have one unicorn armor left. You won't be able to use your wings when you're wearing the armor.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious about Rayane's change in behavior.",
        "type": "action"
    },

    {
        "value": "What? Won't that bother you? Do you think it's safer for me to wear the unicorn armor?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhh, don't worry. It's my old armor that I used during my life before I got my current armor as a gift. Please take good care of this armor and stay safe. I don't want to see you being ripped in half.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets a little scared, but Rayane felt calmer when she used magic to start spawning the ancient armor on Vinny's Body kindly.",
        "type": "action"
    },

    {
        "value": "O...oh wow. Thanks Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled and hugged Rayane gently in response when he felt safer by the armor.",
        "type": "action"
    },

    {
        "value": "All right then! I am going to follow you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little more while hugging back. Rayane was feeling better and more comfortable seeing Vinny feel safe.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Take good care of the armor~ When we find a store, we'll buy a backpack similar to James's backpack. Then you will have less problems with weight on your back.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh! Yes charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {

        "value": "Rayane does a little giggles then slowly resumed walking to give Vinny time to get back into the rhythm of the adventure. Meanwhile, high above the clouds was Rainbow Queen and the mysterious unicorn. The mysterious unicorn was wearing a special boot for her paws to stay on top of the clouds. Rainbow Queen seemed to be watching all the conflict that was going on in the mysterious village. Rainbow Queen's gaze was very serious, she didn't seem to be satisfied with what was happening.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "War never changes. War is such a ridiculous thing. Are you seeing this? Two ponies trying to be heroes, such a ridiculous and absurd fantasy. Hiroshi will not have the mental balance for this war.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn would get a little scared.",
        "type": "action"
    },

    {
        "value": "B...But he said this time he was going to try something better. And the Elite Color was going to try to control the balance of the war.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh.",
        "type": "action"
    },

    {
        "value": "What? Elite Color? Do you still trust the Elite Color?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh. The mysterious unicorn then became a little more insecure and tried to respond in a more determined way.",
        "type": "action"
    },

    {
        "value": "Y..Yes. Elite Color has always been something very important to all of us! This dimension urgently needs to expand the energy! Our dimension will become a real strong dimension! Isn't that what you want?",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen took a deep breath and responded disappointedly. Rainbow Queen looked a little angry as she started to respond. The mysterious unicorn then walks backwards when realizing Rainbow Queen's anger.",
        "type": "action"
    },

    {
        "value": "We don't need to kill many ponies to get souls to sustain this dimension. And a war was the worst choice you all ever made.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn slowly gets a little more intimidated as she saw the Rainbow Queen's sinister gaze from the hatred.",
        "type": "action"
    },

    {
        "value": "S...sorry. I know you have empathy for souls. I'm sorry!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "When this war is over, I'm going to want to have a very private conversation with Hiroshi and Marlon. I hope Marlon doesn't get scared when he sees a divinity for the first time.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn gets very surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "Y..Really? Are you really going to do this? You've always said that it's dangerous for normal ponies to discover the identity of gods.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen did a sinister little smirk before replying while the scythe poked the mysterious unicorn's neck gently for a few seconds. The mysterious unicorn then \"froze\", just shyly looking into the Rainbow Queen's eyes.",
        "type": "action"
    },

    {
        "value": "Shhhh~ Do you really think everyone in this world will believe that someone has seen a goddess? This world still needs more maturity to understand the existence of gods. We don't want the same mistakes to happen again.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. This is true. T...The true.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Good~ Very good~ Then you are free again. You can go back to your \"fun\".",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": " Just don't forget. You still have a chance to do something better.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": "Meanwhile, Rayane and Vinny is walking through the forest. So Rayane would stop for a while to look carefully around if there was no one around.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "tense-mystery"
        },
        "value": "Okay. I need to trust you that no one will show up while I use my magic again just like other time when we left the cave. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to remember the moment where Rayane was using this ability.",
        "type": "action"
    },

    {
        "value": "W...what? Do you want me to keep looking around?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I'm vulnerable when I'm using this spell, will you help me look around. If something happens, let me know and I'll react.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane came back into concentration to perform the mysterious magic again. Then Rayane's mane would slightly start to swing during the progress.",
        "type": "action"
    },

    {
        "value": "O..okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny worried, but he worked hard to stay focused. Rayane was very focused on Vinny's reactions as a warning reference. But Vinny didn't realize that. So Vinny heard the noise of hooves moving around. Vinny and Rayane liten to the very small sound of someone groaning in pain. Vinny start to talk very quietly so as not to distract Rayane.",
        "type": "action"
    },

    {
        "value": "Yeah. I can hear someone groaning in pain.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was still concentrating on magic and was slowly finishing magic progress when she heard Vinny's voice. Vinny could just see a leaf finishing doing some movement that maybe could be suspicious.",
        "type": "action"
    },

    {
        "value": "Oh no. This is not good.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh... Looks like there are some ponies around. But I don't know if the ponies are allies or enemies.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little worried as she concentrated on looking around.",
        "type": "action"
    },

    {
        "value": "Y..yeah. I had a slight feeling that someone is here. Maybe this is a trap.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes yes. We must already be inside some possible trap. Don't worry about it.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane replies as she started to spawn the sword. Vinny's eyes widen in surprise as he realizes the situation is getting serious.",
        "type": "action"
    },

    {
        "value": "Oh shit.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was feeling nervous, but watched around waiting for something. Vinny and Rayane didn't see anything. Just hear the sound of some body being left on the ground. Rayane looked a little intimidating to try to show that she was focused on the danger.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "O..okay. I felt someone moving there.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny points toward the place where he had the sensation of someone moving. It was a place with a lot of tree leaf, making it difficult to see the place. Rayane laughed a little while her horn glowed a little stronger, making her sword go up in flames as she prepares the attack.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "battle"
        },
        "value": "Yes. But this is not the only place. But good tip for us to start the fun~ Use your wings to throw my fire around. Alright?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and just moved his face in agreement.",
        "type": "action"
    },

    {
        "value": "Ok ok.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took off his armor a little, just so the wings were free and prepared to fan in order to help Rayane's plan.",
        "type": "action"
    },

    {
        "value": "Ok. it's now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The sword rotated forward, throwing some of the fire's combustion towards the trees. Vinny was a little more surprised, and reacted without a second thought. Vinny leaned over and started flapping his wings enough until he realized that the fire generated by Rayane was taking the path. Then when the fire reached the place. Suddenly more trees was wiggling, revealing a surprise attack from all directions made by arrows.",
        "type": "action"
    },

    {
        "value": "Get down now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "WHAT THE FUCK IS THAT?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane pulled Vinny to the ground while the sword start to spin violently, making the sword change the direction of rotation to horizontal, hitting the arrows in sequence.",
        "type": "action"
    },

    {
        "value": "WHAT A CRAZY SWORD!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny rolls a little. So Vinny gets up and starts to beat his wings with a little more intensity. The fire began to expand in a circular shape in the form of a ring, starting to catch fire in the other trees around, making whoever was there start to move away.",
        "type": "action"
    },

    {
        "value": "Yeah! You're doing well! We need to have a plan to react now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's take advantage of them moving away. I'll fly up and you prepare a teleport in my direction.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at the armor during some seconds.",
        "type": "action"
    },

    {
        "value": "I won't need the armor for now. Everypony here probably have firearms.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "V..Vinny? Be careful! You are an easy target while flying up.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little worried and then stopped spinning her sword. Rayane was very focused, starting to charge the teleport. Vinny waited for the fire to disappear before start to fly up.",
        "type": "action"
    },

    {
        "value": "Don't worry. I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up getting ready to fly forward in order to follow the plan to surprise the ponies that were in the front. Vinny could escape the situation. And everyone hardly noticed his attempt to escape. Then at the same time Vinny landed, Rayane appeared next to Vinny, helping Vinny put the armor back on.",
        "type": "action"
    },

    {
        "value": "Wow! It really worked!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane feels satisfied with the result, did not think twice and made the sword go up in flames again, preparing to do the first action that comes to mind.",
        "type": "action"
    },

    {
        "value": "Yeah! Block the way with your sword! You can make a fire barrier!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Barrier? Heh, good idea~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane used the fire sword to rip the earth floor, making all the trees that were close start to catch fire.",
        "type": "action"
    },

    {
        "value": "Let's get out of here Vinny! We'll have time to run away now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane quickly started to run very fast in a straight line.",
        "type": "action"
    },

    {
        "value": "AAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny followed Rayane, trying hard to keep the same speed as Rayane. Suddenly a unicorn sniper pony that was behind a tree tried to shoot Vinny, the shot passed grazing Vinny a lot, and at the same time Rayane used the sword and cut the sniper barrel, surprising the sniper. Vinny was a little scared, but he tried to laugh at the danger to calm himself down.",
        "type": "action"
    },

    {
        "value": "W...WOOOW!! IIIHAAAAAAA! YOU NEED TO IMPROVE THAT SIGHT YOU BLIND!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...WHAT?! RAYANE?! AH! FUUUCK!",
        "character": "Sniper",
        "type": "dialogue"
    },

    {
        "value": "The sniper fall to the ground and end up. The pony stayed behind and disappeared over the horizon.",
        "type": "action"
    },

    {
        "value": "Heh. Your head was nearly blown off. Are we going to hide or enter the village by force?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's hide! if we go through this, James and Jeff will too, let's hide somewhere and make a better plan than going out screaming!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little curious and laughed a little and answered.",
        "type": "action"
    },

    {
        "value": "Okay. I'll have to do this on the hard way. Get on my back and hold on tight!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane for a few seconds, laughing a little.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny climbs on Rayane's back.",
        "type": "action"
    },

    {
        "value": "That's not how I wanted to climb on you for the first time but I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh. Be careful not to fall~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane increased her speed in a much more extreme way and used the trees as platforms to parkur on the trees.",
        "type": "action"
    },

    {
        "value": "WOOOW!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "When Rayane got to the top of the trees, Vinny accidentally fell off her, so Vinny had some chance of trying to hold on to the tree slacks during the progress",
        "type": "action"
    },

    {
        "value": "RAAAYANE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny holds the branch, doing a POKER FACE. Vinny soon felt a magic levitating his up, Rayane was balancing on the top of the tree, trying to bring Vinny back towards her.",
        "type": "action"
    },

    {
        "value": "Sorry Vinny. Let's get out of here!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Aah... Don't worry, it's dangerous for us to stop here. I'll fly to the village. You can try to find me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny stepped onto the top of the tree and got off Rayane's back slowly. Rayane gets worried during the talk.",
        "type": "action"
    },

    {
        "value": "Fly? Don't fly too high or everyone will see you. If something happens, shout it out loud. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "It's going to be okay, charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane just smiles a little, trying to trust Vinny. So Rayane went back to parkur between the trees towards the village.",
        "type": "action"
    },

    {
        "value": "Vinny smiles and flies up. Vinny flew at high speed, trying to keep a good distance away from being noticed. Vinny started to see some other pegasu flying in the sky towards the village, it looked like the pegasus was holding something medium sized black on his back. Vinny tried not to get too close to the pegasus, Vinny just stared at the pegasus for a few seconds.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "W...What? Is this another bomb?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny could see the smoke from the previous confusion. Then Vinny would hear a sound of ponies entering the forest. And at the same time Vinny also hear the sound of something falling from the sky. It looked like the mysterious pegasus had hurled the mysterious black object. Vinny tried to get a better look at what it was. So Vinny realized that yes, the item is a bomb.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "OH MY GOD! OH FUCK! OOH FUCK! NOO!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny came down from the tree but being careful to the ground and tried to look more at the crowd. Vinny saw several ponies that were running desperately. Vinny saw a few more soldier ponies familiar with the ones Vinny saw during the trap, but the soldiers weren't even caring about Vinny anymore. Vinny saw something that looked like Rayane towards the wall.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "escape"
        },
        "value": "OH NO NO NO! RAYANE!!! SHIT! RAYANE NEED YOU!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies toward Rayane desperately, but Vinny felt a magic pulling his quickly to the side of the wall.",
        "type": "action"
    },

    {
        "value": "Vinny! This is good see you again! What is happening?! I heard ponies screaming that the village is going to be completely destroyed!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looks scared by the situation, trying to understand what is happening. Vinny gets nervous as he began to respond.",
        "type": "action"
    },

    {
        "value": "M...Maybe the black bomb I saw falling from the sky is something? I saw black bomb falling in the middle of the city. Please, look for a military or someone you think is involved in the invasion. We'll force this pony to talk about the bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Bomb?! Are you crazy?! My teleport takes seconds to charge! This is madness! You don't know the destructive power of this bomb!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Calm down! Calm down! Rayane, I can fly to the bomb and look myself. I'll be fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "How do you say that if you haven't finished your first training?! VINNY! NOOOOO!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies over the wall. Vinny kept a high speed to try to reach the bomb as fast as possible. Vinny saw the bomb entering the center of the village. Vinny realized that all the destruction was more focused on the center of the village than all the rest of the village. Vinny was getting tired very fast from flying so fast, but Vinny was very dedicated to trying to use as few seconds as possible.",
        "type": "action"
    },

    {
        "value": "Come on! It's going to be easy! Imagine that we are playing CS! Come on Vinny!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny were feeling more and more tired. The center of the village was very much destroyed with a huge crater in the ground. The bomb was about to land in the center of the crater. Vinny then saw the bomb. The place was extremely insulated due to evacuation.",
        "type": "action"
    },

    {
        "value": "WOW! OK I understand. This explains a lot of the noises I heard in the cave.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny landed next to the bomb and try to analyze the stuff. The bomb was starting to pierce the ground. Vinny was desperate to see that the bomb was starting to disappear into the ground.",
        "type": "action"
    },

    {
        "value": "What the fuck is that?! No! COME BACK HERE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried in various ways to stop the bomb process. As the bomb sank deeper and deeper into the ground, Vinny thought about using the pickaxe piece, but couldn't find time to come up with a plan.",
        "type": "action"
    },

    {
        "value": "FUCK FUCK! FUUUUCK! I'm FUCKED! AH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up and start screaming loudly for help.",
        "type": "action"
    },

    {
        "value": "IS ANYONE HERE?!?! THIS PLACE IS GOING TO EXPLODE!! I CAN TAKE YOU OUT OF HERE!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny accidentally finds Rayane running in the middle of the village, looking for something. Vinny saw lots of pony bodies lying on the ground and some gun remains lying around, but Vinny couldn't be sure if the guns could be working or not. Vinny was scared and worried for a few seconds.",
        "type": "action"
    },

    {
        "value": "O..oh god. This looks a lot worse than I imagined. R..Rayane? Holy crap! Rayane!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to fly towards Rayane in an extremely desperate way.",
        "type": "action"
    },

    {
        "value": "RAAAYANE! The time is almost zero! if you have something it's now! The bomb already started digging down! if you have any plans it's now or never!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "NO! Calm down! I had a plan ready! Let's use the plan now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane showed a a mysterious military pegasus. The pegasus was desperate and tired.",
        "type": "action"
    },

    {
        "value": "Wow! You are really quick at your task.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane invaded a basement door of a random house and entered this quickly. Vinny without a second thought, helped carry the mysterious pegasus while following Rayane. Vinny was extremely scared and regretful.",
        "type": "action"
    },

    {
        "value": "Rayane! You can use your teleport. S..sorry. No matter what happens, it's my fault. I brought you here. Do your best!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath, trying to keep calm, and just gave a slight serious look.",
        "type": "action"
    },

    {
        "value": "Please Vinny. This is no time to be sorry. Pray for everything to be on time. I'm trying to make your plan work.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Y...Yes...yes. S...sorry Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very worried and kept quiet. Vinny tried to keep all his hopes on Rayane. Rayane was very dedicated to keeping her focus on magic as much as possible during the progress.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "nuclear-sound"
        },
        "value": "Sssssh~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "AH! AAAAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then suddenly all the sound around was interrupted by an extremely deafening explosion sound. Everything around was extremely bright, Vinny was trying to maintain consciousness while Rayane tried to protect him, but Vinny passed out in the process.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "R...Rayane? H...hello? R..Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny's ears were ringing very loudly. It looked like Vinny's hearing was finally starting to recover the ringing as he woke up. The flash was calming down, Vinny was on the ground next to many burnt objects around.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "dark-ambient-melodies"
        },
        "value": "Hello? R..Rayane? Somebody?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very scared, worried, trying to look for Rayane and the pegasus. A few minutes passed, but Vinny finally found Rayane, she was alive, but extremely weak.",
        "type": "action"
    },

    {
        "value": "N...Nooo! R..Rayane? RAYANE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny realized that Rayane tried to combine teleport magic at the last minute along with the force field. Rayane's horn was very damaged from the process. Next to Rayane was the mysterious pegasus that was still alive, but also passed out. Vinny vision was returning back more and more.",
        "type": "action"
    },

    {
        "value": "Hey, Rayane? Rayane, are you okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugged Rayane gently, trying to wake her up. Vinny was very worried that Rayane was slowly losing more energy and Rayane's SmartMoby was starting to fail. But Vinny smiled when he saw that Rayane's eyes were moving.",
        "type": "action"
    },

    {
        "value": "V..Vinny? I... I'm fine. It's great to see you again.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to cought, trying not to breathe too much smoke from the explosion.",
        "type": "action"
    },

    {
        "value": "I... I had to use a lot of magic. I just need to rest.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to keep eyes open due to extreme tiredness while hugging Vinny back slowly. Vinny then helped Rayane to slowly close her eyes.",
        "type": "action"
    },

    {
        "value": "R..Rayane. Don't worry, you can rest here, I'll take care of you and the other one here. Stay here while I go check out what happened. Okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little and just accepted to keep her eyes closed and fainted again slowly. Vinny put Rayane on the bed delicately. So Vinny looked around trying to know where he was. Vinny see a huge smoke blocking the sunlight. Everything looked darker and it was very windy. But Vinny realized that his were close to the village wall which was well damaged from the explosion. Vinny gets extremely surprised and very curious as he looked around again.",
        "type": "action"
    },

    {
        "value": "B..But how did I survive it? What really happened here?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny would go back to the basement of the house. Vinny take the spray and use this on Rayane horn slowly. Vinny was still worried about Rayane. But Vinny tried to keep hopeful.",
        "type": "action"
    },

    {
        "value": "R..Rayane. It's gonna be okay. I promise.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny wear the miner helmet and got up slowly, looking around again while breathing deeply, trying to find some new shelter. Vinny would only find many houses without roofs or with half roofs. So Vinny starts to see a extremely deeper new crater on the village center.",
        "type": "action"
    },

    {
        "value": "W..what? It's the same crater. Was this all an excavation?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny went back to the basement and look for some rags, clothes, or anything to hold the mysterious pegasus. Then Vinny smiled as he looked at an abandoned wardrobe, then he opened the wardrobe.",
        "type": "action"
    },

    {
        "value": "That was good luck.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny could only find cloths of possible clothes and some pieces of some firearm.",
        "type": "action"
    },

    {
        "value": "Hoho!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny picked up all the rags possible and the rest of the weapon, but focused on the rags. Then Vinny would go back to where the mysterious pegasus was. The mysterious pegasus was still unconscious. Vinny ties up the pegasus to make sure it doesn't escape.",
        "type": "action"
    },

    {
        "value": "Okay. I think that's enough for him not to hurt Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walked over metal pieces, wood scraps, and other burnt materials on the floor. Vinny finally came back to the surface again and looked up at the sky. Now the sky was a little more visible, and Vinny could see that there were still some fireballs that had flown into the sky, falling over some parts closer to the center of the village.",
        "type": "action"
    },

    {
        "value": "Oh god...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walked a little further through the destroyed village area. Vinny watched the dead bodies on the floor, trying to find any usable items. During each walk, Vinny felt uncomfortable seeing each dead body. Many of these bodies were slowly disintegrating. Vinny saw that instead of blood, the bodies had pixels coming out of the bodies.",
        "type": "action"
    },

    {
        "value": "Wow! If this was supposed to be some censorship, it's just getting more bizarre.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "After a few minutes, Vinny was in a place where there were few houses, as many houses were completely destroyed by the explosion. Vinny picked up as many clothes as possible from the corpses and made sure there wasn't any melee weapon nearby like a knife or a spear.",
        "type": "action"
    },

    {
        "value": "This place is very depressing. Where are all the survivors?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then decided to go back to the basement where Rayane was, and during the progress, Vinny saw some mysterious shadow of a possible pegasus in the place, but the mysterious new pony was head down and sad. Vinny was completely surprised and curious. And he slowly watched the situation.",
        "type": "action"
    },

    {
        "value": "O...Oh fuck! I just opened my mouth! Who is this time?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny then walked slowly towards the shadow, Vinny heard a female voice crying and lamenting a lot. This voice seemed to be sad, but very full of hatred for something.",
        "type": "action"
    },

    {
        "value": "N..no...it's not possible. These two ponies are annoying! They just make wars!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Wait. This voice. That voice is very familiar.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny had a slight strange sensation of feeling a small cold wind coming from the directions of the dead bodies on the ground. It seemed to be some energy, but unfortunately Vinny could only feel this, Vinny couldn't see this.",
        "type": "action"
    },

    {
        "value": "Oh? T...That feeling. This is getting a little scary. But I think I'm getting what's going on here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny was a little scared, and just kept walking towards the voice. Vinny tries to see if Rayane was okay during the progress. Vinny walked carefully, very curious when he started to feel a light coming from the basement.",
        "type": "action"
    },

    {
        "value": "O..oh no.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny left clothes and knives outside before entering the basement slowly. Vinny could see a little more of the shadow forming in an alicorn shape. The shadow was very familiar. Then Vinny realizes it's Rainbow Queen. Rainbow Queen was trying to do something with Rayane.",
        "type": "action"
    },

    {
        "value": "W...what?! You again! Who are you?!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Shhhhhhh~ Calm down Rayane. I didn't expect to find you here. I promise to take revenge on whoever did all this to you.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen seemed to be crying a little and at the same time doing an extremely strong dark aura in the place.",
        "type": "action"
    },

    {
        "value": "N...No! Wait! Rayane and I were trying to defuse the bomb!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny walks backwards slowly without making any suspicious moves.",
        "type": "action"
    },

    {
        "value": "What?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked very serious and looked back, trying to preserve her identity through the glow of her body. But when Rainbow Queen recognized Vinny voice a little, she tried to make some contact.",
        "type": "action"
    },

    {
        "value": "Y...yeah! I was with Rayane during the whole time. Rayane is very tired because she tried to protect me during the explosion.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked towards him slowly, looking into Vinny eyes. Vinny see two rainbow glow eyes. Rainbow Queen was starting to suspect something.",
        "type": "action"
    },

    {
        "value": "You? The energy of your SmartMoby is familiar. What are you doing here?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny saw that the Rainbow Queen face started to form tattoos on her face during the progress.",
        "type": "action"
    },

    {
        "value": "A..Ah. We were here protecting ourselves from the explosion. We caught someone involved in this attack, he's passed out. I don't want to do anything with you, I wanted to stay close to Rayane until she wakes up. I've been with Rayane for a long time and I've never done her any harm, you have to believe me. We can talk about it if you want. What can I do to make you believe in me?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen was staring at Vinny, looking like she was analyzing something during some seconds. Rainbow Queen was even more suspicious of Vinny's presence. ",
        "type": "action"
    },

    {
        "value": "Hmm... So you claim to be her friend? And you still want to dare me to believe you? You have a lot of courage. Challange me will be the worst thing you'll ever do in your life. Simple words won't be enough to convince someone like me.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very surprised to see Rainbow Queen's body filled with brightly colored elements, her egyptian looks, her accessories. But what I most made Vinny's surprised is that Rainbow Queen didn't have a SmartMoby on her arm.",
        "type": "action"
    },

    {
        "value": "Doesn't she have this weird thing on her arm? What does that mean?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "I...I can prove this! I have pictures of her smiling with me. It never crossed my mind to challenge you, I don't even want to think about it.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little worried for a few seconds, but he didn't give up trying to stay determined.",
        "type": "action"
    },

    {
        "value": "I...I just want her to be okay, I can show you the pictures of us or you can wait for her to wake up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "Rainbow Queen showed an expression of more suspicion before making a small sinister laugh.",
        "type": "action"
    },

    {
        "value": "Photographs? You are so innocent. This means that you have privileged technology in this dimension. Photographs are not common in this dimension.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked very deeply into Vinny eyes, wanting to watch Vinny senses to try to see if Vinny were telling the truth in a very intimidating way.",
        "type": "action"
    },

    {
        "value": "It seems that you are hiding something from me. How am I supposed to trust that you have not manipulated these images?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised and anxious during the conversation. Vinny tried to calm down a bit before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "If you don't believe in me, that's fine, Rayane has this picture in an album. She seems to have a lot of love and extreme affection in her photo album.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny calmed down a little more, breathing deeply to try to continue talking more calmly.",
        "type": "action"
    },

    {
        "value": "See I don't want to do any harm. You and me want the same thing now. I want try to help Rayane. Rayane is having nightmares now that she can't wake up. She didn't say anything about her past. Something tells me that you like Rayane a lot.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen made a slight smile a little evil when listening to Vinny's words.",
        "type": "action"
    },

    {
        "value": "How interesting. Is Rayane trying to make some kind of new friendship? I think this guy is going to need a special ritual for me to show him who he's dealing with. He seems to be more innocent than a dangerous pony.",
        "character": "Rainbow Queen",
        "type": "think"
    },

    {
        "value": "Hmmmm. I appreciate your courage in your words. You will have your little chance to see me walk away without bad things happening to you. You were too cowardly to just throw a little stone next to me.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to hear that. But he tried to keep quiet to continue listening to the conversation.",
        "type": "action"
    },

    {
        "value": "Really very interesting. I'm understanding what's really going on here. This pony is really very silly. It's going to be fun tormenting this guy's life until he learns a lesson.",
        "character": "Rainbow Queen",
        "type": "think"
    },

    {
        "value": "Heh~ If you really want to have my trust, then I'll wait for Rayane to say that to me. Now if you make a wrong move...",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen gave a sinister little laugh as she ended the words in a sinister and seductive way.",
        "type": "action"
    },

    {
        "value": "You're going to have some serious problems with me~",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Then Rainbow Queen used horn magic and levitated a long shiny scythe, and then used the scythe to finish levitating something around her, but Vinny just couldn't see it. Vinny was much more surprised, watching the scythe, trying to understand what kind of pony Rainbow Queen is.",
        "type": "action"
    },

    {
        "value": "W...What?! But what the fuck is this?!",
        "character": "Vinny",
        "type": "think"
    },
    
    {
        "value": "Weeeell... About the cave. This was Rayane who diminished the strength of my SmartMoby. I understand you don't believe me right away, it's okay. But Rayane is in great need of help now. I can stay here until she wakes up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rainbow Queen looked a little more serious and does a movement with the scythe, bring Vinny's face closer.",
        "type": "action"
    },

    {
        "value": "Ssssh... Don't try to take advantage of my emotional weakness. Many souls needs me now~",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "When the Rainbow Queen's scythe disappeared, Vinny accidentally lost his balance and fell to the ground.",
        "type": "action"
    },

    {
        "value": "And stay well out from PROBLEMS.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen simply made a huge glow and disappeared through a teleportation spell. Vinny was still surprised and confused. But he was slowly calming down again.",
        "type": "action"
    },

    {
        "value": "W...what? Does she also know how to disappear?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "dark-and-mysterious-ambient"
        },
        "value": "When the silence finally returned. Vinny noticed that now Rayane's horn was no longer damaged as it was a few minutes ago. But Rayane was still fainting and resting.",
        "type": "action"
    },

    {
        "value": "W...Wow?! Rayane?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very curious trying to understand what was going on. When Vinny noticed that Rayane was feeling better, Vinny tried to look where the mysterious pegasus was. Pegasus was still passed out on the ground.",
        "type": "action"
    },

    {
        "value": "Ohh... the pegasus is here too.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Vinny looked worriedly at Rayane, going to analyze if Rayane was well.",
        "type": "action"
    },

    {
        "value": "R..Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised and feeling better to feel that Rayane was breathing better than before. Vinny rearranged the blanket to keep Rayane warm gently.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled for a few seconds before going to see if the pegasus was still passed out.",
        "type": "action"
    },

    {
        "value": "Time to see this suspect.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was thinking about getting the cloth and knife right away. The wind that was occurring, making Vinny feel a little cooler.",
        "type": "action"
    },

    {
        "value": "Why? Well that crazy pony could have stayed here.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny took all the rags and the knife, reinforcing the bindings on the paws, wings. Vinny finished the last progress covering the mysterious pegasus's eyes.",
        "type": "action"
    },

    {
        "value": "Hmmmm. Good.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "The pegasus was still unconscious. The smoke and dust that was getting lower slowly. Vinny was starting to get worried as he noticed that the environment was getting cleaner to see.",
        "type": "action"
    },

    {
        "value": "Good. Good. This will have to be done very quickly.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Meanwhile, Rayane's horn was slightly finishing regenerating as her body started to breathe normally again, but she was still passed out. Vinny looked at Rayane again, doing Vinny feel much better and calmer.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe a little time.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value":"Vinny would place the pegasus's body next to the wall and then go back to Rayane.",
        "type": "action"
    },

    {
        "value": "Hey... My little baby? Wake up.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny pokes Rayane very lightly.",
        "type": "action"
    },

    {
        "value": "Can you hear me? Is everything okay?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was shaking Rayane's body very gently. Rayane starts to touch a little, trying to wake up. Rayane was slightly trying to open her eyes.",
        "type": "action"
    },

    {
        "value": "H..huh? Rain? Is it you again?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very confused because I still hadn't fully regained consciousness. Vinny would get curious and then just continue the conversation.",
        "type": "action"
    },

    {
        "value": "Calm down. Calm down... I'm here, it's okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny hugs Rayane very tightly. Trying to do her feel really comfortable.",
        "type": "action"
    },

    {
        "value": "R..Rain? You really came back...? I...i...",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane slightly opened her eyes and finally realized Vinny presence.",
        "type": "action"
    },

    {
        "value": "A...Aaah? V...Vinny?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very surprised for a few seconds. Rayane blushed a little with embarrassment, but then continued the conversation.",
        "type": "action"
    },

    {
        "value": "You're alive. I thought my force field had failed.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane cries while hugging Vinny back. Rayane was very relieved to see that Vinny was okay. The hug was very comforting. Vinny smiled a little and just continued the hug.",
        "type": "action"
    },

    {
        "value": "Yes, I'm fine. I never leave your side, I've been here all along. You were VERY bad... How are you feeling now?",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "I...I'm feeling so much better, I'm surprised I'm alive too. Meeting you was one of the best decisions I ever made. I...I was very exhausted. I thought I was going to die. My magic felt like it was almost gone. Wh...what did you do to save my life?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane ended the hug while continuing to smile gently. Vinny was very thoughtful about whether to choose to tell the truth or not at this point.",
        "type": "action"
    },

    {
        "value": "I... I used my spray and stayed by your side the whole time. But first we have to settle something, then I need to talk to you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Ah? A spray? Are you sure it was just a spray? Didn't you use any special healing items? I... I was almost dying from lack of magic in my body.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was surprised for a few seconds, thinking it was something important, but then she calmed down to see Vinny pointing to the hostage.",
        "type": "action"
    },

    {
        "value": "What do you want to do? Do you want to try something first or not?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "T...The hostage? I'm still tired. I need to finish resting. But if you're feeling well. Try to find out who's responsible for all this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane coughed again as she lay back on the bed again.",
        "type": "action"
    },

    {
        "value": "Well... Just promise not to be scared?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets very curious to hear this",
        "type": "action"
    },

    {
        "value": "Scared? What are you talking about?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "I'm going to act on the pegasus.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny turns his back and walked to the pegasus on the floor. Rayane just remained curious, trying to understand what would happen.",
        "type": "action"
    },

    {
        "value": "Hey wake up. Waaaaake up!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny starts to shake the pegasus head. The pegasus gets startled and desperately tried to move.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "suspenseful-ambient"
        },
        "value": "H...huh?! WHAT?! Where am I?! And...didn't I die?!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Calm down! You didn't die and you won't die if it depends on you. I just need you to say a few things. You need to explain what happened and why this one dropped a bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The pegasus gets more confused when his realized that his was not seeing anything.",
        "type": "action"
    },

    {
        "value": "Wh... what? E..Elite Color?! N...No! Please! Don't turn off my SmartMoby! I don't want to have this end! And..I swear it was just a blast bomb!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The pegasus was even more desperate trying to move and trying to get away. Vinny spoke close to the pegasus ear, pulling this up.",
        "type": "action"
    },

    {
        "value": "Hey! Don't lie to me motherfucker!! Say what else and I release you!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "O..oh god.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "CALM DOWN! I don't know anything else! I just oriented the coordinates! The only thing I knew was to be more careful with the last bomb! I just want to go home! I swear the explosion couldn't have been too strong!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The pegasus moved more desperately, trying to move in the opposite direction in response. Vinny then started talking a little lower in a very threatening way.",
        "type": "action"
    },

    {
        "value": "What? Tell me something I don't know. Where is your house, do you have family? I've been out there and seen some things. if you say something that doesn't lead with what I saw out there I'll cut your wings into little slices until you say more.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny pulls the pegasus ear harder during the progress.",
        "type": "action"
    },

    {
        "value": "Nobody wants to stay here boy, tell us what you want and I'll disappear and you'll be released. Nobody needs to know that we had this conversation.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "M..my wings?! You are crazy?! My life depends on them! YES! I have family! Everyone is waiting for me to come home! I'm just a coordinate helper! We were just trying to open a secret passage! Just that! We didn't want to hurt anyone!! STOP!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Yeah. A lot of ponies died here with this bomb! Who do you work for?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was very surprised, not understanding very well what was happening.",
        "type": "action"
    },

    {
        "value": "P..Ponies?! But the bomb wasn't even that strong! I...Impossible!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was extremely scared to hear this.",
        "type": "action"
    },

    {
        "value": "I'm just a military man from the East region. I just follow orders from my superiors. Just that! Our leader just wants to have the magic relic back! This is just my job!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little surprised to hear this answer.",
        "type": "action"
    },

    {
        "value": "Ah? What's your leader's name? and why did he want to explode this bomb?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...we just wanted to open the secret passage! The secret underground passage that must be near you now. Wait... Don't you know my leader's name? Everyone knows his name.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious to see the mysterious pegasus very confused during the question.",
        "type": "action"
    },

    {
        "value": "Fine... Say his name and yours. I want to hear from you, if you lie on something I will clip your wings. I want to see if I can trust you. I know exactly what your boss is, I want to know if you're really going to tell the truth.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was very worried and tried to respond as quickly as possible.",
        "type": "action"
    },

    {
        "value": "No..no! His name is Marlon! Only that! MARLON! No secrets here! I just want to leave!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "And your name? Your name! Speaks your name too!",
        "character": "Vinny",
        "type": "dialogue"
    },
    {
        "value": "I already told! Marlon! Everyone at Pony Driland knows it's Marlon! P...Please stop!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Marlon is the fuck! YOUR NAME! I want to know your name! If it takes time we will leave you here without wings and with the elite color coming here!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny puts the tip of the knife on the upper part of the wings but without piercing.",
        "type": "action"
    },

    {
        "value": "N...NO NO NOOO! STOP! I speak! I speak! Just please stop! I just want to be a little calmer!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pony began to wail, asking for much mercy during the conversation. During this process, Vinny looks for an item on his body looking for anything suspicious. Vinny only find a small device used to guide the bomb's trajectory and a wing helper device hidden behind his wing clothes.",
        "type": "action"
    },

    {
        "value": "Hey... Come on, if you don't speak your name now I'll cut off a piece of your wing and put it in your mouth!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny press the knife harder against the wings only to provoke the mysterious pegasus.",
        "type": "action"
    },

    {
        "value": "N..NOOOOOO! Stop stop!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "The mysterious pegasus was trying to get away during some seconds.",
        "type": "action"
    },

    {
        "value": "M..My name is Wagner! WAGNER!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Vinny was feeling better to hear Wagner's name. So Vinny continued to focus on the conversation.",
        "type": "action"
    },

    {
        "value": "Okay Wagner. who are the ponies that went to the crater? The bomb exploded there. No other pony has come here to see the crater yet.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny slowly withdrew the knife and give the pegasus more freedom. The mysterious pegasus slowly calmed down a bit more and continued to respond.",
        "type": "action"
    },


    {
        "value": "W..What. T... The pony is Marlon and his army. Marlon just came to take the relic. Only that. Marlon don't want to hurt anyone else!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Marlon? Marlon is a unicorn?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Y..Yeah. My only obvious certainty is that Marlon is obviously the unicorn of the group.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Group? Hm. I don't think that's quite what's happening right now. There are no souls alive around here now.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny picks up Wagner items and then went to Rayane slowly.",
        "type": "action"
    },

    {
        "value": "Please. Just be quiet.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane just agreed, keeping as quiet as possible so her voice wouldn't be heard while she was surprised by the conversation with Wagner.",
        "type": "action"
    },

    {
        "value": "What are you talking about? And what do you mean no living soul? T...This is wrong! It was a midsize bomb! IMPOSSIBLE!",
        "character": "Wagmer",
        "type": "dialogue"
    },

    {
        "value": "Wagner Gets scared, trying not to believe the possibilities of what happened. Vinny then returned to Rayane for a few seconds.",
        "type": "action"
    },

    {
        "value": "Well... Do you think it's suspicious?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny shows the items that the mysterious pegasus had. Rayane was very curious and thoughtful when observing the items. Rayane analyzes the items for a few seconds before responding.",
        "type": "action"
    },

    {
        "value": "Okay. Wagner probably won't talk about everything he's doing.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah. Please, you need to analyze a little. Outside I saw some pegasus going to the crater before the explosion.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Pegasus? Are we still in the blast zone? Hmmmm. All right.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny delivered the items to Rayane. Then Vinny walked towards the pegasus again.",
        "type": "action"
    },

    {
        "value": "Okay Wagner. Why did you want to do this work?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..Work? Well...",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was a little scared during the progress.",
        "type": "action"
    },

    {
        "value": "I...I just work to protect the east region. But I also like to enjoy and my adventure. It's all I can do for my life.",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Do you like to protect by dropping bulldozer bombs on villages with innocent ponies in this? A village that had many families and in addition to having a confrontation? I'm believing in you. I just want you to help me understand why your group really blew up this bomb. No one goes around blowing up villages and killing ponies for magic items for nothing.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner showed nervousness as he was trying to understand Vinny's words. Wagner looked a little confused as to what was being talked about.",
        "type": "action"
    },

    {
        "value": "So please. Tell me if you know what your friends' next step is.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "B..but everypony was going to wait for the village to be evacuated! Someone promised me that they would do their best to evacuate the village as soon as possible! You talking like that sounds like it was a giant explosion! We just wanted to access the center of the village! Marlon just wanted to open the secret tunnel!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Tears started to come out from Wagner eyes when his started to lose the emotional balance of the situation.",
        "type": "action"
    },

    {
        "value": "So tell me about your family, do you live with your family? what do you tell me about your family? it was really a very strong bomb! There were many bodies scattered on the floor! Or what was left of the ponies body. How is your family? Why did you say that I could erase your Smartmoby?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was even more surprised and began to understand that the dialogue didn't sound much like an Elite Color conversation. But still Wagner was scared, Wagner was too scared to know what really happened.",
        "type": "action"
    },

    {
        "value": "B...But how can I trust you about my family's life? This is not true! Stop talking nonsense! I wouldn't let a military team drop a very destructive bomb!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Then Wagner was confused for a few seconds. Wagner kept trying to understand if Vinny is really an Elite Color member or not. Wagner was still very emotional and stuttered as he tried to understand what was really going on.",
        "type": "action"
    },

    {
        "value": "W..What? Do you then do not know how to turn off a SmartMoby?",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "You won't say anything? Okay...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Vinny held Wagner by the wings and pulled Wagner as Vinny walked up the stairs, they took the blindfold off their eyes.",
        "type": "action"
    },

    {
        "value": "Hey! But what the fuck is this?! Help!! I'd rather die than let you do something with my family! Let me go NOW!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "So Vinny took the blindfold off Wagner eyes slowly.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "nuclear-winter"
        },
        "value": "Okay Wagner. This doesn't look like a child's firecracker.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Let me go!! Let me... O...oh....WHAT?! WHAT HAPPENED HERE?!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was extremely scared and impressed. Wagner was beginning to feel extremely nervous, trying not to believe what he was seeing.",
        "type": "action"
    },

    {
        "value": "Yeaah. This is what your firecracker did. Look at the rest of bodies on the floor. Can you give me one good reason why I shouldn't leave you here? You can really say something you know and I don't, or you can just end up like them. The pony you work for did this! If you're alive or not, it would be good until you're dead for them to keep anyone from knowing about it!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a few deep breaths then Vinny looked at the crater for a few seconds.",
        "type": "action"
    },

    {
        "value": "Did you enjoy participating in a slaughter? Could be your family in these bodies.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was starting to feel sick when he saw the whole situation. He was trying not to pass out due to extreme nervousness about understanding what was going on.",
        "type": "action"
    },

    {
        "value": "No..no! This...this can't be true! I never knew we had a bomb like this! H..How does Marlon do something like this?! He's never done anything like this! W...What monster is this?!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was extremely terrified, trying to control himself emotionally, he seemed much more scared than usual.",
        "type": "action"
    },

    {
        "value": "Wagner, let's try again, no threats, no blindfolds. why would Marlon do that? Did someone cheat on him? You know something and you don't want to tell me? Just remembering that I came to stop the bomb with my hooves, but I couldn't. I came face to face with the bomb. Why would anyone want this city destroyed?? Do you have anything else? Revenge? Something of greater value in the underground?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wagner was slowly starting to feel weak during the conversation due to extreme nervousness.",
        "type": "action"
    },

    {
        "value": "I don't know anything. Marlon was just talking to me a lot about a prophecy! We needed to help the East region at all costs! Our only goal has always the magical relic as we have done for generations!",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner was getting more and more traumatized and very shaken by the situation. Vinny was a little surprised and confused, and asked the question.",
        "type": "action"
    },

    {
        "value": "What? Tell me about this prefect, what is this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The prophecy of the great drought of the eastern region. O...Our world is slowly dying. This magical relic is our only hope for us to live for a few more generations. B..But the West region....c...built... a bunker.....u..a bunker for....for.......p...protect the relic.....",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner? WAGNER! No! it's ok, you don't have to try, I'll put that blindfold over your eyes again, don't worry, nothing will happen to you. I just need you to trust me enough for you not to see anything.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N...no.........the....the explosion........the....the prophecy........of.. .....R....Rainbow.........R...Raaaaainbow....",
        "character": "Wagner",
        "type": "dialogue"
    },

    {
        "value": "Wagner lost the balance and passed out on the floor. Wagner no longer showed any reaction and his body remained on the ground. But Wagner's SmartMoby kept showing that he was still alive.",
        "type": "action"
    },

    {
        "value": "OH MY LUNA!! Because every adult is a child here!! FUCK!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Vinny would then put Wagner back in the basement of the house. The blindfold was placed over Wagner's eyes again. Wagner was kept away from Rayane for security reasons. Then Vinny looked at Rayane and nudged her gently.",
        "type": "action"
    },
    
    {
        "value": "Rayane? Rayane. Please wake up. I need to have a conversation with you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane seemed to be concentrating on some thought. So she was a little surprised to hear Vinny's voice, but she tried to stay calm as much as possible.",
        "type": "action"
    },

    {
        "value": "Huh? Vinny? Talk about what?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Did you hear our conversation?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "bad-think"
        },
        "value": "M..Me? I've heard many parts from the talk. I'm really worried about what happened out there. All I've seen so far is just this basement.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane seemed to show a more worried look than usual.",
        "type": "action"
    },

    {
        "value": "Hmm... How many alicorns do you know? The weather outside is sad, bodies scattered, houses and more houses destroyed. But do you know anything about alicorns?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was confused and even more surprised to hear this.",
        "type": "action"
    },
    
    {
        "value": "A..Alicorn? The forest still exists?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah, your friend in the cave seemed angry or irritated, I'm starting to put the puzzles together. Do you only know her?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to control her nervousness as she answered.",
        "type": "action"
    },

    {
        "value": "M..my friend?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little more insecure of the conversation.",
        "type": "action"
    },

    {
        "value": "Vinny. There is only one alicorn in Pony Driland.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Okay. Who was in the cave wasn't an alicorn?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. The unicorn was wearing a black outfit.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "And you only know her right?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "N..no. There is only one alicorn.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny took a deep breath and then said.",
        "type": "action"
    },

    {
        "value": "Okay okay. I thought there were several like in my world, where people had MANY different gods. But going back to the beginning of the conversation I actually used a spray on you, and you got better right away. Don't you think it's weird a simple spray to do this?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was slowly beginning to understand what was happening, and it made her feel more insecure.",
        "type": "action"
    },

    {
        "value": "B..but that was my question. I thought you knew the answer to answer me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hmmm... I just used the spray.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Wagner for a few seconds. Wagner was on the floor passed out without doing any movement.",
        "type": "action"
    },

    {
        "value": "I had a little surprise when you was almost dying. Heh! Look on the good side, this time it didn't even cross my mind to kiss an alicorn again. This alicorn knew everything about you and almost even how many kisses you've already given in life.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Wh... what?! I...Impossible! A...Are you serious?! We've had a lot of disagreements lately!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was very surprised, trying to understand what was happening.",
        "type": "action"
    },

    {
        "value": "Yeah. She didn't get well with my presence and with me saying that you were very close to me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny sits on the floor, doing a facehoof.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Well she had magic just like yours, but instead of a sword, it was a scythe and when she got really upset to see you in critical condition, some black stuff started to come out too. This one really seemed to care a lot about you. It just doesn't seem to care about me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane then became quiet and tears began to come out of her eyes. She prepared to continue the conversation.",
        "type": "action"
    },
    
    {    
        "set": {
            "playlistPlay": "sad"
        },
        "value": "M...Nagic like me? Did you say scythe? I've never seen magic scythes. I knew about her magic getting dark. But I've never seen this mysterious scythe.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Ah? Why the concern? She said that my energy is strange. She said that she had many souls waiting for her. What do you want to do now? We can't forget about James and Jeff.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "She...she's getting weirder with each passing day by this dark energy. Don't worry about souls. This sounds strange, but she really loves take care of souls. She likes to take care of dead ponies.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious and at the same time surprised to hear Rayane's words.",
        "type": "action"
    },

    {
        "value": "Okay... and that alicorn didn't have a SmartMoby.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "SmartMoby? Yes. She never had a SmartMoby. This is a great curiosity for me.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to hold back a little more tears as I thought about what could be happening.",
        "type": "action"
    },
    
    {
        "value": "Yeah. it seems that everyone, when so close to me, the past comes to haunt",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "H..haunt? What do you mean by that?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane stopped crying a little and looked at Vinny curiously.",
        "type": "action"
    },

    {
        "value": "I mean that the past comes back to settle the bills.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "B...but she's going crazy! She is increasingly losing her mind! I tried to help her in many ways! But she is much more paranoid about the past than I am!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to hide her face a little while crying again. Vinny analyzed Rayane's behavior and was even more surprised before continuing the conversation.",
        "type": "action"
    },

    {
        "value": "Hey... calm down. Caring for the dying ponies, every moment really must be depressing. But calm down, we'll fix this, she still likes you, that's a good thing.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "She always liked taking care of the dead. I never imagined that she would forgive my life after so many things had happened. But I have no hope that she will ever want my help again. She always gets very angry when I try do something to make her feel better.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little more surprised and even more curious to find out what was going on.",
        "type": "action"
    },

    {
        "value": "What exactly do you want to do with her?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "I want to try to help her find some much less brutal alternative to saving Pony Driland. That's all. She just wants to save Pony Driland. But she is increasingly losing her mind trying to do this.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to find some acceptance of what was happening. Rayane slowly began to calm down. Vinny took a deep breath and hugged Rayane for a few seconds until she calmed down.",
        "type": "action"
    },

    {
        "value": "Don't worry. We'll find an alternative. I've had many friends, and the kind of concern by your horn was a true friendship. Everything will be ok. How are you feeling? Can you walk? Do you want to go outside with me so you can see how you are?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I should have a little more hope that there is still the old Rain I knew.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rain? Does she have a nickname? Interesting.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Rayane lifted his head a little, trying to have some optimism while wiping her eyes.",
        "type": "action"
    },

    {
        "value": "I'm feeling better. My legs still hurt a little. I just need a rest. But I can walk until we meet the others.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well... if exist deities in this world, are there other deities too? Or souls, or spirits, angels, demons, gods or something?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was curious about Vinny's words.",
        "type": "action"
    },

    {
        "value": "Y..Yes. The Master SmartMoby is the highest deity in this world. But it's been a long time since te Master SmartMoby disappeared. I never knew who used this by the last time.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh. Alicorns and I have an interesting chemistry. I need to turn into a alicorn, maybe we won't get more intimate. I'm laughing so I don't cry in a figurative logical way.",
        "character": "Vinny",
        "type": "dialogue"
    },
    
    {
        "value": "Rayane laughed a little because of Vinny's silliness. Rayane responded with a little nervousness.",
        "type": "action"
    },

    {
        "value": "You won't like having her around if you see someone breaking a promise with her.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "So Rayane found a piece of broken mirror on the floor and used the magic to see how her face was. Rayane gets a little startled when she saw the mysterious dark tattoos on her face, but the tattos were already disappearing again because she felt calmer again.",
        "type": "action"
    },

    {
        "value": "W...What?!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Yeah, your friend also had the same tattoos on her face.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "O..Okay okay. I also saw the tattoos when we were in the cave. But... but what is this?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was surprised to hear that. So Vinny responded calmly.",
        "type": "action"
    },

    {
        "value": "I thought you really knew.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "No.... I have no idea what's happening now. We need to get out of here before someone unknown appears. I'm getting worried if something happened to James.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to try to get up to start walking again.",
        "type": "action"
    },

    {
        "value": "Well... What are we going to do with our supposedly innocent hostage?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane looked curiously at Wagner for a few seconds.",
        "type": "action"
    },

    {
        "value": "Leave him somewhere safe. He has already suffered a lot while being questioned.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little tired, but she kept walking towards the basement exit.",
        "type": "action"
    },

    {
        "value": "Ah? Safe place? Where?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane stopped and looked around for a few seconds until she saw her abandoned mattress on the floor. Then Rayane uses her magic to store the new items in her inventory.",
        "type": "action"
    },

    {
        "value": "Use my bed. I'm sure he will feel better.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Are you sure? Don't you want to try to wake him up?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little sad for a few seconds before answering.",
        "type": "action"
    },

    {
        "value": "He won't wake up so early in the same way. He just passed out from a panic attack. It will take time for his body to calm down and he can wake up again.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny felt extremely confused, thinking about something for a few seconds.",
        "type": "action"
    },
    
    {
        "value": "GOD! Why are males like children and females are more... \"brute\"? All the females I've met are crazy. Kenny's wife was even crazier.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "While talking, Vinny placed Wagner on the mattress gently.",
        "type": "action"
    },

    {
        "value": "And his items... I don't feel like taking what's his, is there anything useful you can take us? Maybe James can't touch that remote control device to know if there's another one like this pegasus.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane laughed a little before answering.",
        "type": "action"
    },

    {
        "value": "This must be a coincidence. We just left the south region where normally everyone is much more peaceful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane analyzed Wagner items for a few seconds during the progress.",
        "type": "action"
    },

    {
        "value": "We'll have to take his items whether we like it or not. If we don't, other ponies will possibly steal from him.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and agreed.",
        "type": "action"
    },

    {
        "value": "Okay, I hope so. Will you go back to James or do you want to go to the crater?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Don't worry. We can find him later.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The Rayane horn's magic glowed for a few seconds, focusing on Wagner's SmartMoby. Then Rayane would make a small smile of satisfaction before returning to talk to Vinny. Vinny was still surprised, but he still smiled and started to thank Rayane.",
        "type": "action"
    },

    {
        "value": "What? Well... We are where the bomb exploded, by the way, thank you very much! The whole plan went wrong and you still went there and almost died to protect me. Thank you very much!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh~ You're welcome. So let's go. The mysterious crater awaits us.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane feel better for the thanks, she smiled a little and just prepared to continue the adventure. But then Vinny suddenly boops Rayane. Rayane gets a little surprised by the boop, blushing a little.",
        "type": "action"
    },

    {
        "value": "H..huh?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wow. How cute, you blushed, are you ashamed that I booped you? What is this magic you used on Wagner?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gave a light laugh before doing a smirk back, booping Vinny back.",
        "type": "action"
    },
    
    {
        "value": "Silly you~ I just used a spell on his SmartMoby so I could locate him later. But don't forget, this magic is temporary.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Heh. Well... are you ready to see what's left of the small village?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny slowly gets more serious during the talk. Rayane was then worried and very curious to hear about it.",
        "type": "action"
    },

    {
        "value": "W...what? What do you mean about it?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well, it's a small village, a bomb dropped, I thought you were thinking that the damage was not small, by the way you saw the poor pegasus fainting.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The... the village? The village we were in?!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": "nuclear-winter"
        },
        "value": "Rayane left the door. Rayane is extremely surprised to see the village completely destroyed.",
        "type": "action"
    },

    {
        "value": "M...my god... N....No! This is not true!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Well... we need to leave here, I think in this world there must be something like Radiation too. You want to use your magic to know if there was a pony around?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W..What? Radiation? What's this?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane kept looking around, trying to find someone for a few seconds.",
        "type": "action"
    },

    {
        "value": "Okay. Maybe we can find a way out. But first I need to analyze the crater.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was starting to feel sad due to the completely destroyed place. Rayane didn't know what she could say to Jeff. So Rayane closed her eyes and began to concentrate the magic to look for some pony presence.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious to look at Rayane. Vinny tries to see if anyone was around. But Vinny only found more dead bodies, no life.",
        "type": "action"
    },

    {
        "value": "T..this a macabre place.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Okay. It looks like the survivors are on the other side of the destroyed wall. The forest is probably alive. But it's very strange that I have a feeling presence of ponies in the center of the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane became a little more serious and worried, watching the center of the village.",
        "type": "action"
    },

    {
        "value": "Yes, Wagner said someone wanted to get a magic item here. I guess there was some betrayal and some organization must now be going to get the item.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was surprised to hear Vinny words, so Rayane understood what was really happening.",
        "type": "action"
    },

    {
        "value": "What? The magic item? N..no! The magic item!! The magic relic! This is going to become a huge war problem!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tried to force herself to run, but she got tired and one of her legs made her lose her balance.",
        "type": "action"
    },

    {
        "value": "AAAH!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Hey hey! Calm down! Calm down! Why this hustle of nowhere?",
        "character": "Vinny",
        "type": "dialogue"
    },

    
    {
        "value": "if this item is stolen by someone mysterious. Both the east and west region will be destroyed!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane tries to force herself up, trying not to get too distracted by the hurts. Vinny gets worried about the Rayane's reaction.",
        "type": "action"
    },

    {
        "value": "Rayane... Calm down. And the prophecy?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "The prophecy? R..Rain created this prophecy just as a warning. She knows that a discord between the two regions will be total destruction.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Wow...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny does a poker face.",
        "type": "action"
    },

    {
        "value": "Well... I had an idea.",
        "character": "Vinny",
        "type": "dialogue"
    }

]