[

    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 3,
            "weather": "sun",
            "playlistPlay": "dark-ambient-melodies"
        },
        "type": "action",
        "value": "So Rayane and Vinny were getting ready to leave the cave. The path is a long way across an open field surrounded by forests all around. A tremendous smoke could be seen in a long distance coming from a village a little far away. Some forests around were on fire, and smoke from explosions could be seen all around. Vinny was very surprised by everything he was seeing."
    },

    {
        "value": "Wooow... O..okay, wherever you go, I'll go too. If you go to hell I will too!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny then started following Rayane. During the progress Vinny tried to fight his worry. When Rayane noticed Vinny's behavior, Rayane looked a little worried at Vinny.",
        "type": "action"
    },

    {
        "value": "Vinny... Remember that this is not training. If someone attacks you, nobody won't pity you the way I did. Alright? We just need to check out the village.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane starts to enter the forest slowly, following the trail of smoke. Vinny tried to remain confident.",
        "type": "action"
    },

    {
        "value": "Y..yes. This time I don't have my little pot with sand or dirt, but I have my wings and I know how to fly. You can be calm about me. I know how to take care of myself in more delicate situations like this.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried when she thought about Vinny's actions.",
        "type": "action"
    },

    {
        "value": "Everyone here can have one sword or firearms. Please, be really careful.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little more worried while using magic to wear herself the protective armor. Vinny was a little surprised to see Rayane's armor. But then Rayane looked into Vinny's eyes, feeling a little guilty.",
        "type": "action"
    },

    {
        "value": "N..no no... He really won't just follow me around if I try to take the safest path. If I try to change his trajectory, he'll find out.",
        "character": "Rayane",
        "type": "think"
    },

    {
        "value": "V..Vinny. I...I can't see you like this. You really need armor. But I only have one unicorn armor left. You won't be able to use your wings when you're wearing the armor.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was curious about Rayane's change in behavior.",
        "type": "action"
    },

    {
        "value": "What? Won't that bother you? Do you think it's safer for me to wear the unicorn armor?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhh, don't worry. It's my old armor that I used during my life before I got my current armor as a gift. Please take good care of this armor and stay safe. I don't want to see you being ripped in half.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny gets a little scared, but Rayane felt calmer when she used magic to start spawning the ancient armor on Vinny's Body kindly.",
        "type": "action"
    },

    {
        "value": "O...oh wow. Thanks Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny smiled and hugged Rayane gently in response when he felt safer by the armor.",
        "type": "action"
    },

    {
        "value": "All right then! I am going to follow you.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane smiled a little more while hugging back. Rayane was feeling better and more comfortable seeing Vinny feel safe.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Take good care of the armor~ When we find a store, we'll buy a backpack similar to James's backpack. Then you will have less problems with weight on your back.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Heh! Yes charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {

        "value": "Rayane does a little giggles then slowly resumed walking to give Vinny time to get back into the rhythm of the adventure. Meanwhile, high above the clouds was Rainbow Queen and the mysterious unicorn. The mysterious unicorn was wearing a special boot for her paws to stay on top of the clouds. Rainbow Queen seemed to be watching all the conflict that was going on in the mysterious village. Rainbow Queen's gaze was very serious, she didn't seem to be satisfied with what was happening.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "rainbow-queen-moment"
        },
        "value": "War never changes. War is such a ridiculous thing. Are you seeing this? Two ponies trying to be heroes, such a ridiculous and absurd fantasy. Hiroshi will not have the mental balance for this war.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn would get a little scared.",
        "type": "action"
    },

    {
        "value": "B...But he said this time he was going to try something better. And the Elite Color was going to try to control the balance of the war.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh.",
        "type": "action"
    },

    {
        "value": "What? Elite Color? Do you still trust the Elite Color?",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the mysterious unicorn and made a sinister laugh. The mysterious unicorn then became a little more insecure and tried to respond in a more determined way.",
        "type": "action"
    },

    {
        "value": "Y..Yes. Elite Color has always been something very important to all of us! This dimension urgently needs to expand the energy! Our dimension will become a real strong dimension! Isn't that what you want?",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen took a deep breath and responded disappointedly. Rainbow Queen looked a little angry as she started to respond. The mysterious unicorn then walks backwards when realizing Rainbow Queen's anger.",
        "type": "action"
    },

    {
        "value": "We don't need to kill many ponies to get souls to sustain this dimension. And a war was the worst choice you all ever made.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn slowly gets a little more intimidated as she saw the Rainbow Queen's sinister gaze from the hatred.",
        "type": "action"
    },

    {
        "value": "S...sorry. I know you have empathy for souls. I'm sorry!",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "When this war is over, I'm going to want to have a very private conversation with Hiroshi and Marlon. I hope Marlon doesn't get scared when he sees a divinity for the first time.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "The mysterious unicorn gets very surprised for a few seconds.",
        "type": "action"
    },

    {
        "value": "Y..Really? Are you really going to do this? You've always said that it's dangerous for normal ponies to discover the identity of gods.",
        "character": "???",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen did a sinister little smirk before replying while the scythe poked the mysterious unicorn's neck gently for a few seconds. The mysterious unicorn then \"froze\", just shyly looking into the Rainbow Queen's eyes.",
        "type": "action"
    },

    {
        "value": "Shhhh~ Do you really think everyone in this world will believe that someone has seen a goddess? This world still needs more maturity to understand the existence of gods. We don't want the same mistakes to happen again.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "value": "Y..Yes. This is true. T...The true.",
        "character": "???",
        "type": "dialogue"
    },

    {
        "value": "Good~ Very good~ Then you are free again. You can go back to your \"fun\".",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {

        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": " Just don't forget. You still have a chance to do something better.",
        "character": "Rainbow Queen",
        "type": "dialogue"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "Rainbow Queen then looked at the village again for a few seconds. Rainbow Queen looked very thoughtful about what was really going on.",
        "type": "action"
    },

    {
        "value": "Meanwhile, Rayane and Vinny is walking through the forest. So Rayane would stop for a while to look carefully around if there was no one around.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "tense-mystery"
        },
        "value": "Okay. I need to trust you that no one will show up while I use my magic again just like other time when we left the cave. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised to remember the moment where Rayane was using this ability.",
        "type": "action"
    },

    {
        "value": "W...what? Do you want me to keep looking around?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes. I'm vulnerable when I'm using this spell, will you help me look around. If something happens, let me know and I'll react.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane came back into concentration to perform the mysterious magic again. Then Rayane's mane would slightly start to swing during the progress.",
        "type": "action"
    },

    {
        "value": "O..okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny worried, but he worked hard to stay focused. Rayane was very focused on Vinny's reactions as a warning reference. But Vinny didn't realize that. So Vinny heard the noise of hooves moving around. Vinny and Rayane liten to the very small sound of someone groaning in pain. Vinny start to talk very quietly so as not to distract Rayane.",
        "type": "action"
    },

    {
        "value": "Yeah. I can hear someone groaning in pain.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was still concentrating on magic and was slowly finishing magic progress when she heard Vinny's voice. Vinny could just see a leaf finishing doing some movement that maybe could be suspicious.",
        "type": "action"
    },

    {
        "value": "Oh no. This is not good.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Shhhh... Looks like there are some ponies around. But I don't know if the ponies are allies or enemies.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane gets a little worried as she concentrated on looking around.",
        "type": "action"
    },

    {
        "value": "Y..yeah. I had a slight feeling that someone is here. Maybe this is a trap.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Yes yes. We must already be inside some possible trap. Don't worry about it.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane replies as she started to spawn the sword. Vinny's eyes widen in surprise as he realizes the situation is getting serious.",
        "type": "action"
    },

    {
        "value": "Oh shit.",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was feeling nervous, but watched around waiting for something. Vinny and Rayane didn't see anything. Just hear the sound of some body being left on the ground. Rayane looked a little intimidating to try to show that she was focused on the danger.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "O..okay. I felt someone moving there.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny points toward the place where he had the sensation of someone moving. It was a place with a lot of tree leaf, making it difficult to see the place. Rayane laughed a little while her horn glowed a little stronger, making her sword go up in flames as she prepares the attack.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "battle"
        },
        "value": "Yes. But this is not the only place. But good tip for us to start the fun~ Use your wings to throw my fire around. Alright?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprised and just moved his face in agreement.",
        "type": "action"
    },

    {
        "value": "Ok ok.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny took off his armor a little, just so the wings were free and prepared to fan in order to help Rayane's plan.",
        "type": "action"
    },

    {
        "value": "Ok. it's now.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "The sword rotated forward, throwing some of the fire's combustion towards the trees. Vinny was a little more surprised, and reacted without a second thought. Vinny leaned over and started flapping his wings enough until he realized that the fire generated by Rayane was taking the path. Then when the fire reached the place. Suddenly more trees was wiggling, revealing a surprise attack from all directions made by arrows.",
        "type": "action"
    },

    {
        "value": "Get down now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "WHAT THE FUCK IS THAT?!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Rayane pulled Vinny to the ground while the sword start to spin violently, making the sword change the direction of rotation to horizontal, hitting the arrows in sequence.",
        "type": "action"
    },

    {
        "value": "WHAT A CRAZY SWORD!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny rolls a little. So Vinny gets up and starts to beat his wings with a little more intensity. The fire began to expand in a circular shape in the form of a ring, starting to catch fire in the other trees around, making whoever was there start to move away.",
        "type": "action"
    },

    {
        "value": "Yeah! You're doing well! We need to have a plan to react now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's take advantage of them moving away. I'll fly up and you prepare a teleport in my direction.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at the armor during some seconds.",
        "type": "action"
    },

    {
        "value": "I won't need the armor for now. Everypony here probably have firearms.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "V..Vinny? Be careful! You are an easy target while flying up.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little worried and then stopped spinning her sword. Rayane was very focused, starting to charge the teleport. Vinny waited for the fire to disappear before start to fly up.",
        "type": "action"
    },

    {
        "value": "Don't worry. I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up getting ready to fly forward in order to follow the plan to surprise the ponies that were in the front. Vinny could escape the situation. And everyone hardly noticed his attempt to escape. Then at the same time Vinny landed, Rayane appeared next to Vinny, helping Vinny put the armor back on.",
        "type": "action"
    },

    {
        "value": "Wow! It really worked!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane feels satisfied with the result, did not think twice and made the sword go up in flames again, preparing to do the first action that comes to mind.",
        "type": "action"
    },

    {
        "value": "Yeah! Block the way with your sword! You can make a fire barrier!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Barrier? Heh, good idea~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane used the fire sword to rip the earth floor, making all the trees that were close start to catch fire.",
        "type": "action"
    },

    {
        "value": "Let's get out of here Vinny! We'll have time to run away now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane quickly started to run very fast in a straight line.",
        "type": "action"
    },

    {
        "value": "AAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny followed Rayane, trying hard to keep the same speed as Rayane. Suddenly a unicorn sniper pony that was behind a tree tried to shoot Vinny, the shot passed grazing Vinny a lot, and at the same time Rayane used the sword and cut the sniper barrel, surprising the sniper. Vinny was a little scared, but he tried to laugh at the danger to calm himself down.",
        "type": "action"
    },

    {
        "value": "W...WOOOW!! IIIHAAAAAAA! YOU NEED TO IMPROVE THAT SIGHT YOU BLIND!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "W...WHAT?! RAYANE?! AH! FUUUCK!",
        "character": "Sniper",
        "type": "dialogue"
    },

    {
        "value": "The sniper fall to the ground and end up. The pony stayed behind and disappeared over the horizon.",
        "type": "action"
    },

    {
        "value": "Heh. Your head was nearly blown off. Are we going to hide or enter the village by force?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Let's hide! if we go through this, James and Jeff will too, let's hide somewhere and make a better plan than going out screaming!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane was a little curious and laughed a little and answered.",
        "type": "action"
    },

    {
        "value": "Okay. I'll have to do this on the hard way. Get on my back and hold on tight!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny looks at Rayane for a few seconds, laughing a little.",
        "type": "action"
    },

    {
        "value": "Okay.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny climbs on Rayane's back.",
        "type": "action"
    },

    {
        "value": "That's not how I wanted to climb on you for the first time but I trust you!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Heh. Be careful not to fall~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane increased her speed in a much more extreme way and used the trees as platforms to parkur on the trees.",
        "type": "action"
    },

    {
        "value": "WOOOW!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "When Rayane got to the top of the trees, Vinny accidentally fell off her, so Vinny had some chance of trying to hold on to the tree slacks during the progress",
        "type": "action"
    },

    {
        "value": "RAAAYANE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny holds the branch, doing a POKER FACE. Vinny soon felt a magic levitating his up, Rayane was balancing on the top of the tree, trying to bring Vinny back towards her.",
        "type": "action"
    },

    {
        "value": "Sorry Vinny. Let's get out of here!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Aah... Don't worry, it's dangerous for us to stop here. I'll fly to the village. You can try to find me.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny stepped onto the top of the tree and got off Rayane's back slowly. Rayane gets worried during the talk.",
        "type": "action"
    },

    {
        "value": "Fly? Don't fly too high or everyone will see you. If something happens, shout it out loud. Okay?",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "It's going to be okay, charming Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane just smiles a little, trying to trust Vinny. So Rayane went back to parkur between the trees towards the village.",
        "type": "action"
    },

    {
        "value": "Vinny smiles and flies up. Vinny flew at high speed, trying to keep a good distance away from being noticed. Vinny started to see some other pegasu flying in the sky towards the village, it looked like the pegasus was holding something medium sized black on his back. Vinny tried not to get too close to the pegasus, Vinny just stared at the pegasus for a few seconds.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "W...What? Is this another bomb?",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny could see the smoke from the previous confusion. Then Vinny would hear a sound of ponies entering the forest. And at the same time Vinny also hear the sound of something falling from the sky. It looked like the mysterious pegasus had hurled the mysterious black object. Vinny tried to get a better look at what it was. So Vinny realized that yes, the item is a bomb.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": null
        },
        "value": "OH MY GOD! OH FUCK! OOH FUCK! NOO!",
        "character": "Vinny",
        "type": "think"
    },

    {
        "value": "Vinny came down from the tree but being careful to the ground and tried to look more at the crowd. Vinny saw several ponies that were running desperately. Vinny saw a few more soldier ponies familiar with the ones Vinny saw during the trap, but the soldiers weren't even caring about Vinny anymore. Vinny saw something that looked like Rayane towards the wall.",
        "type": "action"
    },

    {
        "set": {
            "playlistPlay": "escape"
        },
        "value": "OH NO NO NO! RAYANE!!! SHIT! RAYANE NEED YOU!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies toward Rayane desperately, but Vinny felt a magic pulling his quickly to the side of the wall.",
        "type": "action"
    },

    {
        "value": "Vinny! This is good see you again! What is happening?! I heard ponies screaming that the village is going to be completely destroyed!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane looks scared by the situation, trying to understand what is happening. Vinny gets nervous as he began to respond.",
        "type": "action"
    },

    {
        "value": "M...Maybe the black bomb I saw falling from the sky is something? I saw black bomb falling in the middle of the city. Please, look for a military or someone you think is involved in the invasion. We'll force this pony to talk about the bomb.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Bomb?! Are you crazy?! My teleport takes seconds to charge! This is madness! You don't know the destructive power of this bomb!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Calm down! Calm down! Rayane, I can fly to the bomb and look myself. I'll be fine.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "How do you say that if you haven't finished your first training?! VINNY! NOOOOO!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies over the wall. Vinny kept a high speed to try to reach the bomb as fast as possible. Vinny saw the bomb entering the center of the village. Vinny realized that all the destruction was more focused on the center of the village than all the rest of the village. Vinny was getting tired very fast from flying so fast, but Vinny was very dedicated to trying to use as few seconds as possible.",
        "type": "action"
    },

    {
        "value": "Come on! It's going to be easy! Imagine that we are playing CS! Come on Vinny!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny were feeling more and more tired. The center of the village was very much destroyed with a huge crater in the ground. The bomb was about to land in the center of the crater. Vinny then saw the bomb. The place was extremely insulated due to evacuation.",
        "type": "action"
    },

    {
        "value": "WOW! OK I understand. This explains a lot of the noises I heard in the cave.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny landed next to the bomb and try to analyze the stuff. The bomb was starting to pierce the ground. Vinny was desperate to see that the bomb was starting to disappear into the ground.",
        "type": "action"
    },

    {
        "value": "What the fuck is that?! No! COME BACK HERE!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried in various ways to stop the bomb process. As the bomb sank deeper and deeper into the ground, Vinny thought about using the pickaxe piece, but couldn't find time to come up with a plan.",
        "type": "action"
    },

    {
        "value": "FUCK FUCK! FUUUUCK! I'm FUCKED! AH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny flies up and start screaming loudly for help.",
        "type": "action"
    },

    {
        "value": "IS ANYONE HERE?!?! THIS PLACE IS GOING TO EXPLODE!! I CAN TAKE YOU OUT OF HERE!!!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny accidentally finds Rayane running in the middle of the village, looking for something. Vinny saw lots of pony bodies lying on the ground and some gun remains lying around, but Vinny couldn't be sure if the guns could be working or not. Vinny was scared and worried for a few seconds.",
        "type": "action"
    },

    {
        "value": "O..oh god. This looks a lot worse than I imagined. R..Rayane? Holy crap! Rayane!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to fly towards Rayane in an extremely desperate way.",
        "type": "action"
    },

    {
        "value": "RAAAYANE! The time is almost zero! if you have something it's now! The bomb already started digging down! if you have any plans it's now or never!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "NO! Calm down! I had a plan ready! Let's use the plan now!",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane showed a a mysterious military pegasus. The pegasus was desperate and tired.",
        "type": "action"
    },

    {
        "value": "Wow! You are really quick at your task.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane invaded a basement door of a random house and entered this quickly. Vinny without a second thought, helped carry the mysterious pegasus while following Rayane. Vinny was extremely scared and regretful.",
        "type": "action"
    },

    {
        "value": "Rayane! You can use your teleport. S..sorry. No matter what happens, it's my fault. I brought you here. Do your best!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane took a deep breath, trying to keep calm, and just gave a slight serious look.",
        "type": "action"
    },

    {
        "value": "Please Vinny. This is no time to be sorry. Pray for everything to be on time. I'm trying to make your plan work.",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Y...Yes...yes. S...sorry Rayane.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very worried and kept quiet. Vinny tried to keep all his hopes on Rayane. Rayane was very dedicated to keeping her focus on magic as much as possible during the progress.",
        "type": "action"
    },

    {
        "value": "Sssssh~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "AH! AAAAH!",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then suddenly all the sound around was interrupted by an extremely deafening explosion sound. Everything around was extremely bright, Vinny was trying to maintain consciousness while Rayane tried to protect him, but Vinny passed out in the process.",
        "type": "action"
    },

    {
        "value": "R...Rayane? H...hello? R..Rayane?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny's ears were ringing very loudly. It looked like Vinny's hearing was finally starting to recover the ringing as he woke up. The flash was calming down, Vinny was on the ground next to many burnt objects around.",
        "type": "action"
    },

    {
        "value": "Hello? R..Rayane? Somebody?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was very scared, worried, trying to look for Rayane and the pegasus.",
        "type": "action"
    }

]