[
    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 4,
            "weather": "sun",
            "playlistPlay": "happyness"
        },
        "value": "Then the night passed. Several hours passed after a long night's sleep. Vinny just wakes up feeling someone poking him.",
        "type": "action"
    },

    {
        "value": "N..Nooo, no, I still don't want to ride you, you... you... you promised me... you'd let me...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was trying to move on the mattress, but he was starting to feel more pokes, poking him face and the nose.",
        "type": "action"
    },

    {
        "value": "N..No no...A..ah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was starting to open him eyes slowly, woking up during the progress.",
        "type": "action"
    },

    {
        "value": "W..What? Is that you? My... my sweetheart?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to smell something delicious. He was a little confusing about it. Vinny's hoof then tried to poke something randomly.",
        "type": "action"
    },

    {
        "value": "Hmmmm...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was beginning to get up from the mattress toward the smell, but when Vinny tried to do that, Vinny came face to face with Rayane's face, accidentally touching her nose while she was levitating the Vinny breakfast.",
        "type": "action"
    },

    {
        "value": "Pika boo~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane touch her nose against Vinny nose while making a silly, mischievous face.",
        "type": "action"
    },

    {
        "value": "Hello~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprise before giggling in response.",
        "type": "action"
    },

    {
        "value": "Heh! Hiii charming Rayane. What did I miss?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to look at another direction, but Rayane used her magic and changed the direction of Vinny's face to her face again.",
        "type": "action"
    },

    {
        "value": "Shhhhhhh... Silly. You almost missed your breakfast~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was slightly blushed by Rayane's action.",
        "type": "action"
    },

    {
        "value": "Ooohwn....",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looks into Rayane's eyes.",
        "type": "action"
    },

    {
        "value": "Did I mention that you have beautiful eyes?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little and pokes Vinny nose. Then Rayane put the breakfast next to Vinny.",
        "type": "action"
    },

    {
        "value": "Heh. Beautiful eyes to look at my dream~ I woke you up as I promised you.",
        "character": "Rayane",
        "type": "dialogue"
    },

  {
    "value": "Oh... Maybe my breakfast might be something else one day.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a malice look at Rayane but then shook his head to wake up.",
    "type": "action"
  }, 

  {
    "value": "Oh... Please! You can forget what I said! Good morning! Did you sleep well? How is everyone?",
    "character": "Vinny",
    "type": "dialogue"
  },  

  {
    "value": "Hmmmmmmmm... Something else?~ Heheh.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks at Vinny.",
    "type": "action"
  }, 

  {
    "value": "Don't think I forgot everything you said in the last few days. Silly you~ But yes, this was a good night's sleep. Almost everyone is still sleeping. Kai was the only one who got out of bed besides me.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little curious to hear this.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah! He must be under a lot of pressure.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Then Vinny was starting to eat breakfast as he answered Rayane.",
    "type": "action"
  }, 

  {
    "value": "It's understood, he'll have to explain to everyone what happened with the bomb, Hiroshi, about him. And still make a plan to make everyone happy. I hope he gets him among all the guards he was the most different.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at James and when he saw James sleeping, Vinny does a trollface before came back to Rayane.",
    "type": "action"
  }, 

  {
    "value": "Hehe boy. But before I need to have a little fun.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Hmm... Kai's meditating, and looking at the forest. Well... What is the silly boy planning?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
        "playlistPlay": null
    },
    "value": "Vinny was then a little surprised to hear Rayane's question.",
    "type": "action"
  }, 

  {
    "value": "M..Me? Naaaah... I'm worried about James. He wants to solve some issues with Rainbow Queen. James is a little crazy. It's making a deal or a crazy pact. Anyway, I'll make him change his mind and if he doesn't want to. At least he tell me when he's going to do that.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Rayane then got a small feeling of worried, trying to understand what was going on.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "think"
  },
    "value": "W...What? Pact? What is happening to James?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Huh? Pacts with Rain? So you completely told him everything about her?",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Well... I told James everything I know. Not the whole truth.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny looks at James, worried about his actions in the future.",
    "type": "action"
  }, 

  {
    "value": "A...aaah... As James is part of this family. Heh! Here! Take this.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny turns on the cell phone, then Vinny gives the cell phone to Rayane.",
    "type": "action"
  }, 

  {
    "value": "The phone is filming, recording this moment in real time. Heh! You need to record me waking up James in a delicate way, just point at us with the cell phone down. Alright?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Rayane was still curious and worried about hearing all this, but tried to stay calm to see what Vinny was doing.",
    "type": "action"
  },

  {
    "value": "Vinny, please... James needs to be very careful. Rain is very smart when it comes to pacts. She specializes a lot in that.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Hehe. Nah... This time no scare. This is just a caress. This is Affection.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny lay down next to James almost face to face, and spoke very gently caressing him.",
    "type": "action"
  }, 

  {
    "value": "Hey James... How strong you are? Can you carry me? You're very strong! Carry me my love.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Affection? Vinny... You're being really silly. What's going to come out of this?",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Rayane giggles a little, trying to hide the concern a little.",
    "type": "action"
  }, 

  {
    "value": "C...Carry you...zZzZzZz?...W..What?..Is that really you? ZzZzZzz....N..Never spoke..to me like that....ZzZzZz...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was sleeping, but he was confused, and he was trying to hug Vinny while he was sleeping. Meanwhile, Rayane was trying to hold back so she wouldn't laugh too much while filming.",
    "type": "action"
  }, 

  {
    "value": "Silly~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah... Ah? No! No! James... You've done a lot so far, you and your friends have done and saved a lot of lives. Everyone is trusting you. Me never talked to you that way? But do you know who i am?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Bu...but how? Y...you...ZzZz... aren't you Ariella? H..hey wait...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James tries to touch Vinny again and again while still sleeping. Rayane was still laughing, but she was curious about what she was hearing.",
    "type": "action"
  }, 

  {
    "value": "W...What? Ariella? Did he really say this name? What's going on here?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Heh. Silly you will have to escape now~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hey hey! Calm down, I'm not Ariella, you're very euphoric. James! Everything will be fine. Just relax and let life go on, you need to calm down and start liking Vinny and Rayane more. They like you a lot.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny does a face poker, trying to move away from James during the process. James stopped trying to touch Vinny when he heard the Vinny dialogue.",
    "type": "action"
  }, 

  {
    "value": "Wh..what? Are you not Ariella? Who are you?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James slightly tried to open his eyes during the talk.",
    "type": "action"
  }, 

  {
    "value": "Viiish... Turn around Rayane!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny got up and threw himself on the mattress he was sleeping. Vinny then tried to pretend him was sleeping.",
    "type": "action"
  }, 

  {
    "value": "W...What? H..huh? And..wait... No! What fuck is this?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James woke up and keep trying to touch some hoof desperately, dragging himself on the floor, and looked around completely confused.",
    "type": "action"
  }, 

  {
    "value": "Wh...what? AH? R...Rayane?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane laughed at Vinny and James as she continued filming the scene.",
    "type": "action"
  }, 

  {
    "value": "Look who woke up~ Silly scientist.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "What?",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "James keep thinking about the dream for a few seconds.",
    "type": "action"
  },

  {
    "value": "VINNY!",
    "character": "James",
    "type": "dialogue"
  },  

  {
    "value": "Vinny still pretending to be asleep.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
  },
    "value": "Interesting! Very interesting you two! The cutest unassuming couple I've ever seen!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was approaching Vinny, wanting to get some satisfaction. While the whole silly moment continued, even though Rayane demonstrating is laughing at the situation, she was still thoughtful.",
    "type": "action"
  }, 

  {

    "value": "This is very curious. Where Vinny wants to come with all this? Is this part of his plan about Rain? Should I be more careful if he is really thinking about doing what I'm thinking?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "set": {
      "playlistPlay": "silly"
    },
    "value": "Vinny keep pretending she was sleeping, but James levitated Vinny, and looked at him face, waiting for Vinny to open the eyes.",
    "type": "action"
  }, 

  {
    "value": "Hey silly joke. Wake up!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "H..hey hey! Calm down! Rayane come here and give me a hug! Because the James eyes are beautiful!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny keep pretending to be sleeping, trying to hug the wind.",
    "type": "action"
  }, 

  {
    "value": "What?! Are you problem?! Rayane will have a very special marshmallow for you now! Wake up!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James began to shake Vinny in every way possible. Meanwhile, Rayane continued laughing.",
    "type": "action"
  }, 

  {
    "value": "If you two don't stop, I'll have to stop you both my way~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AAAAAAAAH! James!! Stop shaking me!! WHAT THE HELL! Why are you shaking me and Rayane taking a picture?! This is some kind of prank?! Let me go bro!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "So explain that fucking you are doing here!!",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "Rayane does a facehoof when she realized that she had no other alternative. So Rayane smirks and activated the horn magic again and made Vinny and James kiss accidentally during the talk.",
    "type": "action"
  }, 

  {
    "value": "Silly ones... stop~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "H...huh?! WHAT?! W...WHAT?! OH FUUUCK!! GET OUT!!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "AAH?! NO NO! STOP KISSING ME!! WHAT'S HAPPENING HERE?!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The two ones were embarrassed and blushed, trying to get out of the scene. Meanwhile, Rayane keep laughing as she finally finished filming.",
    "type": "action"
  }, 

  {
    "value": "Did you notice? It didn't even hurt. Now it's time for you two to stop~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a super poker face, trying to understand the situation.",
    "type": "action"
  },

  {
    "value": "AH! You take my cell phone, make these pranks and do this. What did I do to you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Meanwhile, James was leaving the scene, desperate trying to clean his mouth.",
    "type": "action"
  },

  {
    "value": "AAAAH!",
    "character": "James",
    "type": "dialogue"
  }, 
  
  {
    "value": "Heh~ It wouldn't be funny for this joke to end with nothing productive with my favorite dream~ Something had to come out of this.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then returned the Vinny's phone to him. When Vinny looked around, everyone had woken up, confused trying to understand the scene. But Ivy was still sleeping.",
    "type": "action"
  }, 

  {
    "value": "H...Heh! Weeell... That was just personal training. Nothing too special! Okay?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then hides his phone during the conversation. Jeff was just doing a poker face before asking the question.",
    "type": "action"
  }, 

  {
    "value": "Hmmm... Are you ok Vinny?",
    "character": "Jeff",
    "type": "dialogue"
  }, 

  {
    "value": "Wagner was speechless to describe the situation. Rowan was laughing lightly, trying to hide the silly laughs.",
    "type": "action"
  }, 


  {
    "value": "Heh~ I want photo credits.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Y..Yes! Fine! Photo credits! Well...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at James, doing a nervous laugh.",
    "type": "action"
  }, 

  {
    "value": "Aaah... James? Good morning. Did you sleep well?",
    "character": "Vinny",
    "type": "dialogue"
  }, 


  {
    "value": "Me? Aaaah! Me! I slept very well! Super hyper mega well!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James then got out of the mattress and started preparing him stuff.",
    "type": "action"
  }, 

  {
    "value": "Yeah! That's good, I'd give you a hug. But I think after everything that's happened... I don't think a hug is necessary anymore.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny giggles a little more nervously.",
    "type": "action"
  },

  {
    "value": "I'm sorry to wake you. B..But... My plan was blown away. Good morning everyone! James, I can hug you more times later.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Everyone remained confused, but still tried to answer.",
    "type": "action"
  }, 

  {
    "value": "Y...Yeah? Good morning!",
    "character": "Jeff",
    "type": "dialogue"
  }, 

  {
    "value": "I see... G..Good morning.",
    "character": "Wagner",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Hug me? Hug me... Oh! hug me! What do you think you were doing?! Okay! Stop!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Sssssh~ Vinny and James. Don't forget to finish eating the breakfast. We have a walk until the next village.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "B...But! I want to see the replay! I can?",
    "character": "Rowan",
    "type": "dialogue"
  }, 

  {
    "value": "Rowan smiles during the question.",
    "type": "action"
  }, 

  {
    "value": "There's no replay!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Vinny does a poker face, turning off the cell phone.",
    "type": "action"
  }, 

  {
    "value": "Okay! Good morning!",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny then continued to eat breakfast again. Everyone looked at the breakfast made by Rayane. And everyone started eating, trying to pretend nothing happened.",
    "type": "action"
  }, 

  {
    "value": "Heh. I hope everyone is enjoying breakfast~ I'll be outside waiting for my dream to finish waking up.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "set": {
      "playlistPlay": "think"
    },
    "value": "Rayane then began to levitate Ivy's mattress, preparing to analyze if Ivy was fine. Wagner was still curious about Ivy, but tried to disguise this feeling a little.",
    "type": "action"
  },

  {
    "value": "W...well... When everyone leaves the tent, I... I... okay. Another time I talk better about it.",
    "character": "Wagner",
    "type": "dialogue"
  },

  {
    "value": "Rayane looks curiously at Wagner for a few seconds, but Wagner looked very shy, he just came back what he was doing. Rayane just pretended that nothing had happened.",
    "type": "action"
  },

  {
    "value": "Phew... Excellent. I did. I made everyone calm down faster. I can't lose much time. I still need to finish what I started. This pegasus needs to survive.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Rayane breathed deeply in a very thoughtful way. Then Rayane decides to use magic to help to put the Ivy mattress on the outside of the tent. Rayane could see that the place is a beautiful day outside. The atmosphere was much happier and sunny. Just the sound of nature, and without the storm, Rayane could see that there was already another village close to the camp.",
    "type": "action"
  },

  {
    "value": "Oh. The next village is here. Okay. I have to be very careful. Rain's pets should be curious about who is this pegasus. Vinny is also very curious about Rain's pets. Vinny must be trying to approach Rain in some way. I will try my best to make us focus on Ivy. This situation cannot go out of control.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Rayane? How is Ivy doing?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then stopped what she was doing, looking curiously at Vinny.",
    "type": "action"
  }, 

  {
    "value": "A...Ah? Vinny? Oh yes! She's still sleeping. I was surprised she still hasn't woken up to all this noise. But at least her Smartmoby is working.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Should we wake her up to give her breakfast?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane is a little thoughtful for a few seconds before answering.",
    "type": "action"
  }, 

  {
    "value": "Hmmmmm... Heh~ If she doesn't wake up, I'll have to use plan b to feed her.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Well! She was conscious with me, she really must be very tired or weak. What did you guys do to her while James and I were arriving?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane gets a little surprised and worried, but she tried not to make this feeling much.",
    "type": "action"
  }, 

  {
    "value": "Silly~ I just put her to sleep. If James can't help her, we'll have to go to the doctor.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "A....",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at Rayane suspiciously for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "You should have thought about that before making us almost kiss, right. She's alive, she must be very exhausted, she was talking, you saw it yourself. What could have happened? Do you have any idea?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Shhhhhh~ Silly one.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane breathed a little deep when looking at Ivy.",
    "type": "action"
  }, 

  {
    "value": "Okay... I don't know how to say it. I don't understand much about health. Maybe she's too weak to wake up. We can't waste much time here now.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Well, anyway, just opening her eyes helps someone feed her. I'm going to ask James if he knows what's going on. Anyway... I'm going to look for Kai, it's dangerous for him to be alone, someone can kidnap him.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane does a little sad look at Ivy as she responded.",
    "type": "action"
  }, 

  {
    "value": "Yes. This is fine. Don't forget... We're close to the Blackburn Village. Ivy can get some medical care there.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little surprised to realize that Rayane knew the name of the next village.",
    "type": "action"
  }, 

  {
    "value": "A..Ah. Okay.",
    "character": "Vinny",
    "type": "dialogue"
  }

]