[
    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 4,
            "weather": "sun",
            "playlistPlay": "happyness"
        },
        "value": "Then the night passed. Several hours passed after a long night's sleep. Vinny just wakes up feeling someone poking him.",
        "type": "action"
    },

    {
        "value": "N..Nooo, no, I still don't want to ride you, you... you... you promised me... you'd let me...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was trying to move on the mattress, but he was starting to feel more pokes, poking him face and the nose.",
        "type": "action"
    },

    {
        "value": "N..No no...A..ah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was starting to open him eyes slowly, woking up during the progress.",
        "type": "action"
    },

    {
        "value": "W..What? Is that you? My... my sweetheart?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to smell something delicious. He was a little confusing about it. Vinny's hoof then tried to poke something randomly.",
        "type": "action"
    },

    {
        "value": "Hmmmm...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was beginning to get up from the mattress toward the smell, but when Vinny tried to do that, Vinny came face to face with Rayane's face, accidentally touching her nose while she was levitating the Vinny breakfast.",
        "type": "action"
    },

    {
        "value": "Pika boo~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane touch her nose against Vinny nose while making a silly, mischievous face.",
        "type": "action"
    },

    {
        "value": "Hello~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprise before giggling in response.",
        "type": "action"
    },

    {
        "value": "Heh! Hiii charming Rayane. What did I miss?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to look at another direction, but Rayane used her magic and changed the direction of Vinny's face to her face again.",
        "type": "action"
    },

    {
        "value": "Shhhhhhh... Silly. You almost missed your breakfast~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was slightly blushed by Rayane's action.",
        "type": "action"
    },

    {
        "value": "Ooohwn....",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looks into Rayane's eyes.",
        "type": "action"
    },

    {
        "value": "Did I mention that you have beautiful eyes?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little and pokes Vinny nose. Then Rayane put the breakfast next to Vinny.",
        "type": "action"
    },

    {
        "value": "Heh. Beautiful eyes to look at my dream~ I woke you up as I promised you.",
        "character": "Rayane",
        "type": "dialogue"
    },

  {
    "value": "Oh... Maybe my breakfast might be something else one day.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a malice look at Rayane but then shook his head to wake up.",
    "type": "action"
  }, 

  {
    "value": "Oh... Please! You can forget what I said! Good morning! Did you sleep well? How is everyone?",
    "character": "Vinny",
    "type": "dialogue"
  },  

  {
    "value": "Hmmmmmmmm... Something else?~ Heheh.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks at Vinny.",
    "type": "action"
  }, 

  {
    "value": "Don't think I forgot everything you said in the last few days. Silly you~ But yes, this was a good night's sleep. Almost everyone is still sleeping. Kai was the only one who got out of bed besides me.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little curious to hear this.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah! He must be under a lot of pressure.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Then Vinny was starting to eat breakfast as he answered Rayane.",
    "type": "action"
  }, 

  {
    "value": "It's understood, he'll have to explain to everyone what happened with the bomb, Hiroshi, about him. And still make a plan to make everyone happy. I hope he gets him among all the guards he was the most different.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
        "playlistPlay": null
    },
    "value": "Vinny looks at James and when he saw James sleeping, Vinny does a trollface before came back to Rayane",
    "type": "action"
  }, 

  {
    "value": "Hehe boy. But before I need to have a little fun.",
    "character": "Vinny",
    "type": "dialogue"
  }

]