[
    {
        "set": {
            "where": "Forest",
            "dayNightCycle": "morning",
            "day": 4,
            "weather": "sun",
            "playlistPlay": "happyness"
        },
        "value": "Then the night passed. Several hours passed after a long night's sleep. Vinny just wakes up feeling someone poking him.",
        "type": "action"
    },

    {
        "value": "N..Nooo, no, I still don't want to ride you, you... you... you promised me... you'd let me...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was trying to move on the mattress, but he was starting to feel more pokes, poking him face and the nose.",
        "type": "action"
    },

    {
        "value": "N..No no...A..ah.",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was starting to open him eyes slowly, woking up during the progress.",
        "type": "action"
    },

    {
        "value": "W..What? Is that you? My... my sweetheart?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny start to smell something delicious. He was a little confusing about it. Vinny's hoof then tried to poke something randomly.",
        "type": "action"
    },

    {
        "value": "Hmmmm...",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny was beginning to get up from the mattress toward the smell, but when Vinny tried to do that, Vinny came face to face with Rayane's face, accidentally touching her nose while she was levitating the Vinny breakfast.",
        "type": "action"
    },

    {
        "value": "Pika boo~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Rayane touch her nose against Vinny nose while making a silly, mischievous face.",
        "type": "action"
    },

    {
        "value": "Hello~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was a little surprise before giggling in response.",
        "type": "action"
    },

    {
        "value": "Heh! Hiii charming Rayane. What did I miss?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Vinny tried to look at another direction, but Rayane used her magic and changed the direction of Vinny's face to her face again.",
        "type": "action"
    },

    {
        "value": "Shhhhhhh... Silly. You almost missed your breakfast~",
        "character": "Rayane",
        "type": "dialogue"
    },

    {
        "value": "Vinny was slightly blushed by Rayane's action.",
        "type": "action"
    },

    {
        "value": "Ooohwn....",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Then Vinny looks into Rayane's eyes.",
        "type": "action"
    },

    {
        "value": "Did I mention that you have beautiful eyes?",
        "character": "Vinny",
        "type": "dialogue"
    },

    {
        "value": "Rayane giggles a little and pokes Vinny nose. Then Rayane put the breakfast next to Vinny.",
        "type": "action"
    },

    {
        "value": "Heh. Beautiful eyes to look at my dream~ I woke you up as I promised you.",
        "character": "Rayane",
        "type": "dialogue"
    },

  {
    "value": "Oh... Maybe my breakfast might be something else one day.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a malice look at Rayane but then shook his head to wake up.",
    "type": "action"
  }, 

  {
    "value": "Oh... Please! You can forget what I said! Good morning! Did you sleep well? How is everyone?",
    "character": "Vinny",
    "type": "dialogue"
  },  

  {
    "value": "Hmmmmmmmm... Something else?~ Heheh.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks at Vinny.",
    "type": "action"
  }, 

  {
    "value": "Don't think I forgot everything you said in the last few days. Silly you~ But yes, this was a good night's sleep. Almost everyone is still sleeping. Kai was the only one who got out of bed besides me.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little curious to hear this.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah! He must be under a lot of pressure.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Then Vinny was starting to eat breakfast as he answered Rayane.",
    "type": "action"
  }, 

  {
    "value": "It's understood, he'll have to explain to everyone what happened with the bomb, Hiroshi, about him. And still make a plan to make everyone happy. I hope he gets him among all the guards he was the most different.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at James and when he saw James sleeping, Vinny does a trollface before came back to Rayane.",
    "type": "action"
  }, 

  {
    "value": "Hehe boy. But before I need to have a little fun.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Hmm... Kai's meditating, and looking at the forest. Well... What is the silly boy planning?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
        "playlistPlay": null
    },
    "value": "Vinny was then a little surprised to hear Rayane's question.",
    "type": "action"
  }, 

  {
    "value": "M..Me? Naaaah... I'm worried about James. He wants to solve some issues with Rainbow Queen. James is a little crazy. It's making a deal or a crazy pact. Anyway, I'll make him change his mind and if he doesn't want to. At least he tell me when he's going to do that.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Rayane then got a small feeling of worried, trying to understand what was going on.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "think"
  },
    "value": "W...What? Pact? What is happening to James?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Huh? Pacts with Rain? So you completely told him everything about her?",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Well... I told James everything I know. Not the whole truth.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny looks at James, worried about his actions in the future.",
    "type": "action"
  }, 

  {
    "value": "A...aaah... As James is part of this family. Heh! Here! Take this.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny turns on the cell phone, then Vinny gives the cell phone to Rayane.",
    "type": "action"
  }, 

  {
    "value": "The phone is filming, recording this moment in real time. Heh! You need to record me waking up James in a delicate way, just point at us with the cell phone down. Alright?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Rayane was still curious and worried about hearing all this, but tried to stay calm to see what Vinny was doing.",
    "type": "action"
  },

  {
    "value": "Vinny, please... James needs to be very careful. Rain is very smart when it comes to pacts. She specializes a lot in that.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Hehe. Nah... This time no scare. This is just a caress. This is Affection.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny lay down next to James almost face to face, and spoke very gently caressing him.",
    "type": "action"
  }, 

  {
    "value": "Hey James... How strong you are? Can you carry me? You're very strong! Carry me my love.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Affection? Vinny... You're being really silly. What's going to come out of this?",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Rayane giggles a little, trying to hide the concern a little.",
    "type": "action"
  }, 

  {
    "value": "C...Carry you...zZzZzZz?...W..What?..Is that really you? ZzZzZzz....N..Never spoke..to me like that....ZzZzZz...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was sleeping, but he was confused, and he was trying to hug Vinny while he was sleeping. Meanwhile, Rayane was trying to hold back so she wouldn't laugh too much while filming.",
    "type": "action"
  }, 

  {
    "value": "Silly~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah... Ah? No! No! James... You've done a lot so far, you and your friends have done and saved a lot of lives. Everyone is trusting you. Me never talked to you that way? But do you know who i am?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Bu...but how? Y...you...ZzZz... aren't you Ariella? H..hey wait...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James tries to touch Vinny again and again while still sleeping. Rayane was still laughing, but she was curious about what she was hearing.",
    "type": "action"
  }, 

  {
    "value": "W...What? Ariella? Did he really say this name? What's going on here?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Heh. Silly you will have to escape now~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hey hey! Calm down, I'm not Ariella, you're very euphoric. James! Everything will be fine. Just relax and let life go on, you need to calm down and start liking Vinny and Rayane more. They like you a lot.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny does a face poker, trying to move away from James during the process. James stopped trying to touch Vinny when he heard the Vinny dialogue.",
    "type": "action"
  }, 

  {
    "value": "Wh..what? Are you not Ariella? Who are you?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James slightly tried to open his eyes during the talk.",
    "type": "action"
  }, 

  {
    "value": "Viiish... Turn around Rayane!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny got up and threw himself on the mattress he was sleeping. Vinny then tried to pretend him was sleeping.",
    "type": "action"
  }, 

  {
    "value": "W...What? H..huh? And..wait... No! What fuck is this?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James woke up and keep trying to touch some hoof desperately, dragging himself on the floor, and looked around completely confused.",
    "type": "action"
  }, 

  {
    "value": "Wh...what? AH? R...Rayane?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane laughed at Vinny and James as she continued filming the scene.",
    "type": "action"
  }, 

  {
    "value": "Look who woke up~ Silly scientist.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "What?",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "James keep thinking about the dream for a few seconds.",
    "type": "action"
  },

  {
    "value": "VINNY!",
    "character": "James",
    "type": "dialogue"
  },  

  {
    "value": "Vinny still pretending to be asleep.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
  },
    "value": "Interesting! Very interesting you two! The cutest unassuming couple I've ever seen!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was approaching Vinny, wanting to get some satisfaction. While the whole silly moment continued, even though Rayane demonstrating is laughing at the situation, she was still thoughtful.",
    "type": "action"
  }, 

  {

    "value": "This is very curious. Where Vinny wants to come with all this? Is this part of his plan about Rain? Should I be more careful if he is really thinking about doing what I'm thinking?",
    "character": "Rayane",
    "type": "think"
  },

  {
    "set": {
      "playlistPlay": "silly"
    },
    "value": "Vinny keep pretending she was sleeping, but James levitated Vinny, and looked at him face, waiting for Vinny to open the eyes.",
    "type": "action"
  }, 

  {
    "value": "Hey silly joke. Wake up!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "H..hey hey! Calm down! Rayane come here and give me a hug! Because the James eyes are beautiful!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny keep pretending to be sleeping, trying to hug the wind.",
    "type": "action"
  }, 

  {
    "value": "What?! Are you problem?! Rayane will have a very special marshmallow for you now! Wake up!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James began to shake Vinny in every way possible. Meanwhile, Rayane continued laughing.",
    "type": "action"
  }, 

  {
    "value": "If you two don't stop, I'll have to stop you both my way~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AAAAAAAAH! James!! Stop shaking me!! WHAT THE HELL! Why are you shaking me and Rayane taking a picture?! This is some kind of prank?! Let me go bro!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "So explain that fucking you are doing here!!",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "Rayane does a facehoof when she realized that she had no other alternative. So Rayane smirks and activated the horn magic again and made Vinny and James kiss accidentally during the talk.",
    "type": "action"
  }, 

  {
    "value": "Silly ones... stop~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "H...huh?! WHAT?! W...WHAT?! OH FUUUCK!! GET OUT!!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "AAH?! NO NO! STOP KISSING ME!! WHAT'S HAPPENING HERE?!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The two ones were embarrassed and blushed, trying to get out of the scene. Meanwhile, Rayane keep laughing as she finally finished filming.",
    "type": "action"
  }, 

  {
    "value": "Did you notice? It didn't even hurt. Now it's time for you two to stop~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a super poker face, trying to understand the situation.",
    "type": "action"
  },

  {
    "value": "AH! You take my cell phone, make these pranks and do this. What did I do to you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Meanwhile, James was leaving the scene, desperate trying to clean his mouth.",
    "type": "action"
  },

  {
    "value": "AAAAH!",
    "character": "James",
    "type": "dialogue"
  }, 
  
  {
    "value": "Heh~ It wouldn't be funny for this joke to end with nothing productive with my favorite dream~ Something had to come out of this.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then returned the Vinny's phone to him. When Vinny looked around, everyone had woken up, confused trying to understand the scene. But Ivy was still sleeping.",
    "type": "action"
  }, 

  {
    "value": "H...Heh! Weeell... That was just personal training. Nothing too special! Okay?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then hides his phone during the conversation. Jeff was just doing a poker face before asking the question.",
    "type": "action"
  }, 

  {
    "value": "Hmmm... Are you ok Vinny?",
    "character": "Jeff",
    "type": "dialogue"
  }, 

  {
    "value": "Wagner was speechless to describe the situation. Rowan was laughing lightly, trying to hide the silly laughs.",
    "type": "action"
  }, 


  {
    "value": "Heh~ I want photo credits.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Y..Yes! Fine! Photo credits! Well...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at James, doing a nervous laugh.",
    "type": "action"
  }, 

  {
    "value": "Aaah... James? Good morning. Did you sleep well?",
    "character": "Vinny",
    "type": "dialogue"
  }, 


  {
    "value": "Me? Aaaah! Me! I slept very well! Super hyper mega well!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James then got out of the mattress and started preparing him stuff.",
    "type": "action"
  }, 

  {
    "value": "Yeah! That's good, I'd give you a hug. But I think after everything that's happened... I don't think a hug is necessary anymore.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny giggles a little more nervously.",
    "type": "action"
  },

  {
    "value": "I'm sorry to wake you. B..But... My plan was blown away. Good morning everyone! James, I can hug you more times later.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Everyone remained confused, but still tried to answer.",
    "type": "action"
  }, 

  {
    "value": "Y...Yeah? Good morning!",
    "character": "Jeff",
    "type": "dialogue"
  }, 

  {
    "value": "I see... G..Good morning.",
    "character": "Wagner",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Hug me? Hug me... Oh! hug me! What do you think you were doing?! Okay! Stop!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Sssssh~ Vinny and James. Don't forget to finish eating the breakfast. We have a walk until the next village.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "B...But! I want to see the replay! I can?",
    "character": "Rowan",
    "type": "dialogue"
  }, 

  {
    "value": "Rowan smiles during the question.",
    "type": "action"
  }, 

  {
    "value": "There's no replay!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Vinny does a poker face, turning off the cell phone.",
    "type": "action"
  }, 

  {
    "value": "Okay! Good morning!",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny then continued to eat breakfast again. Everyone looked at the breakfast made by Rayane. And everyone started eating, trying to pretend nothing happened.",
    "type": "action"
  }, 

  {
    "value": "Heh. I hope everyone is enjoying breakfast~ I'll be outside waiting for my dream to finish waking up.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "set": {
      "playlistPlay": "think"
    },
    "value": "Rayane then began to levitate Ivy's mattress, preparing to analyze if Ivy was fine. Wagner was still curious about Ivy, but tried to disguise this feeling a little.",
    "type": "action"
  },

  {
    "value": "W...well... When everyone leaves the tent, I... I... okay. Another time I talk better about it.",
    "character": "Wagner",
    "type": "dialogue"
  },

  {
    "value": "Rayane looks curiously at Wagner for a few seconds, but Wagner looked very shy, he just came back what he was doing. Rayane just pretended that nothing had happened.",
    "type": "action"
  },

  {
    "value": "Phew... Excellent. I did. I made everyone calm down faster. I can't lose much time. I still need to finish what I started. This pegasus needs to survive.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Rayane breathed deeply in a very thoughtful way. Then Rayane decides to use magic to help to put the Ivy mattress on the outside of the tent. Rayane could see that the place is a beautiful day outside. The atmosphere was much happier and sunny. Just the sound of nature, and without the storm, Rayane could see that there was already another village close to the camp.",
    "type": "action"
  },

  {
    "value": "Oh. The next village is here. Okay. I have to be very careful. Rain's pets should be curious about who is this pegasus. Vinny is also very curious about Rain's pets. Vinny must be trying to approach Rain in some way. I will try my best to make us focus on Ivy. This situation cannot go out of control.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Rayane? How is Ivy doing?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then stopped what she was doing, looking curiously at Vinny.",
    "type": "action"
  }, 

  {
    "value": "A...Ah? Vinny? Oh yes! She's still sleeping. I was surprised she still hasn't woken up to all this noise. But at least her Smartmoby is working.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Should we wake her up to give her breakfast?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane is a little thoughtful for a few seconds before answering.",
    "type": "action"
  }, 

  {
    "value": "Hmmmmm... Heh~ If she doesn't wake up, I'll have to use plan b to feed her.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Well! She was conscious with me, she really must be very tired or weak. What did you guys do to her while James and I were arriving?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane gets a little surprised and worried, but she tried not to make this feeling much.",
    "type": "action"
  }, 

  {
    "value": "Silly~ I just put her to sleep. If James can't help her, we'll have to go to the doctor.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "A....",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks at Rayane suspiciously for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "You should have thought about that before making us almost kiss, right. She's alive, she must be very exhausted, she was talking, you saw it yourself. What could have happened? Do you have any idea?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Shhhhhh~ Silly one.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane breathed a little deep when looking at Ivy.",
    "type": "action"
  }, 

  {
    "value": "Okay... I don't know how to say it. I don't understand much about health. Maybe she's too weak to wake up. We can't waste much time here now.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Well, anyway, just opening her eyes helps someone feed her. I'm going to ask James if he knows what's going on. Anyway... I'm going to look for Kai, it's dangerous for him to be alone, someone can kidnap him.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane does a little sad look at Ivy as she responded.",
    "type": "action"
  }, 

  {
    "value": "Yes. This is fine. Don't forget... We're close to the Blackburn Village. Ivy can get some medical care there.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little surprised to realize that Rayane knew the name of the next village.",
    "type": "action"
  }, 

  {
    "value": "A..Ah. Okay.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny was thoughtful for a few seconds. Then Vinny finally decided to go to James.",
    "type": "action"
  }, 

  {
    "value": "Blackburn! Yeah! What does James know about this place?",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Hey James! Sorry for the way I woke you up... How are you?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "James then finished preparing him stuff and walked toward Vinny.",
    "type": "action"
  },

  {
    "value": "Me? Ah... Good.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James breathed deeply, trying not to talk much about it. Then James was starting to leave the tent toward Rayane.",
    "type": "action"
  }, 

  {
    "value": "James? Aah... Well... How is Ivy?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was a little surprised to hear the question, but then the conversation continued.",
    "type": "action"
  }, 

  {
    "value": "Ivy is on the same situation... lots of broken bones, difficulty breathing... But she's alive. I was very confident in trying to help her, but I got really scared when I saw that her body was so much more damaged than I imagined. I don't have enough training to do this kind of thing.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James breathed deeply before continuing the conversation sadly.",
    "type": "action"
  }, 

  {
    "value": "I'm sorry Vinny. I can't be useful for you now.",
    "character": "James",
    "type": "dialogue"
  },


  {
    "value": "W..What? Oh no no no. Do not need to be sad! Her being alive already helps and a lot. I'm here to thank you for helping her. Anyway, Rayane said we're close to Blackburn. We can get some assistance there. As much as I think it will cost money.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James raised his head, trying to be positive during the talk.",
    "type": "action"
  }, 

  {
    "value": "Oh? Blackburn? Well, yes, it's a good place. But remember that we can't stay long in this village with Ivy. This village is sometimes a little haunted at night.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was a little thoughtful for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "But well... At least these haunts do not even let the bad ponies try to invade the houses.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny is surprised, so him responded with a lot of curiosity on the subject.",
    "type": "action"
  },

  {
    "value": "This is interesting... Can you explain more?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "R...Really? Okay. There is a haunted village next to Blackburn. It is an abandoned village that was supposed to be another common village in this region, but it seems that its founder ended up being cursed and disappeared. So sometimes strange things happen coming from this village towards Blackburn.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James looked curiously at Vinny, suspecting something.",
    "type": "action"
  }, 

  {
    "value": "This mysterious village is a huge cemetery. if you don't take care of yourself right, you could be unlucky for something to happen to you. Do not try to let the ghosts of this village have a lot of contact with you!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmmmm... Anyway we need to go to Blackburn to take care of Ivy, priorities first, then we hunt ghosts. Heh! Thanks for the help again. I'll try to find Kai and talk to him. Kai is Hiroshi's successor, he must be very anxious now.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "James then levitated the backpack, ready to put in the back again. James was a little thoughtful as he answered.",
    "type": "action"
  }, 

  {
    "value": "We hunt ghosts? What? You're welcome. W...Well...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Don't forget the tablet!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny spoke a little softly for only James to hear.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "This tablet may be something that will help us. Alright?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Then Vinny put his sunglasses when he finished speaking while James was a little surprised.",
    "type": "action"
  }, 

  {
    "value": "A..ah... the tablet. Yes! I kept it in my backpack.",
    "character": "James",
    "type": "dialogue"
  },

  {
    "set": {
      "playlistPlay": "bad-think"
    },
    "value": "Meanwhile, Rayane was getting ready to put Ivy on her back. Rayane was looking a little emotional at Ivy.",
    "type": "action"
  }, 

  {
    "value": "So you are ready Ivy. Let's take you to the hospital. I know the perfect way for us to run there without being at risk of hurting you.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Ah? Rayane? Are you doing? When are you going to take me to the places on your back?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Oh? V..Vinny? Heh~ Silly you. Are you thinking about?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then put a cover to almost completely cover Ivy's body, so she was safe during the travel. Vinny was then curious wanting to know what Rayane was doing, but he first asked a silly question.",
    "type": "action"
  }, 

  {
    "value": "You carrying me to a mountain of money on your back. Me and you on a galloping travel. Heh heh! What will you do? Will you want to look for help now?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Mountain of money? Silly you. There's something much better than money~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little sadly as she prepared a magic on Ivy's body slowly.",
    "type": "action"
  }, 

  {
    "value": "But yes, we need to go now. You need to help everyone to be oriented to go to the village as I take Ivy to the hospital.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little surprised and curious during the talk.",
    "type": "action"
  }, 

  {
    "value": "So let's go. But wait... Something better than money? Would it be another time you and me alone? Hmmm... You can't stop thinking about it. Hihi! One question for you! Why does it seem that every time you look at ivy you seem to get emotional?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was then a little thoughtful for a few seconds before breathing deeply and sadly.",
    "type": "action"
  }, 

  {
    "value": "This is special moments. I feel sorry for her. So lonely to just die this way. She reminds me of some things from my past, for me it would be unfair for her to just leave this way without having enjoyed something good in her life.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane continued to concentrate magic in the horn, almost finishing preparing what she wanted to do.",
    "type": "action"
  },

  {
    "value": "Vinny... I promise I'll see you again when she's safe in the hospital.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? No no! I'll go with you!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was then a little surprised by Vinny's determination.",
    "type": "action"
  }, 

  {
    "value": "Are you sure? And you weren't going to talk to Kai?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "I...I.... Well! Anything him just came to me! You know!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny... Don't worry about me.",
    "character": "Kai",
    "type": "dialogue"
  }, 

  {
    "value": "Kai then approached, surprising a little Vinny and Rayane. Kai was there listening to the entire conversation.",
    "type": "action"
  }, 

  {
    "value": "K..Kai?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Huh!? How did you get here?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "I wasn't far from here. I was just meditating. It's still morning. Anyway, we'll still have time to talk. The first thing we need is a temporary home, and that's what I'll do when we get to that village.",
    "character": "Kai",
    "type": "dialogue"
  }, 

  {
    "value": "Oh yes, I had forgotten that you are allowed to do that.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "But remember that this house is not for us. Jeff and Wagner needs a new house, but at least we will have a quieter place, protected from the haunts of the night. You two... Go and do what needs to be done.",
    "character": "Kai",
    "type": "dialogue"
  }, 

  {
    "value": "Kai smiles slightly during the talk.",
    "type": "action"
  }, 

  {
    "value": "You have something much more important to do now.",
    "character": "Kai",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane and Vinny then smile back in response.",
    "type": "action"
  }, 

  {
    "value": "Alright! Good luck to you too Kai!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Heh~ So let's go. It's time for us to run to Blackburn!",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Vinny does a small worry smile as him waved to Kai while Rayane's horn then began to shine while she was preparing to run.",
    "type": "action"
  }, 

  {
    "value": "Yes... Good luck, Kai. I...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {    
    "set": {
      "playlistPlay": "troubles"
    },
    "value": "Then suddenly Rayane was starting to run at high speed, leaving a rainbow trail. Vinny then was surprised to see this.",
    "type": "action"
  }, 

  {
    "value": "W..What? OH FUCK! CHARMING RAYANE! WAIT ME!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then started trying to follow Rayane.",
    "type": "action"
  },

  {
    "value": "W...wow? Heh. Yes... Good luck to you both too.",
    "character": "Kai",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was surprised by Rayane's speed, trying not to lose her presence.",
    "type": "action"
  }, 

  {
    "value": "Heh~ I'll win.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane starts to run faster during the talk.",
    "type": "action"
  }, 

  {
    "value": "Hey! COME ON! it's going to break Ivy body more!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Oh... He didn't understand my magic, but that's fine.",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Rayane increased her speed even more, doing big push on her hooves to jump very high and start running over the trees, doing parkur to have even more speed in her movements.",
    "type": "action"
  }, 

  {
    "value": "WOW! Rayane! This is very fast to me!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny spoke loudly before starting to fly up, following Rayane. That way it was easier Vinny to locate the direction where Rayane was going, so Vinny could see the village mentioned by Rayane.",
    "type": "action"
  }, 

  {
    "value": "Yours wasn't the first!~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was still surprised and kept trying to use him pegasus advantage to try to follow the speed of Rayane's movements. Rayane then smirks at Vinny for a few seconds as she let Vinny get a little closer as her horn shone a little more.",
    "type": "action"
  }, 

  {
    "value": "You dropped it!!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes~",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Vinny put all him strength into flying during the progress. Vinny was not strange, but everything was going faster than usual for a few seconds. At this very moment Rayane then finished the use of magic, making Rayane and Vinny arrive at the village instantly. Rayane very tired due to the accumulation of magic energy to use the spell, it made Vinny get first than her at the end.",
    "type": "action"
  }, 

  {
    "value": "YEAH! Dropped his victory!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was a little impressed, but then she giggles for a few seconds.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Heh~ It doesn't even look like the same little Vinny that I trained the flight a while ago~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
      "where": "Blackburn Village"
  },
    "value": "Rayane does a huge jump towards the top of the village wall then stayed the rest of the way on top of the wall, finishing braking the movements until she came face to face with a guard extremely scared of Rayane's movements.",
    "type": "action"
  },

  {
    "value": "G...good morning Rayane... You didn't forget that we have a gate, right?",
    "character": "Guard",
    "type": "dialogue"
  }, 

  {
    "value": "The guard was trying to understand what had just happened and how Vinny and Rayane arrived so fast.",
    "type": "action"
  }, 

  {
    "value": "Shhhhhhh~ Good morning. Don't worry. The next day I remember. Silly one~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": "tense-mystery"
    },
    "value": "Rayane breathed deeply to recover her breath and began to go down the steps of the village wall slowly, walked toward Vinny that was on the floor waiting for her.",
    "type": "action"
  }, 

  {
    "value": "We're here~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was curious, thinking about guard. Vinny rubs him hoof over the head.",
    "type": "action"
  }, 

  {
    "value": "R..Rayane? When will I be known too? Hm?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh heh~ Excellent. Vinny was very distracted by the race. Now I just need to arrive at the hospital to try to save Ivy life. I hope no one has felt the energy of this magic. This was more than necessary to use.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Good morning guard.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh~ Everything in its own time. Silly Vinny~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmmm. Yeah! Okay! And Good morning guard.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The guard was even more confused and scare to realize that he had not seen Vinny too.",
    "type": "action"
  },

  {
    "value": "Wh... what? And another guest?! Good morning... Please go down the wall before someone comes along to scold me because I'm leaving civilians up here.",
    "character": "Guard",
    "type": "dialogue"
  }, 

  {
    "value": "Heh~ sorry, we needed to take a shortcut to an emergency.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Meanwhile, Vinny could see that in the center of the village there were many ponies in one place.",
    "type": "action"
  }, 

  {
    "value": "Yes... but... Ah? What's going on?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then tried to follow Rayane. Rayane was tired, but she continued to follow her way to the hospital.",
    "type": "action"
  }, 

  {
    "value": "Don't worry, the center of the village is a big market. Do not miss the focus of our goal.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Aaaah... Okay okay! Don't talk! Let's go!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane keep walking inside the village, some ponies were surprised, trying to understand the reason about Rayane was in a hurry, Vinny just continued to follow Rayane as if nothing had happened, trying not to pay much attention.",
    "type": "action"
  }, 

  {
    "value": "Come here. We are almost there!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Yeah!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then finally came close to the hospital door, and entered as quickly as possible.",
    "type": "action"
  }, 

  {
    "value": "Pheew! Finally! Ah yes! Finaaally! We arrived.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was panting, and Vinny was a little worried, so Vinny just looked at Rayane curiously.",
    "type": "action"
  }, 

  {
    "value": "R..Rayane? And now?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Follow me again...",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then walked between ponies, making all the possible effort until finally arrived at the attendant.",
    "type": "action"
  }, 

  {
    "value": "Oh yes... Everypony... just down the hall... Doctor is wating for you and... W..What?! R...Rayane?!",
    "character": "Hospital Attendant",
    "type": "dialogue"
  },

  {
    "value": "No talking! This is an emergency!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hospital attendant looked very curiously at Rayane, trying to understand what was really happening.",
    "type": "action"
  },

  {
    "value": "W..What? B..but...but what emergency? And... I'm not seeing anyone hurt.",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane took off the clothes that were covering Ivy's body and started to levitate her.",
    "type": "action"
  }, 

  {
    "value": "She needs a stretcher now!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Oh! M..my Rainbow! Okay okay...I'm bring a stretcher now!",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "The hospital attendant then began to contact the hospital emergency team. Viny only see ponies waiting for service, and everyone was very surprised by the scene that was happening, trying to understand what was happening.",
    "type": "action"
  }, 

  {
    "value": "W...Well! Everyone here seems more surprised than me.",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "OKAY! Everypony getting out of the way NOW! This is more than an emergency! Now!",
    "character": "Doctor",
    "type": "dialogue"
  },

  {
    "value": "W...Wow!",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny see some earth ponies arriving with the stretcher. Rayane put Ivy on the stretcher without thinking twice during the progress. Then the doctors send Ivy to the hall. Everyone was still surprised, but Rayane ignored everyone's reaction and just breathed deeply on relief.",
    "type": "action"
  }, 

  {
    "value": "Phew! I... I did it. Y..Yes. I did. F..finaaaally.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then realized that the hospital attendant was looking at her very curiously.",
    "type": "action"
  }, 

  {
    "value": "R...Rayane? This is a surprise to see here! I never seen you on a hospital or bring some patient to a hospital. Our hospital network has no information about you. We will generate your password for you to be allowed to enter soon. Alright? But.... W..What happened for you came here?",
    "character": "Hospital Attendant",
    "type": "dialogue"
  },

  {
    "value": "This is personal. And please register his name too. He's with me.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Then Rayane introduced Vinny during the talk. The attendant was a little more surprised to see Vinny.",
    "type": "action"
  }, 

  {
    "value": "O..Oh! W..Well... Okay. Hello! What's your name?",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "Hospital Attendant smiled nervously in response. Vinny thought it was a little strange, but only responded normally.",
    "type": "action"
  }, 

  {
    "value": "Vinny, my name is Vinny.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "A..ah yes. And what are you? What is your marital status?",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "Hmm... Just being friends. But in the future maybe married. Heh! I think this charming pony is very beautiful for someone like me.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The attendant was a little blushed, not understanding what was happening, she seemed embarrassed and very confused.",
    "type": "action"
  }, 

  {
    "value": "R..Really?",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny... Silly you~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Okay okay! Here is the password for the registration of the two of you. The doctor will come to call you two soon.",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "The attendant then showed the scannement table, and Rayane progressed to let the Smartmoby be scanned.",
    "type": "action"
  }, 

  {
    "value": "Oh! Thank you very much!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny smiles during the talk.",
    "type": "action"
  }, 

  {
    "value": "I say the same~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Then the attendant was still smiling nervously, and waved them both before returning to work.",
    "type": "action"
  }, 

  {
    "value": "Yes...yes. I'm happy for this. Sorry for my attitude. I need to keep my posture.",
    "character": "Hospital Attendant",
    "type": "dialogue"
  }, 

  {
    "value": "Hihi! All right.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny pretended that everything was normal and just walked with Rayane.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "sad"
    },
    "value": "Rayane? Really? Why doesn't anyone come up to me and say... Vinny? Why only Rayane? What do I need to do to be known like you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Shhhhh~ Long story. I've done a lot in this world. Some moment will come your time too, I'm sure about this.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Rayane breathed deeply before continuing the conversation sadly.",
    "type": "action"
  },

  {
    "value": "And I hope you can do it all the right way.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Rayane sit on one of the benches and started to wait while she was very thoughtful about Ivy.",
    "type": "action"
  },

  {
    "value": "It looks like things are going well. Nothing came out of my plan. Now I just need to be patient. I'm sure the time we'll stay here will be more than enough for Kai to help others find the house for all of us to stay.",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "Hey Rayane. I understand, I just hope I don't get known in the first moments in this world like a Rayane's helper partner. Hihi! I like getting somewhere everyone says... \"Look! Rayane and her help partner...\". I even accept a \"Look\", and \"Rayane and Vinny\", or \"Look! This is Vinny and Rayane...\".",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then giggles a little about the conversation, trying to make Rayane feel better.",
    "type": "action"
  }, 

  {
    "value": "But! What are we going to do now?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh. Silly you. Don't worry. I'll give you a little help to promote your title~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little, trying to maintain a positive talk.",
    "type": "action"
  }, 

  {
    "value": "But we'll have to wait some doctor come here for now. Will you want to talk more about something?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little thoughtful for a few seconds before answering.",
    "type": "action"
  },

  {
    "value": "Okay. A good talk... What do you know about Ivy's condition? You suddenly wanted to run non-stop at full speed and before you didn't care. Did she get worse? Do you know something?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then looked at the floor like a mirror, thinking about the past for a few seconds before looking at Vinny again.",
    "type": "action"
  },

  {
    "value": "Just worries... Maybe I'm very anxious to see that she hasn't even opened an eye yet.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Really? Promise are you telling the truth?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was then a little curious about Vinny's curiosity, Rayane just made a little sad smile.",
    "type": "action"
  },

  {
    "value": "Yes. I promise. My despair was happening when I felt her smartmoby getting weak even more. I didn't want to see her energy like this. Hiroshi's death makes me feel that this pony needs to be my little hope for a better future in my feelings.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then smiled a little as he heard Rayane's answer.",
    "type": "action"
  },

  {
    "value": "Hm... What does that mean? Was Ivy getting weaker?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes. The weaker her soul gets... the closer to death she is. This energy inside her soul cannot end.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane slowly became a little more worried, but tried to accept the situation that was happening, she just closed her eyes and kept talking.",
    "type": "action"
  }, 

  {
    "value": "I myself almost ended up using all my soul energy accidentally during my magic spells.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Vinny was then thoughtful, trying to understand Rayane's words, then replied.",
    "type": "action"
  }, 

  {
    "value": "Oh... Is there something inside her that is bad? Something like a internal bleeding?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Are you saying about something like a body blood? No. That doesn't exist in this world. Our body has a different composition.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little confused, and tried to understand what he remembered about what James said about Pony Driland's dimension.",
    "type": "action"
  }, 

  {
    "value": "D..Different composition? Ah! I see. Well! Let's wait then. Do you want to talk about something more?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "No. Thank you Vinny... But I want just wait now. We can talk better about it later.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was then curious, trying to understand Rayane's behavior change.",
    "type": "action"
  }, 

  {
    "value": "Are you sure?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes. But it's easier for us to talk about Ivy after hearing the doctor's words for now.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hm! A good thing will not be. Before waiting, how does it work? We need to pay to use hospital in this world?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes. But don't worry about it. I'll pay for everything myself. Maybe the hospital is the only different place I know that has a little more freedom technology.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Freedom technology? I...I... Okay! Let's wait.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "So a few hours passed, Vinny and Rayane were already tired, but they were still sitting waiting for something to happen. Rayane was a little depressed when thinking about Ivy, but then she stopped being thoughtful when she heard the presence of a female unicorn coming.",
    "type": "action"
  }, 

  {
    "value": "Vinny? Rayane? I need to talk to you two...",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then open his eyes a little and look curiously at Raynae.",
    "type": "action"
  }, 

  {
    "value": "Ah... Rayane?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "H..huh? Ah yes. Hello doctor.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then got a little anxious, and looked at the doctor.",
    "type": "action"
  }, 

  {
    "value": "Hello. So please... follow me. We have good news and bad news.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "W..What?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was worried to hear that, so Vinny and Rayane got up and started to follow the doctor.",
    "type": "action"
  }, 

  {
    "value": "Hm? Did something happen?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Yes. We did several tests. As much as she is alive, we still have a very serious problem to deal with...",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Then everyone finally arrived in Ivy's room, and started to enter the room slowly.",
    "type": "action"
  },

  {
    "value": "W...Well... Doctor? What's the problem?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was starting to feel worried looking at Rayane. Rayane seemed to really want that moment to end.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "bad-mystery"
    },
    "value": "Well...",
    "character": "Doctor",
    "type": "dialogue"
  },

  {
    "value": "Doctor closes the door for everything to be silent. Everyone then finally could see Ivy lying on the bed. Ivy was still asleep, but her body felt weak and dry. All that could be seen was a power cable connected to Ivy's smartmoby.",
    "type": "action"
  }, 

  {
    "value": "Looks like your friend is in a coma. That means her body has definitely stopped responding. Her entire body is very damaged, preventing her from regaining her energies.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor looked at Vinny and Rayane's astonished reaction, so the doctor tried to speak more calmly.",
    "type": "action"
  }, 

  {
    "value": "We are in an extremely risky moment, and she has few days to live. We can't risk trying to restore her body without having some risk of accidentally killing her in the process. Trying to recover her body is a \"minefield\" for us, anything we accidentally damage will be instant death.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "B..but but...",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "This way... the only way to get her back is some miracle that fixes her whole body, but unfortunately we can't do that. But what we can do is keep her in treatment in case you have any ideas or know someone who knows more than us how to solve this.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "O...Okay! But... that's the bad news. And the good news?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The doctor then took a deep breath, preparing to continue the conversation, feeling disappointed and sad.",
    "type": "action"
  }, 

  {
    "value": "The good news is that we can keep her alive using our special hospital device. But we have no guarantee on how long she will be alive in this room. We've already identified who the pegasus is. Her name is Ivy, but unfortunately we couldn't find any other pony close to her.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Yes. I understand Doctor... if I may ask, when you talk about someone who knows more than us, what exactly do you mean? Someone who understands body anatomies? I really don't understand, a little while ago she was even conscious, talking, she just didn't move. how could this have happened?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor then took a deep breath before answering sadly.",
    "type": "action"
  }, 
  
  {
    "value": "I mean some magical creature. There are rare stories of patients who were cured by special methods. But we never discovered its origins. So unfortunately that's all we can offer at the moment.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "W..What? magical creature? R...Rain? This is you?",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "The Ivy's body had natural energy to keep active. But after she slept, unfortunately her body can't have enough energy to wake up again.",
    "character": "Doctor",
    "type": "dialogue"
  },

  {
    "value": "Rayane was a little afraid for a few seconds when she heard the doctor's words.",
    "type": "action"
  }, 
  
  {
    "value": "T..The sleep? N..No! My magic!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane tried to hide the tears a little during the conversation.",
    "type": "action"
  }, 


  {
    "value": "I see... Rayane, do you want to say something? Or ask something?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Me? N...nothing. Just nothing. All my final alternatives are completely almost impossible.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Well... Doctor? Can we be alone for a while?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor was curious for a few seconds, impressed to see Rayane's feelings.",
    "type": "action"
  }, 

  {
    "value": "All right. Feel free. If you need anything, talk to reception to call me back. But before. Keep it...",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor delivered a communicator to Vinny.",
    "type": "action"
  }, 

  {
    "value": "What?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "This is our communicator with the hospital, use it only when you want to talk to me again. The only restriction is the ban on reverse engineering. So be careful.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor leaned on Rayane's shoulder while trying to speak positively.",
    "type": "action"
  }, 

  {
    "value": "R..Rayane? Listen me please. We are here to help you. No matter who you are. Our job in the end is to help everyone. So please remember this.",
    "character": "Doctor",
    "type": "dialogue"
  }, 

  {
    "value": "Yes... T..Thank you doctor. Thank you very much.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Doctor smiles a little and just left the room. So it was just Vinny, Ivy and Rayane alone in the room now.",
    "type": "action"
  }, 

  {
    "value": "Okay... Rayane? Look at me now. Please. I'm here for you. Calm down... everything will be fine with Ivy. Everything will be okay. Trust me please.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny sat next to Rayane, trying to help her feel better.",
    "type": "action"
  }, 

  {
    "value": "B...But! She cannot die! What can I do now? I don't know any pony that knows how to do this miracle. Is this some trick by Rain? I'm lost!!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane started to cry a lot during the talk.",
    "type": "action"
  }, 

  {
    "value": "A...Ah? Do what exactly? What's going on?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rain also has regeneration magic like me. It was Rain who taught me this skill. But the Rain's regeneration magic is extremely stronger than mine. Do you think it's going to be easy for me to just walk up to her and ask that? Of course not. She won't do that because she has her crazy rules that she can't play god!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane began to cry even more.",
    "type": "action"
  }, 

  {
    "value": "Calm down, calm down, I know we're going to help, nothing was in vain. We'll help Ivy get through this one. Doctor said something like special stuff. In plural. And this village is feared for having ghosts.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny hugs Rayane tightly while smiling sadly.",
    "type": "action"
  }, 

  {
    "value": "Something strange is happening and we can try to take advantage of it to help Ivy.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Rayane hugs Vinny back and cries a little more, trying to calm down.",
    "type": "action"
  }, 

  {
    "value": "G...ghosts? And... and what can ghosts do? They are lost souls who couldn't accept death... that's all. Do you know something I don't?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmm... Okay. I don't know. I've never asked some ways to save a pegasus friend from a dead person, I just asked the doctor, for sure there are other ways, we're just not looking at it yet.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "I hope we find this way. I don't want to lose any more ponies! I'm not ready to see more ponies next to me just die. No more deaths!",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane continued crying, but slowly she calmed down more and more during the progress.",
    "type": "action"
  }, 

  {
    "value": "Y..Yes. No more deaths... No more...",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Vinny then waited for Rayane to finish calming down before continuing the conversation.",
    "type": "action"
  }, 

  {
    "value": "Rayane... You do not remember? You used your magic to make Ivy smartmoby weak. You use magic to make her go back to normal can't help?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "No. I already did that a long time ago... And even if I forget... that spell would be nullified by itself during the night sleep.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was disappointed with himself listening to Rayane's answers. Vinny would then look at the hospital's communicator for a few seconds before looking back at Rayane.",
    "type": "action"
  }, 

  {
    "value": "Well... There are many other ways. We just don't know yet. You said that your scythe's friend doesn't want to play god, but she can help us. Look at this way... this is \"business\". But... And this radio? What the hell is this?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane took a deep breath before replying sadly. Wiping a little tears from her eyes.",
    "type": "action"
  }, 

  {
    "value": "It's a hospital communicator. Hospitals are rare exceptions in this world that can have a communicator. But you heard what the doctor said... We can't change it. But that doesn't matter, James already has more than enough through the phone.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then become curious, suspecting something.",
    "type": "action"
  }, 

  {
    "value": "W..What? That's weird, can't you guys hear us? Why are hospitals an exception?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "It's a secret of the health system itself. But I'm sure you can trust it for now. But anyway. We can go now. I don't want our conversation to disturb Ivy's rest.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny still found it very strange, but then he felt a little delinquent about making noise in the room.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah. Okay. Come on... let's save her.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane looks at Ivy, levitating the her spy outfit to protect Ivy's body delicately. The outfit felt like it was hugging Ivy gently. Rayane then smiled a little at Ivy before starting to get up and prepare to leave the room. Vinny felt good seeing Rayane helping Ivy, so he responded.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Okay. Does this communicator stay with us or do we leave it at the reception?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "This communicator stays with us. If the hospital wants to talk to us, they will use this communicator.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Then Rayane and Vinny left the room and closed the door slowly. Then the two started walking towards the reception. Vinny tries to reply Rayane sadly but a little not wanting to say the next words.",
    "type": "action"
  },

  {
    "set": {
      "playlistPlay": "think"
    },
    "value": "Well... We can't let Wagner know about Ivy now. In the worst case he... he won't know that she was with us.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then look at Rayane for a few seconds.",
    "type": "action"
  },

  {
    "value": "Wait... The Doctor said had few cases of miracle. Rare but there have been miracles. If it's Rainbow Queen... she's already played god. Hm! You just need to have the good reason with her.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then got a little curious trying to understand why Vinny was talking about the Rainbow Queen again. Rayane breathed deeply for a few seconds before replying sadly.",
    "type": "action"
  }, 

  {
    "value": "Yes. You got it right. Good reasons... And you can already imagine that she will want an extremely specific reason for that. You will need a lot of luck to find something that interests her.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "HMM! You know... I thought something, but I think it's dangerous, for everyone, especially for you. It's very sensitive to talk about it but I think you can really help Ivy. Just need to be careful. And James gave me a good idea! We just need a more private place.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was a little worried, but still trying to understand what was happening to Vinny.",
    "type": "action"
  }, 

  {
    "value": "Hm? A..about what? A...Alright.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was just getting ready to finish the conversation as he arrived at reception.",
    "type": "action"
  }, 

  {
    "value": "We'll talk around James or when there's no one around. Until then, what do you think can work? Someone give up their lives too. 1 life for another life, or body.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Ham? No! That's even more hard. I don't want to give reasons to take another pony's life. We can find a better alternative.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Then Rayane looks for a few seconds at the attendant who was busy.",
    "type": "action"
  }, 

  {
    "value": "Well, we can still go to a good place if we want to cheer up a little.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smiled a little, dedicating herself to feeling better during the conversation.",
    "type": "action"
  }, 

  {
    "value": "Heh! Alright! Let's go to the good place to see what caught my attention. How are we going to find our group again?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Hm~ Kai said he was going to get us a house. So don't worry. I know where they're going now.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
      "dayNightCycle": "evening"
  },
    "value": "Then Rayane left the hospital, Vinny just followed her during the conversation.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "fantasy-village"
    },
    "value": "Okay. We can get information about ghosts and any miracles here. Or try to participate in any sweepstakes or any stuff.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Siiiiilly... Silly you~ You really want to play with your luck talking about dice. Hmm... Ghost information? Well, normally it's in specific places in this village. It's a very discreet place.",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "Vinny smiles nervously for a few seconds before looking around, trying to find anyone was looking at him.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah! And... what's in this street fair?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks very curiously at the street fair as he started to approach the entrance.",
    "type": "action"
  }, 

  {
    "value": "Well...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny could only find equipment places, food places, clothing places and many other stuff. And in the middle of the street fair something caught Vinny attention. Someone very familiar buying something at a clothing shop that was catching the attention of some ponies around.",
    "type": "action"
  }, 

  {
    "value": "Hmmm... What?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny began to suspect this mysterious pony when he recognized the collar that was on her neck.",
    "type": "action"
  }, 

  {
    "value": "HMMM!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Oh? Vinny? Where are you going?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then slowly approached the place. Vinny see a pegasus with slightly white fur and different shades of pink mane. She had a long mane with a red bow on her head. When she bent down to pick a small bit off the ground, Vinny realized it is the same pegasus of the binoculars again. She was all happy to buy some new clothes and the sellers were very excited about the amount of money she wanted to spend.",
    "type": "action"
  }, 

  {
    "value": "AHA!! YES!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny went back to Rayane without arousing suspicion.",
    "type": "action"
  }, 

  {
    "value": "Rayane... it's her! The pegasus! The binoculars!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was a little surprised and very curious, trying to understand what was going on.",
    "type": "action"
  }, 

  {
    "value": "Ah? She who? Binoculars? Wait? Did you find Rain's pet again?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Yeah! It's her! I don't know, it looks like my ass has honey, it attracts all kinds of trouble. Want to do something or do we leave it aside for now?",
    "character": "Vinny",
    "type": "dialogue"
  }, 
  
  {
    "value": "Ooooh...",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane looks at the mysterious pegasus, and looked at her face curiously. Rayane then giggles a little before answering Vinny.",
    "type": "action"
  }, 

  {
    "value": "How silly you are~ You found Amy. She's just buying her silly clothes that she likes to collect. You'll end up getting everyone's attention if you do something wrong.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was surprised and anxious, trying to think about some strategy.",
    "type": "action"
  }, 

  {
    "value": "Wrong? No no no! Don't tell me \"Sherlokyane\"! AH! Do you want to leave her alone for now? At least we know where she always goes. But... wait! Do you know her?!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little more before answering Vinny in response.",
    "type": "action"
  }, 

  {
    "value": "I can't say for sure that she always comes here. But yes, she loves going to this street fair. You were lucky. Yes, I know them all. Rain already had these pets before I met her.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AH! Okay... Let's leave it for another time, we shouldn't talk too many details in public. Someone can hear this. Well what do you think? Don't you want to talk to her first? Some stuff like \"Hiiii! How are you? How long is it and your boyfriends?\"?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Silly~ You'll need to find some more private time with her if she doesn't run away from you again. But she also can't ask Rain to teleport her in public. You just have to be smarter than her.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was curious, trying to understand what was going on.",
    "type": "action"
  },

  {
    "value": "Well! She's wasting a lot of money. Somehow this can get the attention of pony with bad intentions. We can be lucky that someone wants to steal her. Imagine that! We save her. This might be a good way for her to trust us.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then get more thoughtful before making a poker face.",
    "type": "action"
  }, 

  {
    "value": "Or we'll end up waiting for her forever. Either way we can pretend to be a couple and watch the ponies around her to see if any of them want to steal she or will steal from her in public without her noticing.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmm... They've tried this several times. But Rain knows how to be discreet when helping her. Remember that Rain is protecting her, and all Amy needs to do is use her silly collar to make a wish for Rain~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "W..What?! If someone takes off the collar?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane laughed a little during the talk.",
    "type": "action"
  }, 

  {
    "value": "They've tried... the collar is extremely resistant. Not even Amy can take it off. The only one who can remove it is Rain herself~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does another poker face in response.",
    "type": "action"
  }, 

  {
    "value": "Fine... So let's forget about her?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Forget?~ Now that you've got the binoculars, this binoculars will also attract her towards you. It seems my dream ended up getting into a nightmare~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a mega poker face, trying to think of some new plan.",
    "type": "action"
  }, 

  {
    "value": "FUCK!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "You're not helping me. Are we going to keep an eye on her or not? I liked the idea of pretending to be a couple, I already have my life plan, just married. I want to have children, you don't, I like your parents and yours hate me.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles in reponse during the talk.",
    "type": "action"
  }, 

  {
    "value": "Couple is what everyone talks about us all the time~ So what will be the rest of your plan?",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "We stay close to her looking for nice clothes for my wife. Also, we don't know if you're pregnant or not. We found this region very beautiful and came to spend our honeymoon here.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmm?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Shhhh... This is like playing spy. Let's try to look for some information from her. We need tourist clothes, ponies that are not from here but in a very discreet way. What for? Ah... We stay close to her to see if we discover anything, when she leaves we try to talk to the owner of the tent if she always comes. and buy with them and bla bla... Or we can keep walking around.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks at Vinny while poking his nose in response.",
    "type": "action"
  }, 

  {
    "value": "Hmmmmmmmm... How cute are you~ Is this some kind of roleplay between you and me in the middle of this town?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks a little more before continuing talking.",
    "type": "action"
  }, 

  {
    "value": "It's ok~ But remember that she is already leaving the market stall as we talk about this.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny tried looking for Amy for a few seconds before returning to the conversation.",
    "type": "action"
  }, 

  {
    "value": "A..Ah? AH! We need to get dressed up! I need to take off that suspicious armor and wear something looser. Don't you have something?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Silly you. I only have my clothes. It seems that in the end, you're the one who needs to buy clothes.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then looked for one of the clothes stalls that had a place to change clothes",
    "type": "action"
  },
  
  {
    "value": "Follow me~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Meanwhile, Vinny noticed that Amy was keeping the items she bought in her magic saddle, she was very satisfied with the clothes she bought. She had bought maid costumes, socks, skirts of various types, and a few more variety clothes to make her look cute.",
    "type": "action"
  }, 

  {
    "value": "W..What? She actually looks a lot more harmless than I imagined.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "So are we going to see clothes for me and our future daughter maybe? I make up an excuse like we're on our honeymoon, and for fantasies I wore this armor and lost my clothes shall we? W..Well! Don't forget that you don't want children because your career plan a child will give you a lot of problems.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "I don't want to? What if I want?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? AH! Find me dressed in elegant or normal clothes. What makes you feel better.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh. Vinny really is being a lot sillier than I imagined today.",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Rayane would giggles a little and just follow Vinny. So Vinny would go to the clothing stall where Amy was.",
    "type": "action"
  }, 

  {
    "value": "So there she is! The pony that belongs to the crazy goddess of the scythe. I just need to be careful.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Amy finished putting away the rest of her cute clothes. So she started putting a lot of bits on the table while the salespony was very happy about what he saw.",
    "type": "action"
  }, 

  {
    "value": "Wow! But where does all that money come from?!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny keep looking at the clothes at a certain distance from Amy without suspicion. But Vinny only found the same kind of clothes that Amy had found, most of them were adult women's clothes, and you found other things like cute head accessories.",
    "type": "action"
  }, 

  {
    "value": "Thank you so much! You are too kind! These outfits will be perfect for my lovely hobby.",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy gives a very cute look at the salespony while her eyes was dilating in happiness. The seller gives a sincere look of happiness for the amount of money received before responding.",
    "type": "action"
  }, 

  {
    "value": "You're welcome good one. Remember that the next session will arrive soon. I'm really glad you're helping me to support my family. Hope you all are well.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Meanwhile there were other sellers interested in her spending money, and other ponies were curious about her collar that always reflected colorful colors when the sunlight hit it.",
    "type": "action"
  }, 

  {
    "value": "What? This pony is not greedy. What's going on here?",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny keep looking at the clothes, looking for some clothes and waiting for Rayane and a salespony to answer. But Vinny just found more clothes related to cute stuff and silly costumes.",
    "type": "action"
  }, 

  {
    "value": "Ah... Come on...",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Rayane is laughing when she watch the Vinny \"adventures\".",
    "type": "action"
  }, 

  {
    "value": "How silly~ It seems that our daughter is already quite grown up seeing these styles of clothes that seem to be more to adult pony.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Yeaaaah...",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny does a poker face, but then the salespony finished serving Amy, he was already looking curiously at Vinny and Rayane while smiling in response.",
    "type": "action"
  }, 

  {
    "value": "Oh? Hello! Can I help you two?",
    "character": "Salespony",
    "type": "dialogue"
  },

  {
    "value": "Amy was already going to another accessories stall, wanting to buy even more stuff while the other sellers tried to convince her to go to their stall shop.",
    "type": "action"
  }, 

  {
    "value": "Hihihi! Don't worry you sillies... I'll choose the best stall myself.",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy smiles a little more as she looked at the other stalls shop and chose which one she would go to.",
    "type": "action"
  }, 

  {
    "value": "N...No! No no no no... came back here!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Hello?",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "A..Ah? S..Sorry! Good morning my dear. I'm looking for some clothes that attract attention but not too blue and cute for my wife.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny looks at Rayane and laughed as he hugged her, turneing his attention to the salespony again.",
    "type": "action"
  }, 

  {
    "value": "It's a beautiful village we've never been here it's our first time.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Wait...what?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane blushes a little because of the hug being seen in public. Salespony was a little surprised to see the scene.",
    "type": "action"
  }, 

  {
    "value": "Wife? Is Rayane your wife? I never found out about the wedding. But how cute! It looks like you two are already having fun.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Salespony giggles a little during the talk.",
    "type": "action"
  }, 

  {
    "value": "A...ah? Who? Rayane?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Maybe we could start with a little bow. Be very welcome!",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny felt nervous when he realized that the salespony also knows who Rayane is.",
    "type": "action"
  }, 

  {
    "value": "Y..Yeah! Baby... I swear I don't know who this Rayane is. I don't know what it is I swear.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny turned to Rayane and made a sign for her to be angry or thinking that she was betrayed by another pony.",
    "type": "action"
  }, 

  {
    "value": "W..what?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Wasn't it part of the script for me to be myself?",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Rayane didn't know what to do when she saw that the improvised idea was getting out of control while she was still blushed when she looked at the bows.",
    "type": "action"
  }, 

  {
    "value": "I don't have much time to stay here.",
    "character": "Rayane",
    "type": "think"
  }, 

  {
    "value": "Why not? This face... these colors... She is just like Rayane... Are you playing some silly fantasy? I can see more clothes, although it will be difficult to find this kind of clothes for her, but nothing is impossible.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a poker face and responds.",
    "type": "action"
  }, 

  {
    "value": "I think you ended my marriage.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then does a nervous smile, preparing to say goodbye.",
    "type": "action"
  }, 

  {
    "value": "I don't think you have what we're looking for. Thank you attention.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Wait! But she looks like she's really embarrassed about something. I'm sorry if I got too straight to the \"dot\".",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Salespony was more confused and a little regretful. Meanwhile, whoever was passing by Rayane was trying to understand what was happening. Rayane tries to get her posture back when she saw that things were now getting calmer.",
    "type": "action"
  }, 

  {
    "value": "Hmmm... was this your plan? Buy me silly costumes?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny hangs his head shamefully.",
    "type": "action"
  }, 

  {
    "value": "I'm sorry... and thanks.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then looked at Rayane again.",
    "type": "action"
  }, 

  {
    "value": "It wasn't exactly that. Come on I'm embarrassed here.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then looked at Rayane again. Rayane then smirks and speaks in a low voice to Vinny.",
    "type": "action"
  }, 

  {
    "value": "Alright... That's not what I was planning too. But the little fool will have to be punished~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then levitated the little red bow.",
    "type": "action"
  }, 

  {
    "value": "I didn't mean to... Okay okay! I better stop talking.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little while putting the little red bow on Vinny head. Vinny would then hide his face for a few seconds not knowing what to say.",
    "type": "action"
  }, 

  {
    "value": "Better to laugh than not cry~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "The Salespony giggles for a few seconds before answering.",
    "type": "action"
  }, 

  {
    "value": "Will you take it?",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Yes. I'll pay~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane paid the salespony during the talk.",
    "type": "action"
  }, 

  {
    "value": "OH! Thank you very much! Anyway, cheer up... Embarrassments always happen.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Salespony smiles in response.",
    "type": "action"
  }, 

  {
    "value": "Heh~ Yes. Time for my christmas dream to feel better now~",
    "character": "Rayane",
    "type": "dialogue"
  },

  {
    "value": "When everyone realized that nothing interesting was going to happen, everyone returned to their normal routine.",
    "type": "action"
  }, 

  {
    "value": "Wow. It seems like everyone here knows you more than usual... Have you done something for this place? Ooh... The bow... will stay on me until you take it off.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a small laugh at the end, trying to get back to being positive.",
    "type": "action"
  }, 

  {
    "value": "Until I take it off? Are you going to tell me this can stay there forever?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks again. But Vinny could see that the whole mess had gotten Amy's attention too. Amy was laughing a little at the situation, but when she realized that Vinny had seen her, she was already trying to disappear into the crowd and go back to doing what she was doing.",
    "type": "action"
  },
  
  {
    "value": "N..NO! WAIT! Ah!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny does a facehoof.",
    "type": "action"
  },

  {
    "value": "Yeah. My foolproof spy 2.0 turbo plan failed. Anyway what do you want to do?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Shhhhhh~ This is okay. You made Ivy laugh a little from your sillyness. That's already progress for her to be a little less afraid of you than before.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Yes, but surely everyone is gossiping that the mysterious Rayane married with a pony with a bow must not be good for her reputation. I don't care about mine. Hihi. But as you're in the middle I worry what it takes you... Anyway, what do you want to do?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh~ I don't care about that. If I'm seen more neutrally than this is more than enough for me. If you want me to take you to our temporary home, I will, that might be a good excuse for you to try following Amy for a few more minutes before we change routes.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "A..Ah? What about Ivy? Let's say what to the ponies...? I think we should at least ask James for help then the 3 of us split up and looking for some way out where Ivy gets out alive.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane is a little surprised and more serious.",
    "type": "action"
  }, 

  {
    "value": "Yes. But first, I'd like you to tell me your mysterious plan about it.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane started walking during the talk, making Vinny follow her.",
    "type": "action"
  }, 

  {
    "value": "My plan? Yes, I don't think it's a bit safe to talk about here. Just trust me! Before I need to confirm something very serious.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was curious to hear Vinny words.",
    "type": "action"
  }, 

  {
    "value": "Huh? confirm what?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Just trust me. Anyway you'll find out sooner or later with James. If you don't trust me, trust the little bow you put on me.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny laughed a little during the conversation, but Rayane continued to behave a little more seriously.",
    "type": "action"
  }, 

  {
    "value": "What do you mean by that?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah... well...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was starting to feel a little discomfort being watched. So Vinny tried to look around, trying to understand what was going on.",
    "type": "action"
  }, 

  {
    "value": "Oh no... My ass full of honey again.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Well... It's complicated, James needs to confirm some things in this world.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Vinny then realized that Amy was following him, very discreetly. She looked like she was afraid of Vinny noticing she was there.",
    "type": "action"
  }, 

  {
    "value": "AH! More honey on my ass!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Confirm? So James has something else to tell us about our reality?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Reality? Y..Yeah! Yes yes!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny replies Rayane, saying on her ear very low.",
    "type": "action"
  },

  {
    "value": "Rayane... I didn't trust the hospital and this radio. I'm not going to reverse engineer it or anything like that. But there are things that you can see and feel that show that someone is listening to us all the time. Anyway, we're going to need to meet with James to talk about you and your powers... until then, we'll try not to bring it up for anyone to hear. Well... your \"niece\" is following us or was.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Then Vinny would go back to talking normally. Vinny does a poker face during the conversation.",
    "type": "action"
  }, 

  {
    "value": "And this little bow... do you have a special reason to put it on me? Like marking territory? I'm just yours for example, or did you just improvise after everyone noticed my little shit moment?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh. Don't be silly~ I know them very well. But wait... my powers? What kind of power?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane started to get a little confused during the conversation.",
    "type": "action"
  }, 

  {
    "value": "Hmmmm... The bow is just a silly punishment for my silly dream for putting me through a silly situation~ But in the end it did serve to distract everyone.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AH! But I can kiss James. This does you feel embarrassed don't you? Imagine if one day everything we do would end up in a story. Like the story of the ponies that saved everything and everyone! Would you be happy with everything you've done here so far? I'm happy and even more to have you by my side.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Silly you~ I was the one who made you kiss James. It was just a joke. Why would I be embarrassed?~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little in response.",
    "type": "action"
  }, 

  {
    "value": "And knowing that all this started because of a silly store on the Greendream Village.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny could see that Amy was trying to follow him again, she was kind of disappointed not to have heard something, but when she saw Vinny's face, she immediately got scared, and tried to change the walk direction. Vinny would then do another poker face during the talk.",
    "type": "action"
  }, 

  {
    "value": "Well, I can leave her binoculars here on the floor for her to come pick up, I can try to go to her with the binoculars on my hooves, or we can leave too with the chance that she follows us. But I find it difficult. What do you think? Should we forget and go home?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Hmm~ If you leave it on the floor in the middle of this crowd... she'll go crazy wanting to get it before another pony does. You'll end up letting her know where we're going to live temporarily too~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AH! Why me me me me? Meeeeee?? Okay. She's the one following us. Well you know, anyway I'm following you.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles and smirks in response.",
    "type": "action"
  }, 

  {
    "value": "Yes... you you and you and more you. You who picked up her binoculars from the floor~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane pokes Vinny nose in response while smirking at him.",
    "type": "action"
  }, 

  {
    "value": "You should be happy that at least she won't want to hurt you.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a super poker face.",
    "type": "action"
  }, 

  {
    "value": "You just said that if one thing stays on the ground another pony can take it... anyway you save me if Rain wants to punish me. I don't know... say we're waiting for a fake son so she won't kill me and the son grow up rebellious without a father? and atheist?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a pity face during the talk.",
    "type": "action"
  }, 

  {
    "value": "Heh~ So you already understand where I'm going. We'll have to give it back to her without having to put her life in danger. And she will know where we live because of that or you'll end up scaring her, making you end up going down a dead end.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "You're not really helping... I'm going to borrow money from James and buy a little sign and hang it on you that says 'Rayane helper pro'.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little in response.",
    "type": "action"
  }, 

  {
    "value": "That's if he doesn't laugh at you when he sees this giant bow that looks cute on your head~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AH! I explain that we are expecting a child and to disguise it you bought it for me. Heh.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks in response.",
    "type": "action"
  }, 

  {
    "value": "Silly~ Oh what are you going to say to James when he sees that Rain's pet is attracting us?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Ah...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny could see that him and Rayane were arriving in the residential area which was much quieter.",
    "type": "action"
  }, 

  {
    "value": "Well...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does another poker face when he sees that Amy was flying between the roofs of the houses, just spying on him and Rayane. But she was startled again to see Vinny watching her.",
    "type": "action"
  }, 

  {
    "value": "Yeah... Okay okay. James doesn't need to know that Amy is her. I say that Amy bumped onto me, got scared and ran away, and dropped the binoculars. But at some point I will need to talk about this. I don't like the idea of hiding things. Sometimes someone has the solution but for someone else to hide something everything ends up going wrong. Anyway, do you think it's better than waving at her with her binucolos?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Shhhh... She is very shy. If she is too far away from you... she will hardly want to go to you, especially if there are more ponies around.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane looks at the houses around, and the horn started to glow, Vinny noticed Rayane's mane swinging, indicating that she was using magic to try to know where James was.",
    "type": "action"
  }, 

  {
    "value": "Ah... yes. I hope he's not in a nightclub. Hihi!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then finished using the magic and was already looking exactly at the house where James is. Rayane giggles a little before replying Vinny.",
    "type": "action"
  }, 

  {
    "value": "Nightclub?~ I don't think James would do that... He has a possible lost girlfriend according to his behavior.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Yeah... But after our kiss you did. Will know if you didn't mess with the poor thing.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a facehoof. And Rayane laughed a little in response.",
    "type": "action"
  }, 

  {
    "value": "It won't be a silly kiss that will make him change his mind all of a sudden. Unlike someone who managed to change my mind in a few days~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane press Vinny's nose gently before walking towards the house James was staying at. Vinny then giggles innocently as he answered Rayane.",
    "type": "action"
  },

  {
    "value": "I have a \"gift\" for changing everyone. Heh! So our kiss didn't change anything about you? Good to know... Maybe next time I need a little more emotion.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny tries to boop Rayane, but Rayane nibbled him hoof in a silly way in response.",
    "type": "action"
  }, 

  {
    "value": "A..Ah?!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh~ Nope nope. Only I can boop you. Especially after this subject~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "AH! Okay... I will wait for you to be sleeping. Hihi! When you least expect it.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "That's if I don't wake up before you again~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny tried to hide his embarrassed face a bit while Rayane smirks in response. Then Vinny looks around looking for something unusual during the progress.",
    "type": "action"
  }, 

  {
    "value": "Okay... Are we close?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane giggles a little as she approached the house door.",
    "type": "action"
  }, 

  {
    "value": "Silly you. We're already on the side of the house~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny could only see Amy's two hidden eyes, very scared, looking at him. She was right on top of the roof terrace of the James's house.",
    "type": "action"
  }, 

  {
    "value": "Oh no.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Well! I guess I'll try to return the binoculars to our visitor. Come in and call James all right?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Heh. It's okay... good luck for you and your visitor~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then pressed the bell button. Meanwhile, Vinny could see that Amy had already left the roof, and she was on the ground, trying to get away without being noticed. She was starting to get close to the residential zone exit in response. Vinny does a poker face and then starts to get ready to try and do something.",
    "type": "action"
  }, 

  {
    "value": "Oh come on...",
    "character": "Vinny",
    "type": "think"
  },  
  
  {
    "value": "Vinny breathed deeply for a few seconds, thinking about what to say to Amy.",
    "type": "action"
  }, 
  
  {
    "set": {
      "playlistPlay": "bad-think"
    },
    "value": "Oooookay... Let's go.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny breathed deeply for a few seconds, thinking about what to say to Amy. Vinny then walked slowly towards Amy.",
    "type": "action"
  }, 
  
  {
    "value": "Hey... Amy? I need to return your binoculars. Please... wait a minute.",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Amy would then get a little scared hearing this and try to keep her distance from Vinny slowly during the process.",
    "type": "action"
  },

  {
    "value": "A..ah? N..No! No no! Please! Keep your distance! I... I don't want trouble with anyone! Leave me alone!",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy was extremely scared when she looked at the binoculars, trying to keep more distance from Vinny in response.",
    "type": "action"
  },


  {
    "value": "No no no... Please... I don't want to do you any harm on you.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then tried to remain calm and keep distance during the talk.",
    "type": "action"
  }, 

  {
    "value": "Alright, it's just between us. I'm sorry if I spoke out loud the first time with you.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Amy was a little curious, trying to hide her shy look.",
    "type": "action"
  }, 

  {
    "value": "Ah? This little thing is getting really weird. Between you and Rayane. H...How can I be sure I trust you?",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy looks around, trying to find some way to escape, starting to cry while trying to hide behind the shadow of one of the houses, but her collar reflected some sunlight, making her stop walking.",
    "type": "action"
  }, 

  {
    "value": "W...Well... I don't know what's going on. You don't have to trust me if you don't want to. You are free to trust or not. I just wanted to understand the reason for you called me a monster. Look here... Are you want the binoculars? Can I give you this?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Amy is a little more scared to hear the Vinny words. But she tries to tone down the crying during the conversation.",
    "type": "action"
  }, 

  {
    "value": "M...my master just asked me to keep my distance from you.  P... Please... just give the binoculars back... nothing more than that. And... I just want to go back to my safe place. That is all.",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny tried every way he could to appear less intimidating before answering as Vinny slowly tried to give Amy the binoculars back.",
    "type": "action"
  }, 

  {
    "value": "It's ok, calm down... It's ok, I'll get your binoculars. You saw how Rayane and I are, we are not monsters. We are trying to save a friend of ours. My friend is dying and we can't do anything.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny took a deep breath before answering.",
    "type": "action"
  }, 

  {
    "value": "Here. Do you want me to leave your binoculars here and go away? Or can I give it to you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Amy cries a little more again. But then Amy slowly tried to be braver and tried to get closer to Vinny.",
    "type": "action"
  }, 

  {
    "value": "I... I can pick this up from the floor.",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Okay. Look here. I will leave it on the floor.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny showed a feeling of sadness during the conversation, trying not to cry during the talk.",
    "type": "action"
  }, 

  {
    "value": "I'm sorry to make you... make you run out of your binoculars, I'm just desperate to save my friend who looks just like you, sweetie, very sweet. She had a hard life with no one around her. I was her first friend and I managed to save her from the accident she had. I'm sorry... I'll just leave it here. Okay?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would cry a little and put the binoculars down in response.",
    "type": "action"
  }, 

  {
    "value": "Please, I didn't do any harm and I never did anyone. I just really want my friend Ivy to be able to recover. I have nothing. Just our friendship where she believed she was saved by me. Sorry... I just wanted to vent to someone.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny walks away from the binoculars while looking into Amy's eyes, wiping him eyes.",
    "type": "action"
  }, 

  {
    "value": "I'm sorry to make you waste your time with my personal life. If you want to help me... I would be very, very grateful. I'm sorry, I couldn't have left your binoculars on the floor. I always thought about giving it back to you.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then walked towards Rayane's house in a slightly depressing way. Vinny simply walked into the house, leaving Amy alone again.",
    "type": "action"
  }, 

  {
    "value": "Amy looked with a hopeful look at the binoculars. Amy approached the binoculars in relief, but then she gave Vinny a regretful look, thinking about what she'd heard about Ivy.",
    "type": "action"
  }, 

  {
    "value": "F... friend? L... like me? I... Is her name Ivy? What?",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy was very curious and very surprised, trying to understand what was really happening at that moment. So Amy approached the house very timidly.",
    "type": "action"
  }, 

  {
    "value": "B...But why are you asking me for help? I can't do anything... And... I don't have anything special for you. I just live my silly little life where I'm always at peace... nothing else... And... me...I...",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Amy then just hugged the binoculars as she looked at Vinny, waiting for some response. When Vinny heard Amy's words. Vinny finally looked back at Amy.",
    "type": "action"
  }, 

  {
    "value": "If you want to visit her just go to the hospital and look for a pegasus Ivy. Well... Amy... Thanks for listening to me.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then just finished walking back into the house and got ready to close the door. Amy is quiet and very thoughtful. She just keep looking at the window of the house, looking at Vinny, hiding her face shyly behind her wings.",
    "type": "action"
  }, 

  {
    "value": "It's been over 100 years since I've visited the hospital. If I have the courage, maybe I will...",
    "character": "Amy",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then be a little surprised to see Amy's face in the window, so he stop closing the door for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "It's ok. Thanks for your attention Amy.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny smiles at Amy, crying a little and then go back inside the house. Vinny just see the Amy's innocent look was looking at him, but after a few seconds Vinny see Amy using the collar for something, then Amy disappeared again in the same teleport which resulted in a colorful glow around her.",
    "type": "action"
  }, 

  {
    "value": "W...Wow. Amy said... 100 years? Why did she care about Ivy like this? I think she's the second pony I've seen using teleportation. Well... At least I hope she says something nice about me to the scythe goddess.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny showing a feeling of surprise then just looked back into the house. The house was empty, but Vinny could hear the sound of conversation coming from the other rooms in the house.",
    "type": "action"
  }, 

  {
    "value": "Yeah... Looks like this is the place. My new temporary home. Finally a place for me to say it's my home again.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny wiped him face and returned to thew normal mood. Vinny was very thoughtful and looked towards the doors he heard the sound of conversation, until he made the decision to try enter some door.",
    "type": "action"
  },

  {
    "value": "What?",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny heard that everyone in the kitchen was talking about food, but in the room of one of the bedrooms, Vinny heard a little Rayane's voice talking to herself while she looked at the bedroom window.",
    "type": "action"
  },

  {
    "value": "Rayane!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny secretly tries to pay attention to what Rayane was saying. Rayane seemed to be surprised by what she saw.",
    "type": "action"
  }, 

  {
    "value": "How strange... Vinny and Amy talking like this? What is he planning this time?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was standing still doing as little noise as possible during the talk.",
    "type": "action"
  }, 

  {
    "value": "Did Vinny change something about his mysterious plan? Maybe I should ask him that later. Amy was trusting him a lot.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Rayane then left the window and closed the curtain. So Rayane kept making the bed where she would sleep in the future. Rayane then took a deep breath, a little worried.",
    "type": "action"
  }, 

  {
    "value": "If this involves Rain, I hope Vinny is being careful. But... wait... What's this sound? Hmmmm~",
    "character": "Rayane",
    "type": "think"
  },

  {
    "value": "as Vinny watched, suddenly Vinny felt Rayane's magic aura around him, pulling him towards her.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "bad-mystery"
    },
    "value": "Oops~ I think I found a silly dream~",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would be a little surprised and then look at Rayane in response.",
    "type": "action"
  },

  {
    "value": "A...AH! Where is James? Didn't you call him? Did you know that you look beautiful on your back? Your ass is so... cute. Hihi!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane smirks and boops Vinny in response.",
    "type": "action"
  }, 

  {
    "value": "Hmmmm~ The sound of your footsteps and your red bow doesn't fool me. James is trying to find somewhere to set up his portable lab. He must be in one of the rooms going around in circles without having any conclusions.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Aaaah... Okay. Well! Hihi. Any questions? I'm going to talk to James and soon after we put the plan B or A I already did with Amy. I talked to her. I appealed emotionally, cried, told her about Ivy. I left her very emotional and sad. And told Amy to go see Ivy to see that I'm not lying.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then scratched his head, feeling a little confused.",
    "type": "action"
  }, 

  {
    "value": "But... Strangely she said that she hasn't been to the hospital for about 100 years. W..What's going here?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Heh. Yes~ But wait... plan A with Amy? I was going to ask what you were talking with Amy now. But...",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane was trying to hide her feelings of surprise a little when she heard that Vinny had more than one plan, so she continued the conversation.",
    "type": "action"
  }, 

  {
    "value": "Yes... Rain doesn't want her pets to age. Rain always freezes the age of all her pets as long as all ponies are her pets. This is no surprise to me, but I didn't know that Amy's age It was over 100 years old.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "A...Age freeze? Again?!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Okay okay... Yeah. At best Amy comes back to us and gives us a solution or a tip, and at worst nothing happens. Anyway she already knows everything that happened with Ivy. Do you have any questions?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then felt a good opportunity hearing this question from Vinny, so Rayane decides to say what she was ready to say.",
    "type": "action"
  }, 

  {
    "value": "Did you do all this to try to send this message to Rain?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a nervous expression, but then tries to remain calm.",
    "type": "action"
  }, 

  {
    "value": "A..Ah! Y..Yeah. Yeah... yes and no. if I wanted to pass this message on to Rain, it would be from me, a supposed pony monster, now if Amy asks something, if she wants to do something, Rain will ask and... going until she gets to us. Anyway this is plan A, get help from Amy or Rain. The plan B is the one I'm going to talk to James now, but I need you to keep the radio here.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny places the hospital communicator on Rayane's hooves in response.",
    "type": "action"
  }, 

  {
    "value": "Here! If someone talks about Ivy, you can call me running. Just trust I'll go there with James... Any questions? Anyway, the bedroom is wonderful in.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane seemed to be behaving a little differently. She was a little more worried than usual instead of playing some silly words on Vinny.",
    "type": "action"
  }, 

  {
    "value": "What... what are you guys going to talk about? I'm getting worried about you. But... yes. It's been a long time since I slept in a room. I've always been a nomad.",
    "character": "Rayane",
    "type": "dialogue"
  },  

  {
    "value": "Ah? Whoa, whoa! So... tell me more! Are you a nomad? As well?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane took a deep breath before continuing the conversation.",
    "type": "action"
  }, 

  {
    "value": "Yes... My job never allowed me to have a home. That's the motive I have so much survival technology. It's the way I have at least a \"portable home\".",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little surprised, but at the same time even more curious.",
    "type": "action"
  }, 

  {
    "value": "W...Well... the good side is that you learned to survive. If everything goes right in the end... you will have your house, your little room. you will have everything you want. We just need to wait for time... wait for time, what a funny way of saying that everything has its time.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane then does a very weak giggles, giggling a little at the last words that Vinny said at the end.",
    "type": "action"
  }, 

  {
    "value": "Remember that you will also have a little room. But please be careful with your decisions of your plans. Remember that Rain is full of tricks when it comes to agreements. Alright?",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then felt a little nervous, smiling nervously, but tried to stay determined during the talk.",
    "type": "action"
  }, 

  {
    "value": "I'm good at chatting. Heh! Well, if the radio plays with the doctor saying something you can call me.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Rayane showed a little more concern in response.",
    "type": "action"
  }, 

  {
    "value": "Yes. It's ok.. But don't forget about it... Rain doesn't have any ability to create souls. So sorry to warn you again.. But be very careful... you and we all have something very special that always catches her attention.",
    "character": "Rayane",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny is a little surprised and worried, but he tries to hide it for a few seconds.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Y..Yes! Yes, just trust us. We won't do anything critical without telling you, in fact we won't leave you out of a mess.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny just started to walk towards James nervously in response.",
    "type": "action"
  }, 

  {
    "value": "Oh come on!",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "As Vinny walked, he heard sounds coming from the terrace of the house.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "think"
    },
    "value": "What? Don't tell me he took captain banana to the terrace of the house!",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny then found a staircase, him looked at the stairs and walked towards the terrace of the house.",
    "type": "action"
  }, 

  {
    "value": "HEEY! JAMES!",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "Then Vinny see that James had chosen to set up his portable laboratory right there. The entire part of the terrace was being used for James' portable lab.",
    "type": "action"
  }, 

  {
    "value": "Ah? James? It's not discreet here. Do you know right? JAMES!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James then left the laboratory tent, and looked surprised at Vinny in response",
    "type": "action"
  }, 

  {
    "value": "V..Vinny?! VINNY! OH FUCK GOD! I looked for you everywhere!!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was surprised by James' reaction, so he looked at him and said.",
    "type": "action"
  }, 

  {
    "value": "O..okay okay. Sorry! I'm here! B..But... Did Rayane talk to you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes! You went to help Ivy... but you were literally outside the house all morning!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Didn't she tell you about Ivy's health?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James then took a deep breath before answering.",
    "type": "action"
  },

  {
    "value": "Yes. But she said you were only in there for a few minutes or hours. What did you do after you left? All this confusion made me crazy because you and Rayane did all this without telling me nothing!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny felt a little surprised again, and tried to remain calm so James would speak more quietly.",
    "type": "action"
  },

  {
    "value": "James... Calm down. I'm sorry to leave you out, but it was last minutes for me. And... Yeah. A lot has happened and I want to talk to you and ask you a few things, maybe you are interested in knowing a little more about my world and if they are similar. We have a small time to save Ivy.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James looked a little surprised and curious to have heard all of this.",
    "type": "action"
  },

  {
    "value": "Okay...? But... your world? Your world and my world? I'm very confused.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Yeah. It's a long conversation, first are you busy? Want some help?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? No no... Not at the moment. I was just setting up my lab to get back to work on my inventions later. I still want to have a lunch time.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then felt more comfortable continuing the conversation and started to be more serious.",
    "type": "action"
  }, 

  {
    "value": "Ok. First I will explain the motive about... I run away with Rayane and Ivy. Well, you already know her health status is not well, this is critical. We ran desperate to the hospital. Me flying and Rayane doing her parkour running. Rayane had noticed that Ivy was not doing well. That's motive I didn't have time to warn you. Arriving there the doctor gave me a radio. Do you know how the radios of this world work?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was worried about Ivy, not knowing much what to say, but then James was curious to hear it over the hospital communicator.",
    "type": "action"
  }, 

  {
    "value": "It's just radios... if you don't turn them on it's ok. And well... Yes, they are very easy signals to trace. But I can't hear the signals because they are always encrypted. Why are you worried about that? They only work when you press the button to use them, otherwise I would have accidentally tracked you.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Ah? Don't you think it's strange that technology in this world is banned but not for hospitals? Is there radiation in this world? Something like electromagnetic waves? Or particles that propagate at a velocity containing energy? Like the wind you can't see it but it has.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Yes Vinny. You're right about the technology of this world. But from everything I researched about hospitals I didn't find anything suspicious. But I also didn't find any explanation about this. But yes, I'm not the only one.. Many clan ponies when they want to access this technology, usually they try to steal it from hospitals. But make no mistake! The hospitals know this.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "O...Okaaaay. Then... I left the radio with Rayane, I really feel that for the hospital to be able to use technology, it's bullshit. There can always be someone listening to us. That's motive I left the radio with Rayane and if you say that there is radiation in this world, you can do a test without modifying the radio, you won't even need to touch it to see if I'm right.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was a little curious to notice Vinny trying to talk about radiation.",
    "type": "action"
  }, 

  {
    "value": "Radiation? Waves? If that's what I'm thinking, maybe we're thinking the same. But why do you want to know all this so much? You'll end up coming to the same conclusion I did. Elite Color again. That's the only theory I have too, but I've never found any relationship between the two ones. I've never seen anything related to it.",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "Yeah... But... If a radio communicates with another then there are these waves. However there is a way to cause interference in these devices. When they are being used they send a signal, a wave, anything to another place. If I take my cell phone, turn it on, make it emit a random signal and approach it close to the radio, and this makes interference noises... I'll be right. The radio is broadcasting all around at the moment. This will take time anyway, we need to go somewhere far away and safe. We need to train with Rayane to control her powers. Maybe her healing power can help Ivy, if she can control her power... we need to discuss it with her, but without the radio. Or after seeing if it's safe with the radio.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James took a deep breath before answering Vinny during the conversation.",
    "type": "action"
  },

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Vinny... I already did this experiment. Why do you want to do it again?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little embarrassed, but still James tried to continue the conversation in a natural way, because James was still curious about some things.",
    "type": "action"
  }, 

  {
    "set": {
      "playlistPlay": "sad"
    },
    "value": "Hmm... Did Rayane control her healing powers? Okay... but upgrading a skill takes time to hone it on a large scale to the level you're looking for. Are you sure this is a good idea?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Okay. Sorry! But... If we don't make it Ivy's going to die anyway, if we try and it works it will be the only thing. Do you have another opinion on how to save Ivy? My plan A, B and now C. My plan C would be to try to see the town ghosts. If Rainbow Queen guides dead ponies after life, and ghosts are ghosts that don't accept death, maybe you can find a game of interest, where I solve this ghost problem, everyone in town is happy and Rainbow is less pissed off at me and help Ivy.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James looked a little surprised and worried to hear all of this.",
    "type": "action"
  },

  {
    "value": "How are we going to perfect Rayane in such a short time? Ivy's only salvation would be some magic that could recompose her body somehow. But Ghosts? Your idea is interesting but at the same time dangerous. These ghosts have a special reason to be ghosts. Don't think that they will simply want to help you. You will create even more problems for us to solve.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Ah! James! Come on! I can handle myself, if you want to help that's fine. But I manage alone. You're not thinking how hard it was to save Ivy, get her out of a pile of rocks, carry her. What do you feel? We went to get the relic and it went wrong. Hiroshi tried to stop Marlon and partially succeeded but he died, we manage to save a pegasus but in the end she dies. Is everything we did wrong? 1 out of 200 things go right. This is a consolation! Have you ever thought that everything we did was to get in the way? I really don't want to lose Ivy! I gave 2 alternatives, try to help Rayane control her emotional, try to do something with the ghosts... James! HELP ME!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then lower his head sadly, trying to hold back his emotions. James was a little scared and worried when he saw the scene.",
    "type": "action"
  }, 

  {
    "value": "P..Please... help me James.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "W...Well... Vinny, I understand your side. But everything you've said are... We'll need more time to get something in return. Rayane will need to train her magic... The ghosts will create problems for us solve. We want to save a life and we don't know how much time is left.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was then thoughtful for a few seconds as he looked at Vinny's depressed face.",
    "type": "action"
  }, 

  {
    "value": "I was trying to build some machine to help her, but even that I can't think of and I'm not even sure I'd have enough time to build it. We're literally playing against the luck. Are you sure those are the only two alternatives? You couldn't think of anything else?",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "Well, there's the Rainbow Queen. You appeal to emotional. It's just between us, me, you and Rayane.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was then thoughtful for a few seconds as he looked at Vinny's depressed face.",
    "type": "action"
  }, 

  {
    "value": "R..Rainbow Queen?! Wait... Now I understand... This name is very familiar. I had heard about her... but I never met her until after the cave day.",
    "character": "James",
    "type": "dialogue"
  },
  
  {
    "value": "Yeah. Yes... but there are other ponies closer to Rainbow Queen, as if it were family, common ponies. but they live different. Earlier today I talked to one who was afraid of me, I cried, I made a little scene for her to try something too.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was then a bit scared and surprised at the same time.",
    "type": "action"
  }, 

  {
    "value": "Wait... Family? What are you talking about? Are we talking about distant family members? What was your grandiose plan to try to convince her? What will you give her in return?",
    "character": "James",
    "type": "dialogue"
  },

  {
    "value": "Ah... Well! Okay! Compare these ghosts that are ghosts are dangerous and full of problems... now involve a reaper poney goddess whose already got angry several times, and stole the relic... the relic on the radar doesn't have that power?? If the relic we lost had the power to help the region. What power of the one you put on the radar?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James took a deep breath before answering.",
    "type": "action"
  }, 

  {
    "value": "Fine... Calm down. But it's not that simple just to have a relic. We also need to know how to manipulate it correctly or it will go completely out of control just like the moment Rayane literally teleported all of us to completely random places. You don't want to take the risk of overloading Rayane's or Ivy's body and ending up killing one of them by accident.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny didn't know what to say for a few seconds, feeling a little regretful, he started to answer.",
    "type": "action"
  }, 

  {
    "value": "Got it! I already gave 4 ideas. About Rainbow Queen... These ponies are almost a family. I think as if they were daughters. I didn't even understand. But most likely she can't die so living all this time alone is just so... just... so Rainbow Queen must have some ponies that she considers family or daughters and sons.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James tried to understand what Vinny was talking about, James seemed to be still confused on the subject.",
    "type": "action"
  }, 

  {
    "value": "Daughters? Are you telling me Rainbow Queen adopts ponies? That's how curious, but it makes a little sense. I've never tried to live eternal life because it's one of the most painful things there is.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James tried to think of something else before continuing the conversation. So James was back to feeling worried, thinking about the possibilities if something went wrong.",
    "type": "action"
  }, 

  {
    "value": "R...Rainbow Queen family?! That doesn't seem like a good idea. Why is Vinny trying to intrude on an unknown family? And what family is this?!",
    "character": "James",
    "type": "think"
  }, 

  {
    "value": "Maybe we have a small expectation of success. Buuuuuut! Y...Yes... we still have the main problem, pleasing a goddess. You said yourself that Rainbow Queen doesn't like you and she'll want to rip my head off at the first opportunity with you.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was shaking a little by the fear as he continued talking.",
    "type": "action"
  }, 

  {
    "value": "I...I never thought I'd say this... but for now it's just the craziest idea of all. Don't do nonsense!!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was a little surprised and happy to hear that.",
    "type": "action"
  }, 

  {
    "value": "Ah? Tell me what idea?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "We're going to have to follow two ideas... ghosts and the Rainbow Queen. Maybe this is a good time for me to read those tablets you gave me. Let's at least use what we have to avoid the chances of accidentally dying.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "But... What plan? What do you expect to find on the tablets?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "If Hiroshi said so much about Rainbow Queen... maybe I'll find something about her on these tablets... But in the meantime... we'll need to wait the night arrives. If you really want to look for these ghosts... we need finding the right ghost.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmm... Fine! I'll be wandering around the village, call Rayane, last time she got a password from a computer where those tablets were. Do your magic with them and if they ask for a password, try to remember Rayane. Heh heh! I'll wander around trying to find something abnormal or go out asking where there are female and single ghosts.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James did a facehoof as he listened to Vinny's last words, but at least James felt less worried as he understood the possibility of Vinny being too silly. James looks at the red bow on Vinny's head, trying to understand what was going on.",
    "type": "action"
  }, 

  {
    "value": "Okay. No problem... I guess with that giant red bow on your head you won't get very far. I was holding back until now to ask you where the hell you got that from.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "R..Red bow? AH! A long story... but summing it all up. This bow was Rayane who bought it for me after we accidentally got married and I wanted to have kids and she didn't. But then she changed her mind and wanted to have children. We went to a clothing store to see clothes for our future baby girl and Rayane accidentally got it all wrong and we were teased. And in the end I got this in my head! I need something to cover like a cape or something. My cape was... ah fuck.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a facehoof in response. James not too surprised by Rayane's silliness, just does a poker face and continued the conversation.",
    "type": "action"
  }, 

  {
    "value": "Yes... yes. You'll surely find places very easy to buy a new cape here.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then make a nervous smile before continuing talking.",
    "type": "action"
  },

  {
    "value": "Good! Never mind, I'm broke and out of money... you have to give me a little money, don't you?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "W...What?! Money? Well... I can lend you money to buy a cape. But please... remember that you will have to find some way to make money. I usually sell some of my creations. Do not forget my words. Here it is.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James delivered 100 bits to Vinny during the talk. Vinny does a poker face while taking the bits.",
    "type": "action"
  },

  {
    "value": "C...Calm down. Sorry. I'll do something for you. I will give you the greatest honor. I appreciate the 100 bits, but I can survive. Alright?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "And your cape????",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny took a deep breath before answering James.",
    "type": "action"
  }, 

  {
    "value": "Yeah... I'll just be suspicious... here take it here.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny removed the bow and put it on James head and denied the bits.",
    "type": "action"
  }, 

  {
    "value": "Wh... what?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "This bow is our proof of friendship! Should never be left out of use. I entrusted it to you, if you take it away I will feel it and I will be sad.",
    "character": "Vinny",
    "type": "dialogue"
  },
  
  {
    "value": "Wh...hat stupidity is that?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was completely embarrassed trying to understand what was going on. Vinny giggles a bit before continuing the answer.",
    "type": "action"
  }, 

  {
    "value": "Anyway. If you're going out, cover it or pass it to another pony. Well! Remember that I talked about Rayane maybe knowing the password if you have locked the tablets. And be careful in.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny then prepared to leave the place.",
    "type": "action"
  }, 

  {
    "value": "T...this... This is so embarrassing! This is... is.... for.... ARGH! F..Fine. Rayane must have told you what this little red bow is about!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "James then prepared to close the lab door.",
    "type": "action"
  }, 

  {
    "value": "Huh?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny stops and go back to James, interrupting James' attempt to close the door.",
    "type": "action"
  }, 

  {
    "value": "Is this a red bow for pets?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": "bad-mystery"
    },
    "value": "James then got a little scared listening to Vinny's words.",
    "type": "action"
  },

  {
    "value": "WHAT?! VINNY! What are you and Rayane up to?! That's not funny!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Oh come on James! Tell me what pets are... seriously, they're just here.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "W...What? Here?",
    "character": "James",
    "type": "think"
  }, 

  {
    "value": "James was embarrassed, and at the same time very worried, trying to think of some way to respond to Vinny.",
    "type": "action"
  },

  {
    "value": "I'm surprised that someone like you of your mentality doesn't know what this is... N.. no no! Vinny! Please! Stop being an asshole with my face!!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James... You forgot that I was in this world a little while ago. This pet thing is new to me. Maybe this helps me understand about the pony.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James was very surprised by Vinny words.",
    "type": "action"
  }, 

  {
    "value": "A..ah? Pony? What pony? What fuck is this?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a poker face in response.",
    "type": "action"
  }, 

  {
    "value": "Your ass... My god! The scythe pony! I mentioned a little while ago was buying clothes in the same store as this red bow. James?? What's your problem?! Pets are ponies like... are slaves? This?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "R...Rainbow Queen pony? N...No no no! REALLY?! T... The goddess? Are you serious?!?!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James was extremely surprised, totally at a loss for words to say to Vinny for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "R...REAAAALLY?! I....I..... OH CRAP!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a facehoof, waiting for James to finish calming down during the conversation.",
    "type": "action"
  }, 

  {
    "value": "Okay... okay... I will try to speak as best as possible. This depends on who the pony is responsible for... This is something unusual but yes, it exists. Some do it for a good cause... Others might do it in a negative way... You'll only find out if you see it.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James then took a deep breath during the conversation.",
    "type": "action"
  }, 

  {
    "value": "Well... I won't go into too much detail.... But I'll summarize the basics. If the pony was shopping for clothes and had a good freedom... I don't see cause for concern. But understand... For a pony to be a pony's pet, the pet needs to be very dependent on the master. You will always see the pet with some fragile personality in something. The logic is simple... If they feel more independent, they are more likely to give up being pets. So be very careful what you're getting into.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James looked very seriously at Vinny during the conversation.",
    "type": "action"
  },  

  {
    "value": "Very very very careful! This is serious stuff that can completely change your lifestyle for better or worse. And then to change a ex pet mindset back to normal is a complete nightmare. The warning is already given!",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looked at James, a little surprised, trying to understand the motive for James was so serious.",
    "type": "action"
  },

  {
    "value": "Well... anyway, we'll find a way. Just promise me that if you're going to come up with a crazy idea on your own, I won't stop you, but let me know before. Anything, even if you're going to give your ass or shoot me... well. I trust you on the little red bow. Anything you can call Rayane. Alright?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James does a facehoof, trying to calm down from the situation.",
    "type": "action"
  }, 

  {
    "value": "Oh my fuck god... Okay! Fine... Where did you get that red bow idea?",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "Hmmmmm... long story. Let's say it's an energy you don't know yet. Now you're giving the red bow a energy. Later you will see... do you have any other questions?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Fineee...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "My god... what is this story becoming now?",
    "character": "James",
    "type": "think"
  }, 

  {
    "value": "At least eat something in the village... I'm already late for my lunch... good luck.",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "James would just walk back into the lab and close the door without a second thought, trying to be less worried after all the conversation that had taken place.",
    "type": "action"
  }, 

  {
    "value": "WHY VINNY?! I'm not getting my night's sleep now!",
    "character": "James",
    "type": "think"
  }, 

  {
    "value": "James closed his eyes, trying to think of positive things as he continued to worry.",
    "type": "action"
  },

  {
    "set": {
      "playlistPlay": null
    },
    "value": "... is there lunch here?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Markets... restaurants... are everywhere...",
    "character": "James",
    "type": "dialogue"
  }, 

  {
    "value": "No! Here here... with us here. in this place space time.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "James didn't say anything else in response.",
    "type": "action"
  }, 

  {
    "value": "James? JAAAAMES!! AAAH! But it's a tabacu head!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Fuck! And there we go! Look for something to eat!",
    "character": "Vinny",
    "type": "think"
  },

  {
    "set": {
      "playlistPlay": "fantasy-village"
    },
    "value": "Vinny would then return to the village center, and there was all the same movement. But now the movement was much lower because Amy was no longer there.",
    "type": "action"
  },
  
  {
    "value": "Yeah. Looks like things are back to normal here.",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny went to the same seller from the previous moment. The seller was packing things up for lunch time while he finished organizing all the bits he had obtained. He was very happy with the sales results.",
    "type": "action"
  }, 

  {
    "value": "Hey? Hello again, do you have a little time to chat or are you busy?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The salesman looked curiously at Vinny, confused about his return.",
    "type": "action"
  },

  {
    "value": "Hum? You again? Welcome! But sorry... I will have lunch soon. Are you looking for something in particular?",
    "character": "Salespony",
    "type": "dialogue"
  },  

  {
    "value": "P...Particular? No no... I just wanted to apologize for the confusion earlier it was a joke between Rayane and me and she ended up winning... But that's not the motive, I'm curious because Rayane is known here. In other places it is not so. Could you explain me? Of course if you have time I don't want to disturb your lunch time.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Seller laughs a little in response. But then he looked back at Vinny.",
    "type": "action"
  }, 

  {
    "value": "It was the first time I saw her accompanied with someone like you. Sorry, I don't know much. But from what I know, it seems that she is some bounty hunter. Maybe some spy... but everyone is afraid of being alone with her. That's reason we are not so scared to see her around in crowds, but we always keep an eye out if she's not keeping her eye on someone.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny does a poker face for a few but then laughs a bit for a few seconds.",
    "type": "action"
  }, 

  {
    "value": "Yeah. I attract a little trouble... at first she kept an eye on me and threatened me and all. But now she has even saved me, she gave her life to save me. In some recent events I helped her. Is she very famous? Everyone is surprised and calls her by name! She seems to be good at something to get so much attention right? What is your opinion? Like what do you think instead of listening to what they say?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "The seller was a little surprised to hear Vinny's words.",
    "type": "action"
  }, 

  {
    "value": "Rayane saving you? T... this is all very new to me. I've never heard anyone tell this kind of story. Yes... She knows Pony Driland all over. She always seems to have some privileged contact with some important pony.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Ah... yeah, her buying a red bow and putting it on me didn't surprise you too? The red bow is still in good hooves. Hihi! I left a friend of mine using it.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny giggles a little more but then got serious again.",
    "type": "action"
  }, 

  {
    "value": "Well... I don't want to disturb you and your lunch time, my last question is if some of the rumors I've seen about some ghosts are true and if it interferes with your sales on something.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "The salespony would then get curious and laugh a little in response.",
    "type": "action"
  }, 

  {
    "value": "Don't be shy, everyone has some secret. But yes. We have ghosts... But they usually appear at night. I only saw a single ghost during the day, but it seemed that this ghost never showed itself. This is very curious. I never knew the ghost identity.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was surprised and a little curious during the talk.",
    "type": "action"
  }, 

  {
    "value": "W...Whaaat?? Where can I find someone who can answer me about it?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Maybe some spiritist can answer you about this. But why all this question?",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny would then be much more surprised than usual during the conversation.",
    "type": "action"
  }, 

  {
    "value": "AH! Yeah yeah. I'm in a very delicate situation. A friend of mine is dying and I think I can find help in this way. It's like one hoof washes the other. But... really?? Spiritist!? Is there a spirit here?? Where do I find them? Do you know where I can find it?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "The Salespony was a little confused and curious to hear this.",
    "type": "action"
  }, 
 
  {
    "value": "A..friend? And you want to look for help from spirits? This is dangerous. Be careful with it. Well... There is an alley in this village that hides a small part of the village. You can enjoy lunch time and find some gypsy who is returning there.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "G...Gypsy?! Oh! come on!",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Okay. I see... what's your name by the way? My name is Vinny. nice to meet you",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "You are welcome Vinny! My name is Nico.",
    "character": "Salespony",
    "type": "dialogue"
  }, 

  {
    "value": "Heh! Nice to meet you. Thank you so much Nico, see you later!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny smiles a little during the end of the talk.",
    "type": "action"
  }, 

  {
    "value": "Bye!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "You're welcome again! Bye! Good luck!",
    "character": "Nico",
    "type": "dialogue"
  }, 

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Nico giggles a little and smiled back as he waved. Vinny would then smile back and wave before starting to walk away.",
    "type": "action"
  }, 

  {
    "value": "Thanks.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Okay. And here we go.",
    "character": "Vinny",
    "type": "think"
  },

  {
    "set": {
      "playlistPlay": "dark-ambient-melodies"
    },
    "value": "Vinny spent a long time looking for something. Time passed, but Vinny found in the middle of the way a weird path with different houses, and Vinny saw that all the ponies avoided entering that place.",
    "type": "action"
  }, 

  {
    "value": "W..What? Ah? Hey! Excuse me, if possible can you tell me what is the gypsy place?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was trying to interrupt the first random pony he saw.",
    "type": "action"
  },

  {
    "value": "O..Oh?! What fuck are you doing!? Are you sure you're going in there? Those crazy spirits will fill your head with paranoia! Don't go there!",
    "character": "Pony",
    "type": "dialogue"
  }, 

  {
    "value": "The pony was scared, and already got away from Vinny, trying to keep away from the place. Vinny does a poker face in response.",
    "type": "action"
  }, 

  {
    "value": "Ooh. Thanks. I guess...",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny smiles nervously and entered the alley looking for something but paying attention to anything suspicious.",
    "type": "action"
  }, 

  {
    "value": "Why all this unnecessary panic?",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny could see that the place was poorly lit. Potion smell could be smelled, making Vinny start to find the place strange. And there were some unicorns around doing random conversations and some seemed to be saying silly things about him.",
    "type": "action"
  }, 

  {
    "value": "Cool, am I the only pegasus here? Let's just keep it natural.",
    "character": "Vinny",
    "type": "think"
  }, 

  {
    "value": "Vinny looks around, looking for a store that attracted more attention than usual. Vinny could only find potion shops, and other diversities of magic items. Some stores specifically target unicorns. And a gypsy hut.",
    "type": "action"
  }, 

  {
    "value": "AHA! GYPSY HUT! How funny, it's the same in medieval fantasy stories.",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny analyzed the cabin and who was outside and inside very slowly.",
    "type": "action"
  }, 

  {
    "value": "Hello?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "value": "The place was very quiet. Vinny just saw several items of spiritism around him. The shelves were very well organized. And right in the center of the room Vinny could see a table that was nicely decorated with a cloth and a crystal ball in the middle.",
    "type": "action"
  },

  {
    "value": "Oh? It really... it really is like medieval fantasies.",
    "character": "Vinny",
    "type": "think"
  },

  {
    "set": {
      "playlistPlay": null
    },
    "value": "Everything was still very quiet, too quiet, and Vinny just saw the crystal ball starting to gently shine him presence.",
    "type": "action"
  },

  {
    "value": "I'm not going to die here. Right?",
    "character": "Vinny",
    "type": "think"
  },

  {
    "value": "Vinny approach the ball very slowly in response.",
    "type": "action"
  },

  {
    "value": "H...Hello?",
    "character": "Vinny",
    "type": "dialogue"
  },

  {
    "set": {
      "playlistPlay": "cryptozoologist"
    },
    "value": "When Vinny got very close, a female gypsy came out from under the table and pointed her hoof at Vinny.",
    "type": "action"
  }, 

  {
    "value": "YOU!",
    "character": "Gypsy",
    "type": "dialogue"
  },

  {
    "value": "W...WAH?! IT WAS NOT ME!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny was startled, and looked back at the gypsy.",
    "type": "action"
  }, 

  {
    "value": "YOU!",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny pointed back to the gypsy.",
    "type": "action"
  }, 

  {
    "value": "YES! YEEEEEEEES! YOU! YOURSELF!",
    "character": "Gypsy",
    "type": "dialogue"
  }, 

  {
    "value": "Gypsy revealed the horn behind the hood, and levitated the chair that was behind Vinny, and made Vinny sit in the chair by force.",
    "type": "action"
  }, 

  {
    "value": "WOOW! HEY HEY! Calm down, I need all this, my lady... do not need this formality.",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Hahahahahaha! YOU!",
    "character": "Gypsy",
    "type": "dialogue"
  }, 

  {
    "value": "She pointed at Vinny again.",
    "type": "action"
  }, 

  {
    "value": "Don't fool me! But... Welcome!",
    "character": "Gypsy",
    "type": "dialogue"
  }, 

  {
    "value": "The gypsy smiles and sits on the other chair during the talk.",
    "type": "action"
  }, 

  {
    "value": "A..Ah? Cheating? I'm not wrong about what?",
    "character": "Vinny",
    "type": "dialogue"
  }, 

  {
    "value": "Vinny looks around to see if there was anything suspicious.",
    "type": "action"
  }

]